TMS320C2000 Assembler PC v22.6.0 Tue Dec 20 15:55:16 2022

Copyright (c) 1996-2018 Texas Instruments Incorporated
ttplpfc.asm                                                          PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 G3 C/C++ Codegen                               PC v22.6.0.LTS *
       3              ;* Date/Time created: Tue Dec 20 15:55:14 2022                 *
       4              ;***************************************************************
       5                      .compiler_opts --abi=eabi --cla_support=cla2 --diag_wrap=off --float_support=fpu64 --hll_source=on --
       6                      .asg    XAR2, FP
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("../ttplpfc/ttplpfc.c")
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 G3 C/C++ Codegen PC v22.6.0.LTS Copyright (c) 1996-2
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("C:\Users\gerar\workspace_v12\7.4kW_OBC_F28003x\RELEASE")
      13              
      14              $C$DW$1 .dwtag  DW_TAG_subprogram
      15                      .dwattr $C$DW$1, DW_AT_name("SFRA_F32_reset")
      16                      .dwattr $C$DW$1, DW_AT_linkage_name("SFRA_F32_reset")

    8002                      .dwattr $C$DW$426, DW_AT_decl_line(0xfa)
    8003                      .dwattr $C$DW$426, DW_AT_decl_column(0x09)
    8004              
    8005              $C$DW$427       .dwtag  DW_TAG_enumerator
    8006                      .dwattr $C$DW$427, DW_AT_name("pwmSwState_positiveZeroCrossing1")
    8007                      .dwattr $C$DW$427, DW_AT_const_value(0x06)
    8008                      .dwattr $C$DW$427, DW_AT_decl_file("..\ttplpfc\ttplpfc.h")
    8009                      .dwattr $C$DW$427, DW_AT_decl_line(0xfb)
    8010                      .dwattr $C$DW$427, DW_AT_decl_column(0x09)
    8011              
    8012              $C$DW$428       .dwtag  DW_TAG_enumerator
    8013                      .dwattr $C$DW$428, DW_AT_name("pwmSwState_positiveZeroCrossing2")
    8014                      .dwattr $C$DW$428, DW_AT_const_value(0x07)
    8015                      .dwattr $C$DW$428, DW_AT_decl_file("..\ttplpfc\ttplpfc.h")
    8016                      .dwattr $C$DW$428, DW_AT_decl_line(0xfc)
    8017                      .dwattr $C$DW$428, DW_AT_decl_column(0x09)
    8018              
    8019              $C$DW$429       .dwtag  DW_TAG_enumerator
    8020                      .dwattr $C$DW$429, DW_AT_name("pwmSwState_positiveZeroCrossing3")
    8021                      .dwattr $C$DW$429, DW_AT_const_value(0x08)
    8022                      .dwattr $C$DW$429, DW_AT_decl_file("..\ttplpfc\ttplpfc.h")
    8023                      .dwattr $C$DW$429, DW_AT_decl_line(0xfd)
    8024                      .dwattr $C$DW$429, DW_AT_decl_column(0x09)
    8025              
    8026              $C$DW$430       .dwtag  DW_TAG_enumerator
    8027                      .dwattr $C$DW$430, DW_AT_name("pwmSwState_defaultState")
    8028                      .dwattr $C$DW$430, DW_AT_const_value(0x09)
    8029                      .dwattr $C$DW$430, DW_AT_decl_file("..\ttplpfc\ttplpfc.h")
    8030                      .dwattr $C$DW$430, DW_AT_decl_line(0xfe)
    8031                      .dwattr $C$DW$430, DW_AT_decl_column(0x09)
    8032              
    8033                      .dwattr $C$DW$T$53, DW_AT_decl_file("..\ttplpfc\ttplpfc.h")
    8034                      .dwattr $C$DW$T$53, DW_AT_decl_line(0xf4)
    8035                      .dwattr $C$DW$T$53, DW_AT_decl_column(0x05)
    8036                      .dwendtag $C$DW$T$53
    8037              
    8038                      .dwendtag $C$DW$TU$53
    8039              
    8040              
    8041              $C$DW$TU$55     .dwtag  DW_TAG_type_unit
    8042                      .dwmtype  $C$DW$T$55
    8043              
    8044              $C$DW$T$55      .dwtag  DW_TAG_enumeration_type
    8045                      .dwattr $C$DW$T$55, DW_AT_byte_size(0x01)
    8046              $C$DW$431       .dwtag  DW_TAG_enumerator
    8047                      .dwattr $C$DW$431, DW_AT_name("interleavingState_1ph")
    8048                      .dwattr $C$DW$431, DW_AT_const_value(0x00)
TMS320C2000 Assembler PC v22.6.0 Tue Dec 20 15:55:16 2022

Copyright (c) 1996-2018 Texas Instruments Incorporated
ttplpfc.asm                                                          PAGE  170

    8049                      .dwattr $C$DW$431, DW_AT_decl_file("..\ttplpfc\ttplpfc.h")
    8050                      .dwattr $C$DW$431, DW_AT_decl_line(0x108)
    8051                      .dwattr $C$DW$431, DW_AT_decl_column(0x09)
    8052              
    8053              $C$DW$432       .dwtag  DW_TAG_enumerator
    8054                      .dwattr $C$DW$432, DW_AT_name("interleavingState_2ph")
    8055                      .dwattr $C$DW$432, DW_AT_const_value(0x01)
    8056                      .dwattr $C$DW$432, DW_AT_decl_file("..\ttplpfc\ttplpfc.h")
    8057                      .dwattr $C$DW$432, DW_AT_decl_line(0x109)
    8058                      .dwattr $C$DW$432, DW_AT_decl_column(0x09)
    8059              
    8060              $C$DW$433       .dwtag  DW_TAG_enumerator
    8061                      .dwattr $C$DW$433, DW_AT_name("interleavingState_3ph")
    8062                      .dwattr $C$DW$433, DW_AT_const_value(0x02)
    8063                      .dwattr $C$DW$433, DW_AT_decl_file("..\ttplpfc\ttplpfc.h")
    8064                      .dwattr $C$DW$433, DW_AT_decl_line(0x10a)
    8065                      .dwattr $C$DW$433, DW_AT_decl_column(0x09)
    8066              
    8067                      .dwattr $C$DW$T$55, DW_AT_decl_file("..\ttplpfc\ttplpfc.h")
    8068                      .dwattr $C$DW$T$55, DW_AT_decl_line(0x107)
    8069                      .dwattr $C$DW$T$55, DW_AT_decl_column(0x05)
    8070                      .dwendtag $C$DW$T$55
    8071              
    8072                      .dwendtag $C$DW$TU$55
    8073              
    8074              
    8075              $C$DW$TU$23     .dwtag  DW_TAG_type_unit
    8076                      .dwmtype  $C$DW$T$23
    8077              
    8078              $C$DW$T$23      .dwtag  DW_TAG_structure_type
    8079                      .dwattr $C$DW$T$23, DW_AT_byte_size(0x1a)
    8080              $C$DW$434       .dwtag  DW_TAG_member
    8081                      .dwattr $C$DW$434, DW_AT_type(*$C$DW$T$20)
    8082                      .dwattr $C$DW$434, DW_AT_name("inputPtr1")
    8083                      .dwattr $C$DW$434, DW_AT_accessibility(DW_ACCESS_public)
    8084                      .dwattr $C$DW$434, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/utilitie
    8085                      .dwattr $C$DW$434, DW_AT_decl_line(0x42)
    8086                      .dwattr $C$DW$434, DW_AT_decl_column(0x0d)
    8087              
    8088              $C$DW$435       .dwtag  DW_TAG_member
    8089                      .dwattr $C$DW$435, DW_AT_type(*$C$DW$T$20)
    8090                      .dwattr $C$DW$435, DW_AT_name("inputPtr2")
    8091                      .dwattr $C$DW$435, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    8092                      .dwattr $C$DW$435, DW_AT_accessibility(DW_ACCESS_public)
    8093                      .dwattr $C$DW$435, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/utilitie
    8094                      .dwattr $C$DW$435, DW_AT_decl_line(0x43)
    8095                      .dwattr $C$DW$435, DW_AT_decl_column(0x0d)
    8096              
    8097              $C$DW$436       .dwtag  DW_TAG_member
    8098                      .dwattr $C$DW$436, DW_AT_type(*$C$DW$T$20)
    8099                      .dwattr $C$DW$436, DW_AT_name("inputPtr3")
    8100                      .dwattr $C$DW$436, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    8101                      .dwattr $C$DW$436, DW_AT_accessibility(DW_ACCESS_public)
    8102                      .dwattr $C$DW$436, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/utilitie
    8103                      .dwattr $C$DW$436, DW_AT_decl_line(0x44)
TMS320C2000 Assembler PC v22.6.0 Tue Dec 20 15:55:16 2022

Copyright (c) 1996-2018 Texas Instruments Incorporated
ttplpfc.asm                                                          PAGE  171

    8104                      .dwattr $C$DW$436, DW_AT_decl_column(0x0d)
    8105              
    8106              $C$DW$437       .dwtag  DW_TAG_member
    8107                      .dwattr $C$DW$437, DW_AT_type(*$C$DW$T$20)
    8108                      .dwattr $C$DW$437, DW_AT_name("inputPtr4")
    8109                      .dwattr $C$DW$437, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    8110                      .dwattr $C$DW$437, DW_AT_accessibility(DW_ACCESS_public)
    8111                      .dwattr $C$DW$437, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/utilitie
    8112                      .dwattr $C$DW$437, DW_AT_decl_line(0x45)
    8113                      .dwattr $C$DW$437, DW_AT_decl_column(0x0d)
    8114              
    8115              $C$DW$438       .dwtag  DW_TAG_member
    8116                      .dwattr $C$DW$438, DW_AT_type(*$C$DW$T$20)
    8117                      .dwattr $C$DW$438, DW_AT_name("outputPtr1")
    8118                      .dwattr $C$DW$438, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    8119                      .dwattr $C$DW$438, DW_AT_accessibility(DW_ACCESS_public)
    8120                      .dwattr $C$DW$438, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/utilitie
    8121                      .dwattr $C$DW$438, DW_AT_decl_line(0x46)
    8122                      .dwattr $C$DW$438, DW_AT_decl_column(0x0d)
    8123              
    8124              $C$DW$439       .dwtag  DW_TAG_member
    8125                      .dwattr $C$DW$439, DW_AT_type(*$C$DW$T$20)
    8126                      .dwattr $C$DW$439, DW_AT_name("outputPtr2")
    8127                      .dwattr $C$DW$439, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    8128                      .dwattr $C$DW$439, DW_AT_accessibility(DW_ACCESS_public)
    8129                      .dwattr $C$DW$439, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/utilitie
    8130                      .dwattr $C$DW$439, DW_AT_decl_line(0x47)
    8131                      .dwattr $C$DW$439, DW_AT_decl_column(0x0d)
    8132              
    8133              $C$DW$440       .dwtag  DW_TAG_member
    8134                      .dwattr $C$DW$440, DW_AT_type(*$C$DW$T$20)
    8135                      .dwattr $C$DW$440, DW_AT_name("outputPtr3")
    8136                      .dwattr $C$DW$440, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    8137                      .dwattr $C$DW$440, DW_AT_accessibility(DW_ACCESS_public)
    8138                      .dwattr $C$DW$440, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/utilitie
    8139                      .dwattr $C$DW$440, DW_AT_decl_line(0x48)
    8140                      .dwattr $C$DW$440, DW_AT_decl_column(0x0d)
    8141              
    8142              $C$DW$441       .dwtag  DW_TAG_member
    8143                      .dwattr $C$DW$441, DW_AT_type(*$C$DW$T$20)
    8144                      .dwattr $C$DW$441, DW_AT_name("outputPtr4")
    8145                      .dwattr $C$DW$441, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    8146                      .dwattr $C$DW$441, DW_AT_accessibility(DW_ACCESS_public)
    8147                      .dwattr $C$DW$441, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/utilitie
    8148                      .dwattr $C$DW$441, DW_AT_decl_line(0x49)
    8149                      .dwattr $C$DW$441, DW_AT_decl_column(0x0d)
    8150              
    8151              $C$DW$442       .dwtag  DW_TAG_member
    8152                      .dwattr $C$DW$442, DW_AT_type(*$C$DW$T$19)
    8153                      .dwattr $C$DW$442, DW_AT_name("prevValue")
    8154                      .dwattr $C$DW$442, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    8155                      .dwattr $C$DW$442, DW_AT_accessibility(DW_ACCESS_public)
    8156                      .dwattr $C$DW$442, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/utilitie
    8157                      .dwattr $C$DW$442, DW_AT_decl_line(0x4a)
    8158                      .dwattr $C$DW$442, DW_AT_decl_column(0x0c)
TMS320C2000 Assembler PC v22.6.0 Tue Dec 20 15:55:16 2022

Copyright (c) 1996-2018 Texas Instruments Incorporated
ttplpfc.asm                                                          PAGE  172

    8159              
    8160              $C$DW$443       .dwtag  DW_TAG_member
    8161                      .dwattr $C$DW$443, DW_AT_type(*$C$DW$T$19)
    8162                      .dwattr $C$DW$443, DW_AT_name("trigValue")
    8163                      .dwattr $C$DW$443, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    8164                      .dwattr $C$DW$443, DW_AT_accessibility(DW_ACCESS_public)
    8165                      .dwattr $C$DW$443, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/utilitie
    8166                      .dwattr $C$DW$443, DW_AT_decl_line(0x4b)
    8167                      .dwattr $C$DW$443, DW_AT_decl_column(0x0c)
    8168              
    8169              $C$DW$444       .dwtag  DW_TAG_member
    8170                      .dwattr $C$DW$444, DW_AT_type(*$C$DW$T$22)
    8171                      .dwattr $C$DW$444, DW_AT_name("status")
    8172                      .dwattr $C$DW$444, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    8173                      .dwattr $C$DW$444, DW_AT_accessibility(DW_ACCESS_public)
    8174                      .dwattr $C$DW$444, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/utilitie
    8175                      .dwattr $C$DW$444, DW_AT_decl_line(0x4c)
    8176                      .dwattr $C$DW$444, DW_AT_decl_column(0x0a)
    8177              
    8178              $C$DW$445       .dwtag  DW_TAG_member
    8179                      .dwattr $C$DW$445, DW_AT_type(*$C$DW$T$22)
    8180                      .dwattr $C$DW$445, DW_AT_name("preScalar")
    8181                      .dwattr $C$DW$445, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
    8182                      .dwattr $C$DW$445, DW_AT_accessibility(DW_ACCESS_public)
    8183                      .dwattr $C$DW$445, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/utilitie
    8184                      .dwattr $C$DW$445, DW_AT_decl_line(0x4d)
    8185                      .dwattr $C$DW$445, DW_AT_decl_column(0x0a)
    8186              
    8187              $C$DW$446       .dwtag  DW_TAG_member
    8188                      .dwattr $C$DW$446, DW_AT_type(*$C$DW$T$22)
    8189                      .dwattr $C$DW$446, DW_AT_name("skipCount")
    8190                      .dwattr $C$DW$446, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    8191                      .dwattr $C$DW$446, DW_AT_accessibility(DW_ACCESS_public)
    8192                      .dwattr $C$DW$446, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/utilitie
    8193                      .dwattr $C$DW$446, DW_AT_decl_line(0x4e)
    8194                      .dwattr $C$DW$446, DW_AT_decl_column(0x0a)
    8195              
    8196              $C$DW$447       .dwtag  DW_TAG_member
    8197                      .dwattr $C$DW$447, DW_AT_type(*$C$DW$T$22)
    8198                      .dwattr $C$DW$447, DW_AT_name("size")
    8199                      .dwattr $C$DW$447, DW_AT_data_member_location[DW_OP_plus_uconst 0x17]
    8200                      .dwattr $C$DW$447, DW_AT_accessibility(DW_ACCESS_public)
    8201                      .dwattr $C$DW$447, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/utilitie
    8202                      .dwattr $C$DW$447, DW_AT_decl_line(0x4f)
    8203                      .dwattr $C$DW$447, DW_AT_decl_column(0x0a)
    8204              
    8205              $C$DW$448       .dwtag  DW_TAG_member
    8206                      .dwattr $C$DW$448, DW_AT_type(*$C$DW$T$22)
    8207                      .dwattr $C$DW$448, DW_AT_name("count")
    8208                      .dwattr $C$DW$448, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    8209                      .dwattr $C$DW$448, DW_AT_accessibility(DW_ACCESS_public)
    8210                      .dwattr $C$DW$448, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/utilitie
    8211                      .dwattr $C$DW$448, DW_AT_decl_line(0x50)
    8212                      .dwattr $C$DW$448, DW_AT_decl_column(0x0a)
    8213              
TMS320C2000 Assembler PC v22.6.0 Tue Dec 20 15:55:16 2022

Copyright (c) 1996-2018 Texas Instruments Incorporated
ttplpfc.asm                                                          PAGE  173

    8214                      .dwattr $C$DW$T$23, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/utiliti
    8215                      .dwattr $C$DW$T$23, DW_AT_decl_line(0x41)
    8216                      .dwattr $C$DW$T$23, DW_AT_decl_column(0x18)
    8217                      .dwendtag $C$DW$T$23
    8218              
    8219                      .dwendtag $C$DW$TU$23
    8220              
    8221              
    8222              $C$DW$TU$76     .dwtag  DW_TAG_type_unit
    8223                      .dwmtype  $C$DW$T$76
    8224              $C$DW$449       .dwtag  DW_TAG_TI_far_type
    8225                      .dwattr $C$DW$449, DW_AT_type(*$C$DW$T$23)
    8226              
    8227              $C$DW$T$76      .dwtag  DW_TAG_volatile_type
    8228                      .dwattr $C$DW$T$76, DW_AT_type(*$C$DW$449)
    8229              
    8230                      .dwendtag $C$DW$TU$76
    8231              
    8232              
    8233              $C$DW$TU$77     .dwtag  DW_TAG_type_unit
    8234                      .dwmtype  $C$DW$T$77
    8235              $C$DW$T$77      .dwtag  DW_TAG_typedef
    8236                      .dwattr $C$DW$T$77, DW_AT_name("DLOG_4CH")
    8237                      .dwattr $C$DW$T$77, DW_AT_type(*$C$DW$T$76)
    8238                      .dwattr $C$DW$T$77, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/utiliti
    8239                      .dwattr $C$DW$T$77, DW_AT_decl_line(0x51)
    8240                      .dwattr $C$DW$T$77, DW_AT_decl_column(0x03)
    8241              
    8242                      .dwendtag $C$DW$TU$77
    8243              
    8244              
    8245              $C$DW$TU$24     .dwtag  DW_TAG_type_unit
    8246                      .dwmtype  $C$DW$T$24
    8247              
    8248              $C$DW$T$24      .dwtag  DW_TAG_structure_type
    8249                      .dwattr $C$DW$T$24, DW_AT_byte_size(0x06)
    8250              $C$DW$450       .dwtag  DW_TAG_member
    8251                      .dwattr $C$DW$450, DW_AT_type(*$C$DW$T$19)
    8252                      .dwattr $C$DW$450, DW_AT_name("freq")
    8253                      .dwattr $C$DW$450, DW_AT_accessibility(DW_ACCESS_public)
    8254                      .dwattr $C$DW$450, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/utilitie
    8255                      .dwattr $C$DW$450, DW_AT_decl_line(0x43)
    8256                      .dwattr $C$DW$450, DW_AT_decl_column(0x10)
    8257              
    8258              $C$DW$451       .dwtag  DW_TAG_member
    8259                      .dwattr $C$DW$451, DW_AT_type(*$C$DW$T$19)
    8260                      .dwattr $C$DW$451, DW_AT_name("stepAngleMax")
    8261                      .dwattr $C$DW$451, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    8262                      .dwattr $C$DW$451, DW_AT_accessibility(DW_ACCESS_public)
    8263                      .dwattr $C$DW$451, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/utilitie
    8264                      .dwattr $C$DW$451, DW_AT_decl_line(0x44)
    8265                      .dwattr $C$DW$451, DW_AT_decl_column(0x10)
    8266              
    8267              $C$DW$452       .dwtag  DW_TAG_member
    8268                      .dwattr $C$DW$452, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v22.6.0 Tue Dec 20 15:55:16 2022

Copyright (c) 1996-2018 Texas Instruments Incorporated
ttplpfc.asm                                                          PAGE  174

    8269                      .dwattr $C$DW$452, DW_AT_name("out")
    8270                      .dwattr $C$DW$452, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    8271                      .dwattr $C$DW$452, DW_AT_accessibility(DW_ACCESS_public)
    8272                      .dwattr $C$DW$452, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/utilitie
    8273                      .dwattr $C$DW$452, DW_AT_decl_line(0x45)
    8274                      .dwattr $C$DW$452, DW_AT_decl_column(0x10)
    8275              
    8276                      .dwattr $C$DW$T$24, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/utiliti
    8277                      .dwattr $C$DW$T$24, DW_AT_decl_line(0x42)
    8278                      .dwattr $C$DW$T$24, DW_AT_decl_column(0x19)
    8279                      .dwendtag $C$DW$T$24
    8280              
    8281                      .dwendtag $C$DW$TU$24
    8282              
    8283              
    8284              $C$DW$TU$79     .dwtag  DW_TAG_type_unit
    8285                      .dwmtype  $C$DW$T$79
    8286              $C$DW$453       .dwtag  DW_TAG_TI_far_type
    8287                      .dwattr $C$DW$453, DW_AT_type(*$C$DW$T$24)
    8288              
    8289              $C$DW$T$79      .dwtag  DW_TAG_volatile_type
    8290                      .dwattr $C$DW$T$79, DW_AT_type(*$C$DW$453)
    8291              
    8292                      .dwendtag $C$DW$TU$79
    8293              
    8294              
    8295              $C$DW$TU$80     .dwtag  DW_TAG_type_unit
    8296                      .dwmtype  $C$DW$T$80
    8297              $C$DW$T$80      .dwtag  DW_TAG_typedef
    8298                      .dwattr $C$DW$T$80, DW_AT_name("RAMPGEN")
    8299                      .dwattr $C$DW$T$80, DW_AT_type(*$C$DW$T$79)
    8300                      .dwattr $C$DW$T$80, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/utiliti
    8301                      .dwattr $C$DW$T$80, DW_AT_decl_line(0x46)
    8302                      .dwattr $C$DW$T$80, DW_AT_decl_column(0x03)
    8303              
    8304                      .dwendtag $C$DW$TU$80
    8305              
    8306              
    8307              $C$DW$TU$25     .dwtag  DW_TAG_type_unit
    8308                      .dwmtype  $C$DW$T$25
    8309              
    8310              $C$DW$T$25      .dwtag  DW_TAG_structure_type
    8311                      .dwattr $C$DW$T$25, DW_AT_byte_size(0x14)
    8312              $C$DW$454       .dwtag  DW_TAG_member
    8313                      .dwattr $C$DW$454, DW_AT_type(*$C$DW$T$19)
    8314                      .dwattr $C$DW$454, DW_AT_name("osg_k")
    8315                      .dwattr $C$DW$454, DW_AT_accessibility(DW_ACCESS_public)
    8316                      .dwattr $C$DW$454, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/spll/spl
    8317                      .dwattr $C$DW$454, DW_AT_decl_line(0x41)
    8318                      .dwattr $C$DW$454, DW_AT_decl_column(0x0f)
    8319              
    8320              $C$DW$455       .dwtag  DW_TAG_member
    8321                      .dwattr $C$DW$455, DW_AT_type(*$C$DW$T$19)
    8322                      .dwattr $C$DW$455, DW_AT_name("osg_x")
    8323                      .dwattr $C$DW$455, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
TMS320C2000 Assembler PC v22.6.0 Tue Dec 20 15:55:16 2022

Copyright (c) 1996-2018 Texas Instruments Incorporated
ttplpfc.asm                                                          PAGE  175

    8324                      .dwattr $C$DW$455, DW_AT_accessibility(DW_ACCESS_public)
    8325                      .dwattr $C$DW$455, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/spll/spl
    8326                      .dwattr $C$DW$455, DW_AT_decl_line(0x42)
    8327                      .dwattr $C$DW$455, DW_AT_decl_column(0x0f)
    8328              
    8329              $C$DW$456       .dwtag  DW_TAG_member
    8330                      .dwattr $C$DW$456, DW_AT_type(*$C$DW$T$19)
    8331                      .dwattr $C$DW$456, DW_AT_name("osg_y")
    8332                      .dwattr $C$DW$456, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    8333                      .dwattr $C$DW$456, DW_AT_accessibility(DW_ACCESS_public)
    8334                      .dwattr $C$DW$456, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/spll/spl
    8335                      .dwattr $C$DW$456, DW_AT_decl_line(0x43)
    8336                      .dwattr $C$DW$456, DW_AT_decl_column(0x0f)
    8337              
    8338              $C$DW$457       .dwtag  DW_TAG_member
    8339                      .dwattr $C$DW$457, DW_AT_type(*$C$DW$T$19)
    8340                      .dwattr $C$DW$457, DW_AT_name("osg_b0")
    8341                      .dwattr $C$DW$457, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    8342                      .dwattr $C$DW$457, DW_AT_accessibility(DW_ACCESS_public)
    8343                      .dwattr $C$DW$457, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/spll/spl
    8344                      .dwattr $C$DW$457, DW_AT_decl_line(0x44)
    8345                      .dwattr $C$DW$457, DW_AT_decl_column(0x0f)
    8346              
    8347              $C$DW$458       .dwtag  DW_TAG_member
    8348                      .dwattr $C$DW$458, DW_AT_type(*$C$DW$T$19)
    8349                      .dwattr $C$DW$458, DW_AT_name("osg_b2")
    8350                      .dwattr $C$DW$458, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    8351                      .dwattr $C$DW$458, DW_AT_accessibility(DW_ACCESS_public)
    8352                      .dwattr $C$DW$458, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/spll/spl
    8353                      .dwattr $C$DW$458, DW_AT_decl_line(0x45)
    8354                      .dwattr $C$DW$458, DW_AT_decl_column(0x0f)
    8355              
    8356              $C$DW$459       .dwtag  DW_TAG_member
    8357                      .dwattr $C$DW$459, DW_AT_type(*$C$DW$T$19)
    8358                      .dwattr $C$DW$459, DW_AT_name("osg_a1")
    8359                      .dwattr $C$DW$459, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    8360                      .dwattr $C$DW$459, DW_AT_accessibility(DW_ACCESS_public)
    8361                      .dwattr $C$DW$459, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/spll/spl
    8362                      .dwattr $C$DW$459, DW_AT_decl_line(0x46)
    8363                      .dwattr $C$DW$459, DW_AT_decl_column(0x0f)
    8364              
    8365              $C$DW$460       .dwtag  DW_TAG_member
    8366                      .dwattr $C$DW$460, DW_AT_type(*$C$DW$T$19)
    8367                      .dwattr $C$DW$460, DW_AT_name("osg_a2")
    8368                      .dwattr $C$DW$460, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    8369                      .dwattr $C$DW$460, DW_AT_accessibility(DW_ACCESS_public)
    8370                      .dwattr $C$DW$460, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/spll/spl
    8371                      .dwattr $C$DW$460, DW_AT_decl_line(0x47)
    8372                      .dwattr $C$DW$460, DW_AT_decl_column(0x0f)
    8373              
    8374              $C$DW$461       .dwtag  DW_TAG_member
    8375                      .dwattr $C$DW$461, DW_AT_type(*$C$DW$T$19)
    8376                      .dwattr $C$DW$461, DW_AT_name("osg_qb0")
    8377                      .dwattr $C$DW$461, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    8378                      .dwattr $C$DW$461, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v22.6.0 Tue Dec 20 15:55:16 2022

Copyright (c) 1996-2018 Texas Instruments Incorporated
ttplpfc.asm                                                          PAGE  176

    8379                      .dwattr $C$DW$461, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/spll/spl
    8380                      .dwattr $C$DW$461, DW_AT_decl_line(0x48)
    8381                      .dwattr $C$DW$461, DW_AT_decl_column(0x0f)
    8382              
    8383              $C$DW$462       .dwtag  DW_TAG_member
    8384                      .dwattr $C$DW$462, DW_AT_type(*$C$DW$T$19)
    8385                      .dwattr $C$DW$462, DW_AT_name("osg_qb1")
    8386                      .dwattr $C$DW$462, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    8387                      .dwattr $C$DW$462, DW_AT_accessibility(DW_ACCESS_public)
    8388                      .dwattr $C$DW$462, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/spll/spl
    8389                      .dwattr $C$DW$462, DW_AT_decl_line(0x49)
    8390                      .dwattr $C$DW$462, DW_AT_decl_column(0x0f)
    8391              
    8392              $C$DW$463       .dwtag  DW_TAG_member
    8393                      .dwattr $C$DW$463, DW_AT_type(*$C$DW$T$19)
    8394                      .dwattr $C$DW$463, DW_AT_name("osg_qb2")
    8395                      .dwattr $C$DW$463, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    8396                      .dwattr $C$DW$463, DW_AT_accessibility(DW_ACCESS_public)
    8397                      .dwattr $C$DW$463, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/spll/spl
    8398                      .dwattr $C$DW$463, DW_AT_decl_line(0x4a)
    8399                      .dwattr $C$DW$463, DW_AT_decl_column(0x0f)
    8400              
    8401                      .dwattr $C$DW$T$25, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/spll/sp
    8402                      .dwattr $C$DW$T$25, DW_AT_decl_line(0x40)
    8403                      .dwattr $C$DW$T$25, DW_AT_decl_column(0x0f)
    8404                      .dwendtag $C$DW$T$25
    8405              
    8406                      .dwendtag $C$DW$TU$25
    8407              
    8408              
    8409              $C$DW$TU$29     .dwtag  DW_TAG_type_unit
    8410                      .dwmtype  $C$DW$T$29
    8411              $C$DW$T$29      .dwtag  DW_TAG_typedef
    8412                      .dwattr $C$DW$T$29, DW_AT_name("SPLL_1PH_SOGI_OSG_COEFF")
    8413                      .dwattr $C$DW$T$29, DW_AT_type(*$C$DW$T$25)
    8414                      .dwattr $C$DW$T$29, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/spll/sp
    8415                      .dwattr $C$DW$T$29, DW_AT_decl_line(0x4b)
    8416                      .dwattr $C$DW$T$29, DW_AT_decl_column(0x03)
    8417              
    8418                      .dwendtag $C$DW$TU$29
    8419              
    8420              
    8421              $C$DW$TU$26     .dwtag  DW_TAG_type_unit
    8422                      .dwmtype  $C$DW$T$26
    8423              
    8424              $C$DW$T$26      .dwtag  DW_TAG_structure_type
    8425                      .dwattr $C$DW$T$26, DW_AT_byte_size(0x04)
    8426              $C$DW$464       .dwtag  DW_TAG_member
    8427                      .dwattr $C$DW$464, DW_AT_type(*$C$DW$T$19)
    8428                      .dwattr $C$DW$464, DW_AT_name("b1")
    8429                      .dwattr $C$DW$464, DW_AT_accessibility(DW_ACCESS_public)
    8430                      .dwattr $C$DW$464, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/spll/spl
    8431                      .dwattr $C$DW$464, DW_AT_decl_line(0x50)
    8432                      .dwattr $C$DW$464, DW_AT_decl_column(0x0f)
    8433              
TMS320C2000 Assembler PC v22.6.0 Tue Dec 20 15:55:16 2022

Copyright (c) 1996-2018 Texas Instruments Incorporated
ttplpfc.asm                                                          PAGE  177

    8434              $C$DW$465       .dwtag  DW_TAG_member
    8435                      .dwattr $C$DW$465, DW_AT_type(*$C$DW$T$19)
    8436                      .dwattr $C$DW$465, DW_AT_name("b0")
    8437                      .dwattr $C$DW$465, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    8438                      .dwattr $C$DW$465, DW_AT_accessibility(DW_ACCESS_public)
    8439                      .dwattr $C$DW$465, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/spll/spl
    8440                      .dwattr $C$DW$465, DW_AT_decl_line(0x51)
    8441                      .dwattr $C$DW$465, DW_AT_decl_column(0x0f)
    8442              
    8443                      .dwattr $C$DW$T$26, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/spll/sp
    8444                      .dwattr $C$DW$T$26, DW_AT_decl_line(0x4f)
    8445                      .dwattr $C$DW$T$26, DW_AT_decl_column(0x0f)
    8446                      .dwendtag $C$DW$T$26
    8447              
    8448                      .dwendtag $C$DW$TU$26
    8449              
    8450              
    8451              $C$DW$TU$30     .dwtag  DW_TAG_type_unit
    8452                      .dwmtype  $C$DW$T$30
    8453              $C$DW$T$30      .dwtag  DW_TAG_typedef
    8454                      .dwattr $C$DW$T$30, DW_AT_name("SPLL_1PH_SOGI_LPF_COEFF")
    8455                      .dwattr $C$DW$T$30, DW_AT_type(*$C$DW$T$26)
    8456                      .dwattr $C$DW$T$30, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/spll/sp
    8457                      .dwattr $C$DW$T$30, DW_AT_decl_line(0x52)
    8458                      .dwattr $C$DW$T$30, DW_AT_decl_column(0x03)
    8459              
    8460                      .dwendtag $C$DW$TU$30
    8461              
    8462              
    8463              $C$DW$TU$31     .dwtag  DW_TAG_type_unit
    8464                      .dwmtype  $C$DW$T$31
    8465              
    8466              $C$DW$T$31      .dwtag  DW_TAG_structure_type
    8467                      .dwattr $C$DW$T$31, DW_AT_byte_size(0x42)
    8468              $C$DW$466       .dwtag  DW_TAG_member
    8469                      .dwattr $C$DW$466, DW_AT_type(*$C$DW$T$27)
    8470                      .dwattr $C$DW$466, DW_AT_name("u")
    8471                      .dwattr $C$DW$466, DW_AT_accessibility(DW_ACCESS_public)
    8472                      .dwattr $C$DW$466, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/spll/spl
    8473                      .dwattr $C$DW$466, DW_AT_decl_line(0x5c)
    8474                      .dwattr $C$DW$466, DW_AT_decl_column(0x11)
    8475              
    8476              $C$DW$467       .dwtag  DW_TAG_member
    8477                      .dwattr $C$DW$467, DW_AT_type(*$C$DW$T$27)
    8478                      .dwattr $C$DW$467, DW_AT_name("osg_u")
    8479                      .dwattr $C$DW$467, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    8480                      .dwattr $C$DW$467, DW_AT_accessibility(DW_ACCESS_public)
    8481                      .dwattr $C$DW$467, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/spll/spl
    8482                      .dwattr $C$DW$467, DW_AT_decl_line(0x5d)
    8483                      .dwattr $C$DW$467, DW_AT_decl_column(0x11)
    8484              
    8485              $C$DW$468       .dwtag  DW_TAG_member
    8486                      .dwattr $C$DW$468, DW_AT_type(*$C$DW$T$27)
    8487                      .dwattr $C$DW$468, DW_AT_name("osg_qu")
    8488                      .dwattr $C$DW$468, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
TMS320C2000 Assembler PC v22.6.0 Tue Dec 20 15:55:16 2022

Copyright (c) 1996-2018 Texas Instruments Incorporated
ttplpfc.asm                                                          PAGE  178

    8489                      .dwattr $C$DW$468, DW_AT_accessibility(DW_ACCESS_public)
    8490                      .dwattr $C$DW$468, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/spll/spl
    8491                      .dwattr $C$DW$468, DW_AT_decl_line(0x5e)
    8492                      .dwattr $C$DW$468, DW_AT_decl_column(0x11)
    8493              
    8494              $C$DW$469       .dwtag  DW_TAG_member
    8495                      .dwattr $C$DW$469, DW_AT_type(*$C$DW$T$28)
    8496                      .dwattr $C$DW$469, DW_AT_name("u_Q")
    8497                      .dwattr $C$DW$469, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    8498                      .dwattr $C$DW$469, DW_AT_accessibility(DW_ACCESS_public)
    8499                      .dwattr $C$DW$469, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/spll/spl
    8500                      .dwattr $C$DW$469, DW_AT_decl_line(0x5f)
    8501                      .dwattr $C$DW$469, DW_AT_decl_column(0x11)
    8502              
    8503              $C$DW$470       .dwtag  DW_TAG_member
    8504                      .dwattr $C$DW$470, DW_AT_type(*$C$DW$T$28)
    8505                      .dwattr $C$DW$470, DW_AT_name("u_D")
    8506                      .dwattr $C$DW$470, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    8507                      .dwattr $C$DW$470, DW_AT_accessibility(DW_ACCESS_public)
    8508                      .dwattr $C$DW$470, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/spll/spl
    8509                      .dwattr $C$DW$470, DW_AT_decl_line(0x60)
    8510                      .dwattr $C$DW$470, DW_AT_decl_column(0x11)
    8511              
    8512              $C$DW$471       .dwtag  DW_TAG_member
    8513                      .dwattr $C$DW$471, DW_AT_type(*$C$DW$T$28)
    8514                      .dwattr $C$DW$471, DW_AT_name("ylf")
    8515                      .dwattr $C$DW$471, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    8516                      .dwattr $C$DW$471, DW_AT_accessibility(DW_ACCESS_public)
    8517                      .dwattr $C$DW$471, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/spll/spl
    8518                      .dwattr $C$DW$471, DW_AT_decl_line(0x61)
    8519                      .dwattr $C$DW$471, DW_AT_decl_column(0x11)
    8520              
    8521              $C$DW$472       .dwtag  DW_TAG_member
    8522                      .dwattr $C$DW$472, DW_AT_type(*$C$DW$T$19)
    8523                      .dwattr $C$DW$472, DW_AT_name("fo")
    8524                      .dwattr $C$DW$472, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    8525                      .dwattr $C$DW$472, DW_AT_accessibility(DW_ACCESS_public)
    8526                      .dwattr $C$DW$472, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/spll/spl
    8527                      .dwattr $C$DW$472, DW_AT_decl_line(0x62)
    8528                      .dwattr $C$DW$472, DW_AT_decl_column(0x11)
    8529              
    8530              $C$DW$473       .dwtag  DW_TAG_member
    8531                      .dwattr $C$DW$473, DW_AT_type(*$C$DW$T$19)
    8532                      .dwattr $C$DW$473, DW_AT_name("fn")
    8533                      .dwattr $C$DW$473, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    8534                      .dwattr $C$DW$473, DW_AT_accessibility(DW_ACCESS_public)
    8535                      .dwattr $C$DW$473, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/spll/spl
    8536                      .dwattr $C$DW$473, DW_AT_decl_line(0x63)
    8537                      .dwattr $C$DW$473, DW_AT_decl_column(0x11)
    8538              
    8539              $C$DW$474       .dwtag  DW_TAG_member
    8540                      .dwattr $C$DW$474, DW_AT_type(*$C$DW$T$19)
    8541                      .dwattr $C$DW$474, DW_AT_name("theta")
    8542                      .dwattr $C$DW$474, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    8543                      .dwattr $C$DW$474, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v22.6.0 Tue Dec 20 15:55:16 2022

Copyright (c) 1996-2018 Texas Instruments Incorporated
ttplpfc.asm                                                          PAGE  179

    8544                      .dwattr $C$DW$474, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/spll/spl
    8545                      .dwattr $C$DW$474, DW_AT_decl_line(0x64)
    8546                      .dwattr $C$DW$474, DW_AT_decl_column(0x11)
    8547              
    8548              $C$DW$475       .dwtag  DW_TAG_member
    8549                      .dwattr $C$DW$475, DW_AT_type(*$C$DW$T$19)
    8550                      .dwattr $C$DW$475, DW_AT_name("cosine")
    8551                      .dwattr $C$DW$475, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    8552                      .dwattr $C$DW$475, DW_AT_accessibility(DW_ACCESS_public)
    8553                      .dwattr $C$DW$475, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/spll/spl
    8554                      .dwattr $C$DW$475, DW_AT_decl_line(0x65)
    8555                      .dwattr $C$DW$475, DW_AT_decl_column(0x11)
    8556              
    8557              $C$DW$476       .dwtag  DW_TAG_member
    8558                      .dwattr $C$DW$476, DW_AT_type(*$C$DW$T$19)
    8559                      .dwattr $C$DW$476, DW_AT_name("sine")
    8560                      .dwattr $C$DW$476, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
    8561                      .dwattr $C$DW$476, DW_AT_accessibility(DW_ACCESS_public)
    8562                      .dwattr $C$DW$476, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/spll/spl
    8563                      .dwattr $C$DW$476, DW_AT_decl_line(0x66)
    8564                      .dwattr $C$DW$476, DW_AT_decl_column(0x11)
    8565              
    8566              $C$DW$477       .dwtag  DW_TAG_member
    8567                      .dwattr $C$DW$477, DW_AT_type(*$C$DW$T$19)
    8568                      .dwattr $C$DW$477, DW_AT_name("delta_t")
    8569                      .dwattr $C$DW$477, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    8570                      .dwattr $C$DW$477, DW_AT_accessibility(DW_ACCESS_public)
    8571                      .dwattr $C$DW$477, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/spll/spl
    8572                      .dwattr $C$DW$477, DW_AT_decl_line(0x67)
    8573                      .dwattr $C$DW$477, DW_AT_decl_column(0x11)
    8574              
    8575              $C$DW$478       .dwtag  DW_TAG_member
    8576                      .dwattr $C$DW$478, DW_AT_type(*$C$DW$T$29)
    8577                      .dwattr $C$DW$478, DW_AT_name("osg_coeff")
    8578                      .dwattr $C$DW$478, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
    8579                      .dwattr $C$DW$478, DW_AT_accessibility(DW_ACCESS_public)
    8580                      .dwattr $C$DW$478, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/spll/spl
    8581                      .dwattr $C$DW$478, DW_AT_decl_line(0x68)
    8582                      .dwattr $C$DW$478, DW_AT_decl_column(0x1d)
    8583              
    8584              $C$DW$479       .dwtag  DW_TAG_member
    8585                      .dwattr $C$DW$479, DW_AT_type(*$C$DW$T$30)
    8586                      .dwattr $C$DW$479, DW_AT_name("lpf_coeff")
    8587                      .dwattr $C$DW$479, DW_AT_data_member_location[DW_OP_plus_uconst 0x3e]
    8588                      .dwattr $C$DW$479, DW_AT_accessibility(DW_ACCESS_public)
    8589                      .dwattr $C$DW$479, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/spll/spl
    8590                      .dwattr $C$DW$479, DW_AT_decl_line(0x69)
    8591                      .dwattr $C$DW$479, DW_AT_decl_column(0x1d)
    8592              
    8593                      .dwattr $C$DW$T$31, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/spll/sp
    8594                      .dwattr $C$DW$T$31, DW_AT_decl_line(0x5b)
    8595                      .dwattr $C$DW$T$31, DW_AT_decl_column(0x0f)
    8596                      .dwendtag $C$DW$T$31
    8597              
    8598                      .dwendtag $C$DW$TU$31
TMS320C2000 Assembler PC v22.6.0 Tue Dec 20 15:55:16 2022

Copyright (c) 1996-2018 Texas Instruments Incorporated
ttplpfc.asm                                                          PAGE  180

    8599              
    8600              
    8601              $C$DW$TU$82     .dwtag  DW_TAG_type_unit
    8602                      .dwmtype  $C$DW$T$82
    8603              $C$DW$T$82      .dwtag  DW_TAG_typedef
    8604                      .dwattr $C$DW$T$82, DW_AT_name("SPLL_1PH_SOGI")
    8605                      .dwattr $C$DW$T$82, DW_AT_type(*$C$DW$T$31)
    8606                      .dwattr $C$DW$T$82, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/spll/sp
    8607                      .dwattr $C$DW$T$82, DW_AT_decl_line(0x6a)
    8608                      .dwattr $C$DW$T$82, DW_AT_decl_column(0x03)
    8609              
    8610                      .dwendtag $C$DW$TU$82
    8611              
    8612              
    8613              $C$DW$TU$32     .dwtag  DW_TAG_type_unit
    8614                      .dwmtype  $C$DW$T$32
    8615              
    8616              $C$DW$T$32      .dwtag  DW_TAG_structure_type
    8617                      .dwattr $C$DW$T$32, DW_AT_byte_size(0x0a)
    8618              $C$DW$480       .dwtag  DW_TAG_member
    8619                      .dwattr $C$DW$480, DW_AT_type(*$C$DW$T$19)
    8620                      .dwattr $C$DW$480, DW_AT_name("b2")
    8621                      .dwattr $C$DW$480, DW_AT_accessibility(DW_ACCESS_public)
    8622                      .dwattr $C$DW$480, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/spll/spl
    8623                      .dwattr $C$DW$480, DW_AT_decl_line(0x42)
    8624                      .dwattr $C$DW$480, DW_AT_decl_column(0x0c)
    8625              
    8626              $C$DW$481       .dwtag  DW_TAG_member
    8627                      .dwattr $C$DW$481, DW_AT_type(*$C$DW$T$19)
    8628                      .dwattr $C$DW$481, DW_AT_name("b1")
    8629                      .dwattr $C$DW$481, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    8630                      .dwattr $C$DW$481, DW_AT_accessibility(DW_ACCESS_public)
    8631                      .dwattr $C$DW$481, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/spll/spl
    8632                      .dwattr $C$DW$481, DW_AT_decl_line(0x43)
    8633                      .dwattr $C$DW$481, DW_AT_decl_column(0x0c)
    8634              
    8635              $C$DW$482       .dwtag  DW_TAG_member
    8636                      .dwattr $C$DW$482, DW_AT_type(*$C$DW$T$19)
    8637                      .dwattr $C$DW$482, DW_AT_name("b0")
    8638                      .dwattr $C$DW$482, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    8639                      .dwattr $C$DW$482, DW_AT_accessibility(DW_ACCESS_public)
    8640                      .dwattr $C$DW$482, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/spll/spl
    8641                      .dwattr $C$DW$482, DW_AT_decl_line(0x44)
    8642                      .dwattr $C$DW$482, DW_AT_decl_column(0x0c)
    8643              
    8644              $C$DW$483       .dwtag  DW_TAG_member
    8645                      .dwattr $C$DW$483, DW_AT_type(*$C$DW$T$19)
    8646                      .dwattr $C$DW$483, DW_AT_name("a2")
    8647                      .dwattr $C$DW$483, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    8648                      .dwattr $C$DW$483, DW_AT_accessibility(DW_ACCESS_public)
    8649                      .dwattr $C$DW$483, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/spll/spl
    8650                      .dwattr $C$DW$483, DW_AT_decl_line(0x45)
    8651                      .dwattr $C$DW$483, DW_AT_decl_column(0x0c)
    8652              
    8653              $C$DW$484       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v22.6.0 Tue Dec 20 15:55:16 2022

Copyright (c) 1996-2018 Texas Instruments Incorporated
ttplpfc.asm                                                          PAGE  181

    8654                      .dwattr $C$DW$484, DW_AT_type(*$C$DW$T$19)
    8655                      .dwattr $C$DW$484, DW_AT_name("a1")
    8656                      .dwattr $C$DW$484, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    8657                      .dwattr $C$DW$484, DW_AT_accessibility(DW_ACCESS_public)
    8658                      .dwattr $C$DW$484, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/spll/spl
    8659                      .dwattr $C$DW$484, DW_AT_decl_line(0x46)
    8660                      .dwattr $C$DW$484, DW_AT_decl_column(0x0c)
    8661              
    8662                      .dwattr $C$DW$T$32, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/spll/sp
    8663                      .dwattr $C$DW$T$32, DW_AT_decl_line(0x41)
    8664                      .dwattr $C$DW$T$32, DW_AT_decl_column(0x0f)
    8665                      .dwendtag $C$DW$T$32
    8666              
    8667                      .dwendtag $C$DW$TU$32
    8668              
    8669              
    8670              $C$DW$TU$34     .dwtag  DW_TAG_type_unit
    8671                      .dwmtype  $C$DW$T$34
    8672              $C$DW$T$34      .dwtag  DW_TAG_typedef
    8673                      .dwattr $C$DW$T$34, DW_AT_name("SPLL_1PH_NOTCH_COEFF")
    8674                      .dwattr $C$DW$T$34, DW_AT_type(*$C$DW$T$32)
    8675                      .dwattr $C$DW$T$34, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/spll/sp
    8676                      .dwattr $C$DW$T$34, DW_AT_decl_line(0x47)
    8677                      .dwattr $C$DW$T$34, DW_AT_decl_column(0x03)
    8678              
    8679                      .dwendtag $C$DW$TU$34
    8680              
    8681              
    8682              $C$DW$TU$33     .dwtag  DW_TAG_type_unit
    8683                      .dwmtype  $C$DW$T$33
    8684              
    8685              $C$DW$T$33      .dwtag  DW_TAG_structure_type
    8686                      .dwattr $C$DW$T$33, DW_AT_byte_size(0x06)
    8687              $C$DW$485       .dwtag  DW_TAG_member
    8688                      .dwattr $C$DW$485, DW_AT_type(*$C$DW$T$19)
    8689                      .dwattr $C$DW$485, DW_AT_name("b1")
    8690                      .dwattr $C$DW$485, DW_AT_accessibility(DW_ACCESS_public)
    8691                      .dwattr $C$DW$485, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/spll/spl
    8692                      .dwattr $C$DW$485, DW_AT_decl_line(0x4c)
    8693                      .dwattr $C$DW$485, DW_AT_decl_column(0x0f)
    8694              
    8695              $C$DW$486       .dwtag  DW_TAG_member
    8696                      .dwattr $C$DW$486, DW_AT_type(*$C$DW$T$19)
    8697                      .dwattr $C$DW$486, DW_AT_name("b0")
    8698                      .dwattr $C$DW$486, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    8699                      .dwattr $C$DW$486, DW_AT_accessibility(DW_ACCESS_public)
    8700                      .dwattr $C$DW$486, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/spll/spl
    8701                      .dwattr $C$DW$486, DW_AT_decl_line(0x4d)
    8702                      .dwattr $C$DW$486, DW_AT_decl_column(0x0f)
    8703              
    8704              $C$DW$487       .dwtag  DW_TAG_member
    8705                      .dwattr $C$DW$487, DW_AT_type(*$C$DW$T$19)
    8706                      .dwattr $C$DW$487, DW_AT_name("a1")
    8707                      .dwattr $C$DW$487, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    8708                      .dwattr $C$DW$487, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v22.6.0 Tue Dec 20 15:55:16 2022

Copyright (c) 1996-2018 Texas Instruments Incorporated
ttplpfc.asm                                                          PAGE  182

    8709                      .dwattr $C$DW$487, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/spll/spl
    8710                      .dwattr $C$DW$487, DW_AT_decl_line(0x4e)
    8711                      .dwattr $C$DW$487, DW_AT_decl_column(0x0f)
    8712              
    8713                      .dwattr $C$DW$T$33, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/spll/sp
    8714                      .dwattr $C$DW$T$33, DW_AT_decl_line(0x4b)
    8715                      .dwattr $C$DW$T$33, DW_AT_decl_column(0x0f)
    8716                      .dwendtag $C$DW$T$33
    8717              
    8718                      .dwendtag $C$DW$TU$33
    8719              
    8720              
    8721              $C$DW$TU$35     .dwtag  DW_TAG_type_unit
    8722                      .dwmtype  $C$DW$T$35
    8723              $C$DW$T$35      .dwtag  DW_TAG_typedef
    8724                      .dwattr $C$DW$T$35, DW_AT_name("SPLL_1PH_NOTCH_LPF_COEFF")
    8725                      .dwattr $C$DW$T$35, DW_AT_type(*$C$DW$T$33)
    8726                      .dwattr $C$DW$T$35, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/spll/sp
    8727                      .dwattr $C$DW$T$35, DW_AT_decl_line(0x4f)
    8728                      .dwattr $C$DW$T$35, DW_AT_decl_column(0x03)
    8729              
    8730                      .dwendtag $C$DW$TU$35
    8731              
    8732              
    8733              $C$DW$TU$36     .dwtag  DW_TAG_type_unit
    8734                      .dwmtype  $C$DW$T$36
    8735              
    8736              $C$DW$T$36      .dwtag  DW_TAG_structure_type
    8737                      .dwattr $C$DW$T$36, DW_AT_byte_size(0x32)
    8738              $C$DW$488       .dwtag  DW_TAG_member
    8739                      .dwattr $C$DW$488, DW_AT_type(*$C$DW$T$27)
    8740                      .dwattr $C$DW$488, DW_AT_name("upd")
    8741                      .dwattr $C$DW$488, DW_AT_accessibility(DW_ACCESS_public)
    8742                      .dwattr $C$DW$488, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/spll/spl
    8743                      .dwattr $C$DW$488, DW_AT_decl_line(0x58)
    8744                      .dwattr $C$DW$488, DW_AT_decl_column(0x11)
    8745              
    8746              $C$DW$489       .dwtag  DW_TAG_member
    8747                      .dwattr $C$DW$489, DW_AT_type(*$C$DW$T$27)
    8748                      .dwattr $C$DW$489, DW_AT_name("y_notch1")
    8749                      .dwattr $C$DW$489, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    8750                      .dwattr $C$DW$489, DW_AT_accessibility(DW_ACCESS_public)
    8751                      .dwattr $C$DW$489, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/spll/spl
    8752                      .dwattr $C$DW$489, DW_AT_decl_line(0x59)
    8753                      .dwattr $C$DW$489, DW_AT_decl_column(0x11)
    8754              
    8755              $C$DW$490       .dwtag  DW_TAG_member
    8756                      .dwattr $C$DW$490, DW_AT_type(*$C$DW$T$27)
    8757                      .dwattr $C$DW$490, DW_AT_name("y_notch2")
    8758                      .dwattr $C$DW$490, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    8759                      .dwattr $C$DW$490, DW_AT_accessibility(DW_ACCESS_public)
    8760                      .dwattr $C$DW$490, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/spll/spl
    8761                      .dwattr $C$DW$490, DW_AT_decl_line(0x5a)
    8762                      .dwattr $C$DW$490, DW_AT_decl_column(0x11)
    8763              
TMS320C2000 Assembler PC v22.6.0 Tue Dec 20 15:55:16 2022

Copyright (c) 1996-2018 Texas Instruments Incorporated
ttplpfc.asm                                                          PAGE  183

    8764              $C$DW$491       .dwtag  DW_TAG_member
    8765                      .dwattr $C$DW$491, DW_AT_type(*$C$DW$T$28)
    8766                      .dwattr $C$DW$491, DW_AT_name("ylf")
    8767                      .dwattr $C$DW$491, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    8768                      .dwattr $C$DW$491, DW_AT_accessibility(DW_ACCESS_public)
    8769                      .dwattr $C$DW$491, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/spll/spl
    8770                      .dwattr $C$DW$491, DW_AT_decl_line(0x5b)
    8771                      .dwattr $C$DW$491, DW_AT_decl_column(0x11)
    8772              
    8773              $C$DW$492       .dwtag  DW_TAG_member
    8774                      .dwattr $C$DW$492, DW_AT_type(*$C$DW$T$19)
    8775                      .dwattr $C$DW$492, DW_AT_name("fo")
    8776                      .dwattr $C$DW$492, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    8777                      .dwattr $C$DW$492, DW_AT_accessibility(DW_ACCESS_public)
    8778                      .dwattr $C$DW$492, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/spll/spl
    8779                      .dwattr $C$DW$492, DW_AT_decl_line(0x5c)
    8780                      .dwattr $C$DW$492, DW_AT_decl_column(0x11)
    8781              
    8782              $C$DW$493       .dwtag  DW_TAG_member
    8783                      .dwattr $C$DW$493, DW_AT_type(*$C$DW$T$19)
    8784                      .dwattr $C$DW$493, DW_AT_name("fn")
    8785                      .dwattr $C$DW$493, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    8786                      .dwattr $C$DW$493, DW_AT_accessibility(DW_ACCESS_public)
    8787                      .dwattr $C$DW$493, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/spll/spl
    8788                      .dwattr $C$DW$493, DW_AT_decl_line(0x5d)
    8789                      .dwattr $C$DW$493, DW_AT_decl_column(0x11)
    8790              
    8791              $C$DW$494       .dwtag  DW_TAG_member
    8792                      .dwattr $C$DW$494, DW_AT_type(*$C$DW$T$19)
    8793                      .dwattr $C$DW$494, DW_AT_name("theta")
    8794                      .dwattr $C$DW$494, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    8795                      .dwattr $C$DW$494, DW_AT_accessibility(DW_ACCESS_public)
    8796                      .dwattr $C$DW$494, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/spll/spl
    8797                      .dwattr $C$DW$494, DW_AT_decl_line(0x5e)
    8798                      .dwattr $C$DW$494, DW_AT_decl_column(0x11)
    8799              
    8800              $C$DW$495       .dwtag  DW_TAG_member
    8801                      .dwattr $C$DW$495, DW_AT_type(*$C$DW$T$19)
    8802                      .dwattr $C$DW$495, DW_AT_name("cosine")
    8803                      .dwattr $C$DW$495, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    8804                      .dwattr $C$DW$495, DW_AT_accessibility(DW_ACCESS_public)
    8805                      .dwattr $C$DW$495, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/spll/spl
    8806                      .dwattr $C$DW$495, DW_AT_decl_line(0x5f)
    8807                      .dwattr $C$DW$495, DW_AT_decl_column(0x11)
    8808              
    8809              $C$DW$496       .dwtag  DW_TAG_member
    8810                      .dwattr $C$DW$496, DW_AT_type(*$C$DW$T$19)
    8811                      .dwattr $C$DW$496, DW_AT_name("sine")
    8812                      .dwattr $C$DW$496, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    8813                      .dwattr $C$DW$496, DW_AT_accessibility(DW_ACCESS_public)
    8814                      .dwattr $C$DW$496, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/spll/spl
    8815                      .dwattr $C$DW$496, DW_AT_decl_line(0x60)
    8816                      .dwattr $C$DW$496, DW_AT_decl_column(0x11)
    8817              
    8818              $C$DW$497       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v22.6.0 Tue Dec 20 15:55:16 2022

Copyright (c) 1996-2018 Texas Instruments Incorporated
ttplpfc.asm                                                          PAGE  184

    8819                      .dwattr $C$DW$497, DW_AT_type(*$C$DW$T$19)
    8820                      .dwattr $C$DW$497, DW_AT_name("delta_t")
    8821                      .dwattr $C$DW$497, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    8822                      .dwattr $C$DW$497, DW_AT_accessibility(DW_ACCESS_public)
    8823                      .dwattr $C$DW$497, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/spll/spl
    8824                      .dwattr $C$DW$497, DW_AT_decl_line(0x61)
    8825                      .dwattr $C$DW$497, DW_AT_decl_column(0x11)
    8826              
    8827              $C$DW$498       .dwtag  DW_TAG_member
    8828                      .dwattr $C$DW$498, DW_AT_type(*$C$DW$T$34)
    8829                      .dwattr $C$DW$498, DW_AT_name("notch_coeff")
    8830                      .dwattr $C$DW$498, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    8831                      .dwattr $C$DW$498, DW_AT_accessibility(DW_ACCESS_public)
    8832                      .dwattr $C$DW$498, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/spll/spl
    8833                      .dwattr $C$DW$498, DW_AT_decl_line(0x62)
    8834                      .dwattr $C$DW$498, DW_AT_decl_column(0x1a)
    8835              
    8836              $C$DW$499       .dwtag  DW_TAG_member
    8837                      .dwattr $C$DW$499, DW_AT_type(*$C$DW$T$35)
    8838                      .dwattr $C$DW$499, DW_AT_name("lpf_coeff")
    8839                      .dwattr $C$DW$499, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    8840                      .dwattr $C$DW$499, DW_AT_accessibility(DW_ACCESS_public)
    8841                      .dwattr $C$DW$499, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/spll/spl
    8842                      .dwattr $C$DW$499, DW_AT_decl_line(0x63)
    8843                      .dwattr $C$DW$499, DW_AT_decl_column(0x1e)
    8844              
    8845                      .dwattr $C$DW$T$36, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/spll/sp
    8846                      .dwattr $C$DW$T$36, DW_AT_decl_line(0x57)
    8847                      .dwattr $C$DW$T$36, DW_AT_decl_column(0x0f)
    8848                      .dwendtag $C$DW$T$36
    8849              
    8850                      .dwendtag $C$DW$TU$36
    8851              
    8852              
    8853              $C$DW$TU$85     .dwtag  DW_TAG_type_unit
    8854                      .dwmtype  $C$DW$T$85
    8855              $C$DW$T$85      .dwtag  DW_TAG_typedef
    8856                      .dwattr $C$DW$T$85, DW_AT_name("SPLL_1PH_NOTCH")
    8857                      .dwattr $C$DW$T$85, DW_AT_type(*$C$DW$T$36)
    8858                      .dwattr $C$DW$T$85, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/spll/sp
    8859                      .dwattr $C$DW$T$85, DW_AT_decl_line(0x64)
    8860                      .dwattr $C$DW$T$85, DW_AT_decl_column(0x03)
    8861              
    8862                      .dwendtag $C$DW$TU$85
    8863              
    8864              
    8865              $C$DW$TU$37     .dwtag  DW_TAG_type_unit
    8866                      .dwmtype  $C$DW$T$37
    8867              
    8868              $C$DW$T$37      .dwtag  DW_TAG_structure_type
    8869                      .dwattr $C$DW$T$37, DW_AT_byte_size(0x0e)
    8870              $C$DW$500       .dwtag  DW_TAG_member
    8871                      .dwattr $C$DW$500, DW_AT_type(*$C$DW$T$19)
    8872                      .dwattr $C$DW$500, DW_AT_name("osg_b0")
    8873                      .dwattr $C$DW$500, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v22.6.0 Tue Dec 20 15:55:16 2022

Copyright (c) 1996-2018 Texas Instruments Incorporated
ttplpfc.asm                                                          PAGE  185

    8874                      .dwattr $C$DW$500, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/spll/spl
    8875                      .dwattr $C$DW$500, DW_AT_decl_line(0x41)
    8876                      .dwattr $C$DW$500, DW_AT_decl_column(0x0f)
    8877              
    8878              $C$DW$501       .dwtag  DW_TAG_member
    8879                      .dwattr $C$DW$501, DW_AT_type(*$C$DW$T$19)
    8880                      .dwattr $C$DW$501, DW_AT_name("osg_b2")
    8881                      .dwattr $C$DW$501, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    8882                      .dwattr $C$DW$501, DW_AT_accessibility(DW_ACCESS_public)
    8883                      .dwattr $C$DW$501, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/spll/spl
    8884                      .dwattr $C$DW$501, DW_AT_decl_line(0x42)
    8885                      .dwattr $C$DW$501, DW_AT_decl_column(0x0f)
    8886              
    8887              $C$DW$502       .dwtag  DW_TAG_member
    8888                      .dwattr $C$DW$502, DW_AT_type(*$C$DW$T$19)
    8889                      .dwattr $C$DW$502, DW_AT_name("osg_a1")
    8890                      .dwattr $C$DW$502, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    8891                      .dwattr $C$DW$502, DW_AT_accessibility(DW_ACCESS_public)
    8892                      .dwattr $C$DW$502, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/spll/spl
    8893                      .dwattr $C$DW$502, DW_AT_decl_line(0x43)
    8894                      .dwattr $C$DW$502, DW_AT_decl_column(0x0f)
    8895              
    8896              $C$DW$503       .dwtag  DW_TAG_member
    8897                      .dwattr $C$DW$503, DW_AT_type(*$C$DW$T$19)
    8898                      .dwattr $C$DW$503, DW_AT_name("osg_a2")
    8899                      .dwattr $C$DW$503, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    8900                      .dwattr $C$DW$503, DW_AT_accessibility(DW_ACCESS_public)
    8901                      .dwattr $C$DW$503, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/spll/spl
    8902                      .dwattr $C$DW$503, DW_AT_decl_line(0x44)
    8903                      .dwattr $C$DW$503, DW_AT_decl_column(0x0f)
    8904              
    8905              $C$DW$504       .dwtag  DW_TAG_member
    8906                      .dwattr $C$DW$504, DW_AT_type(*$C$DW$T$19)
    8907                      .dwattr $C$DW$504, DW_AT_name("osg_qb0")
    8908                      .dwattr $C$DW$504, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    8909                      .dwattr $C$DW$504, DW_AT_accessibility(DW_ACCESS_public)
    8910                      .dwattr $C$DW$504, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/spll/spl
    8911                      .dwattr $C$DW$504, DW_AT_decl_line(0x45)
    8912                      .dwattr $C$DW$504, DW_AT_decl_column(0x0f)
    8913              
    8914              $C$DW$505       .dwtag  DW_TAG_member
    8915                      .dwattr $C$DW$505, DW_AT_type(*$C$DW$T$19)
    8916                      .dwattr $C$DW$505, DW_AT_name("osg_qb1")
    8917                      .dwattr $C$DW$505, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    8918                      .dwattr $C$DW$505, DW_AT_accessibility(DW_ACCESS_public)
    8919                      .dwattr $C$DW$505, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/spll/spl
    8920                      .dwattr $C$DW$505, DW_AT_decl_line(0x46)
    8921                      .dwattr $C$DW$505, DW_AT_decl_column(0x0f)
    8922              
    8923              $C$DW$506       .dwtag  DW_TAG_member
    8924                      .dwattr $C$DW$506, DW_AT_type(*$C$DW$T$19)
    8925                      .dwattr $C$DW$506, DW_AT_name("osg_qb2")
    8926                      .dwattr $C$DW$506, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    8927                      .dwattr $C$DW$506, DW_AT_accessibility(DW_ACCESS_public)
    8928                      .dwattr $C$DW$506, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/spll/spl
TMS320C2000 Assembler PC v22.6.0 Tue Dec 20 15:55:16 2022

Copyright (c) 1996-2018 Texas Instruments Incorporated
ttplpfc.asm                                                          PAGE  186

    8929                      .dwattr $C$DW$506, DW_AT_decl_line(0x47)
    8930                      .dwattr $C$DW$506, DW_AT_decl_column(0x0f)
    8931              
    8932                      .dwattr $C$DW$T$37, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/spll/sp
    8933                      .dwattr $C$DW$T$37, DW_AT_decl_line(0x40)
    8934                      .dwattr $C$DW$T$37, DW_AT_decl_column(0x18)
    8935                      .dwendtag $C$DW$T$37
    8936              
    8937                      .dwendtag $C$DW$TU$37
    8938              
    8939              
    8940              $C$DW$TU$39     .dwtag  DW_TAG_type_unit
    8941                      .dwmtype  $C$DW$T$39
    8942              $C$DW$507       .dwtag  DW_TAG_TI_far_type
    8943                      .dwattr $C$DW$507, DW_AT_type(*$C$DW$T$37)
    8944              
    8945              $C$DW$T$39      .dwtag  DW_TAG_volatile_type
    8946                      .dwattr $C$DW$T$39, DW_AT_type(*$C$DW$507)
    8947              
    8948                      .dwendtag $C$DW$TU$39
    8949              
    8950              
    8951              $C$DW$TU$40     .dwtag  DW_TAG_type_unit
    8952                      .dwmtype  $C$DW$T$40
    8953              $C$DW$T$40      .dwtag  DW_TAG_typedef
    8954                      .dwattr $C$DW$T$40, DW_AT_name("SPLL_1PH_SOGI_FLL_OSG_COEFF")
    8955                      .dwattr $C$DW$T$40, DW_AT_type(*$C$DW$T$39)
    8956                      .dwattr $C$DW$T$40, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/spll/sp
    8957                      .dwattr $C$DW$T$40, DW_AT_decl_line(0x48)
    8958                      .dwattr $C$DW$T$40, DW_AT_decl_column(0x03)
    8959              
    8960                      .dwendtag $C$DW$TU$40
    8961              
    8962              
    8963              $C$DW$TU$38     .dwtag  DW_TAG_type_unit
    8964                      .dwmtype  $C$DW$T$38
    8965              
    8966              $C$DW$T$38      .dwtag  DW_TAG_structure_type
    8967                      .dwattr $C$DW$T$38, DW_AT_byte_size(0x04)
    8968              $C$DW$508       .dwtag  DW_TAG_member
    8969                      .dwattr $C$DW$508, DW_AT_type(*$C$DW$T$19)
    8970                      .dwattr $C$DW$508, DW_AT_name("b1")
    8971                      .dwattr $C$DW$508, DW_AT_accessibility(DW_ACCESS_public)
    8972                      .dwattr $C$DW$508, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/spll/spl
    8973                      .dwattr $C$DW$508, DW_AT_decl_line(0x4d)
    8974                      .dwattr $C$DW$508, DW_AT_decl_column(0x0f)
    8975              
    8976              $C$DW$509       .dwtag  DW_TAG_member
    8977                      .dwattr $C$DW$509, DW_AT_type(*$C$DW$T$19)
    8978                      .dwattr $C$DW$509, DW_AT_name("b0")
    8979                      .dwattr $C$DW$509, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    8980                      .dwattr $C$DW$509, DW_AT_accessibility(DW_ACCESS_public)
    8981                      .dwattr $C$DW$509, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/spll/spl
    8982                      .dwattr $C$DW$509, DW_AT_decl_line(0x4e)
    8983                      .dwattr $C$DW$509, DW_AT_decl_column(0x0f)
TMS320C2000 Assembler PC v22.6.0 Tue Dec 20 15:55:16 2022

Copyright (c) 1996-2018 Texas Instruments Incorporated
ttplpfc.asm                                                          PAGE  187

    8984              
    8985                      .dwattr $C$DW$T$38, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/spll/sp
    8986                      .dwattr $C$DW$T$38, DW_AT_decl_line(0x4c)
    8987                      .dwattr $C$DW$T$38, DW_AT_decl_column(0x0f)
    8988                      .dwendtag $C$DW$T$38
    8989              
    8990                      .dwendtag $C$DW$TU$38
    8991              
    8992              
    8993              $C$DW$TU$41     .dwtag  DW_TAG_type_unit
    8994                      .dwmtype  $C$DW$T$41
    8995              $C$DW$T$41      .dwtag  DW_TAG_typedef
    8996                      .dwattr $C$DW$T$41, DW_AT_name("SPLL_1PH_SOGI_FLL_LPF_COEFF")
    8997                      .dwattr $C$DW$T$41, DW_AT_type(*$C$DW$T$38)
    8998                      .dwattr $C$DW$T$41, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/spll/sp
    8999                      .dwattr $C$DW$T$41, DW_AT_decl_line(0x4f)
    9000                      .dwattr $C$DW$T$41, DW_AT_decl_column(0x03)
    9001              
    9002                      .dwendtag $C$DW$TU$41
    9003              
    9004              
    9005              $C$DW$TU$42     .dwtag  DW_TAG_type_unit
    9006                      .dwmtype  $C$DW$T$42
    9007              
    9008              $C$DW$T$42      .dwtag  DW_TAG_structure_type
    9009                      .dwattr $C$DW$T$42, DW_AT_byte_size(0x4a)
    9010              $C$DW$510       .dwtag  DW_TAG_member
    9011                      .dwattr $C$DW$510, DW_AT_type(*$C$DW$T$27)
    9012                      .dwattr $C$DW$510, DW_AT_name("u")
    9013                      .dwattr $C$DW$510, DW_AT_accessibility(DW_ACCESS_public)
    9014                      .dwattr $C$DW$510, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/spll/spl
    9015                      .dwattr $C$DW$510, DW_AT_decl_line(0x5b)
    9016                      .dwattr $C$DW$510, DW_AT_decl_column(0x11)
    9017              
    9018              $C$DW$511       .dwtag  DW_TAG_member
    9019                      .dwattr $C$DW$511, DW_AT_type(*$C$DW$T$27)
    9020                      .dwattr $C$DW$511, DW_AT_name("osg_u")
    9021                      .dwattr $C$DW$511, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    9022                      .dwattr $C$DW$511, DW_AT_accessibility(DW_ACCESS_public)
    9023                      .dwattr $C$DW$511, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/spll/spl
    9024                      .dwattr $C$DW$511, DW_AT_decl_line(0x5c)
    9025                      .dwattr $C$DW$511, DW_AT_decl_column(0x11)
    9026              
    9027              $C$DW$512       .dwtag  DW_TAG_member
    9028                      .dwattr $C$DW$512, DW_AT_type(*$C$DW$T$27)
    9029                      .dwattr $C$DW$512, DW_AT_name("osg_qu")
    9030                      .dwattr $C$DW$512, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    9031                      .dwattr $C$DW$512, DW_AT_accessibility(DW_ACCESS_public)
    9032                      .dwattr $C$DW$512, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/spll/spl
    9033                      .dwattr $C$DW$512, DW_AT_decl_line(0x5d)
    9034                      .dwattr $C$DW$512, DW_AT_decl_column(0x11)
    9035              
    9036              $C$DW$513       .dwtag  DW_TAG_member
    9037                      .dwattr $C$DW$513, DW_AT_type(*$C$DW$T$28)
    9038                      .dwattr $C$DW$513, DW_AT_name("u_Q")
TMS320C2000 Assembler PC v22.6.0 Tue Dec 20 15:55:16 2022

Copyright (c) 1996-2018 Texas Instruments Incorporated
ttplpfc.asm                                                          PAGE  188

    9039                      .dwattr $C$DW$513, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    9040                      .dwattr $C$DW$513, DW_AT_accessibility(DW_ACCESS_public)
    9041                      .dwattr $C$DW$513, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/spll/spl
    9042                      .dwattr $C$DW$513, DW_AT_decl_line(0x5e)
    9043                      .dwattr $C$DW$513, DW_AT_decl_column(0x11)
    9044              
    9045              $C$DW$514       .dwtag  DW_TAG_member
    9046                      .dwattr $C$DW$514, DW_AT_type(*$C$DW$T$28)
    9047                      .dwattr $C$DW$514, DW_AT_name("u_D")
    9048                      .dwattr $C$DW$514, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    9049                      .dwattr $C$DW$514, DW_AT_accessibility(DW_ACCESS_public)
    9050                      .dwattr $C$DW$514, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/spll/spl
    9051                      .dwattr $C$DW$514, DW_AT_decl_line(0x5f)
    9052                      .dwattr $C$DW$514, DW_AT_decl_column(0x11)
    9053              
    9054              $C$DW$515       .dwtag  DW_TAG_member
    9055                      .dwattr $C$DW$515, DW_AT_type(*$C$DW$T$28)
    9056                      .dwattr $C$DW$515, DW_AT_name("ylf")
    9057                      .dwattr $C$DW$515, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    9058                      .dwattr $C$DW$515, DW_AT_accessibility(DW_ACCESS_public)
    9059                      .dwattr $C$DW$515, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/spll/spl
    9060                      .dwattr $C$DW$515, DW_AT_decl_line(0x60)
    9061                      .dwattr $C$DW$515, DW_AT_decl_column(0x11)
    9062              
    9063              $C$DW$516       .dwtag  DW_TAG_member
    9064                      .dwattr $C$DW$516, DW_AT_type(*$C$DW$T$19)
    9065                      .dwattr $C$DW$516, DW_AT_name("fo")
    9066                      .dwattr $C$DW$516, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    9067                      .dwattr $C$DW$516, DW_AT_accessibility(DW_ACCESS_public)
    9068                      .dwattr $C$DW$516, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/spll/spl
    9069                      .dwattr $C$DW$516, DW_AT_decl_line(0x61)
    9070                      .dwattr $C$DW$516, DW_AT_decl_column(0x11)
    9071              
    9072              $C$DW$517       .dwtag  DW_TAG_member
    9073                      .dwattr $C$DW$517, DW_AT_type(*$C$DW$T$19)
    9074                      .dwattr $C$DW$517, DW_AT_name("fn")
    9075                      .dwattr $C$DW$517, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    9076                      .dwattr $C$DW$517, DW_AT_accessibility(DW_ACCESS_public)
    9077                      .dwattr $C$DW$517, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/spll/spl
    9078                      .dwattr $C$DW$517, DW_AT_decl_line(0x62)
    9079                      .dwattr $C$DW$517, DW_AT_decl_column(0x11)
    9080              
    9081              $C$DW$518       .dwtag  DW_TAG_member
    9082                      .dwattr $C$DW$518, DW_AT_type(*$C$DW$T$19)
    9083                      .dwattr $C$DW$518, DW_AT_name("wc")
    9084                      .dwattr $C$DW$518, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    9085                      .dwattr $C$DW$518, DW_AT_accessibility(DW_ACCESS_public)
    9086                      .dwattr $C$DW$518, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/spll/spl
    9087                      .dwattr $C$DW$518, DW_AT_decl_line(0x63)
    9088                      .dwattr $C$DW$518, DW_AT_decl_column(0x11)
    9089              
    9090              $C$DW$519       .dwtag  DW_TAG_member
    9091                      .dwattr $C$DW$519, DW_AT_type(*$C$DW$T$19)
    9092                      .dwattr $C$DW$519, DW_AT_name("theta")
    9093                      .dwattr $C$DW$519, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
TMS320C2000 Assembler PC v22.6.0 Tue Dec 20 15:55:16 2022

Copyright (c) 1996-2018 Texas Instruments Incorporated
ttplpfc.asm                                                          PAGE  189

    9094                      .dwattr $C$DW$519, DW_AT_accessibility(DW_ACCESS_public)
    9095                      .dwattr $C$DW$519, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/spll/spl
    9096                      .dwattr $C$DW$519, DW_AT_decl_line(0x64)
    9097                      .dwattr $C$DW$519, DW_AT_decl_column(0x11)
    9098              
    9099              $C$DW$520       .dwtag  DW_TAG_member
    9100                      .dwattr $C$DW$520, DW_AT_type(*$C$DW$T$19)
    9101                      .dwattr $C$DW$520, DW_AT_name("cosine")
    9102                      .dwattr $C$DW$520, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
    9103                      .dwattr $C$DW$520, DW_AT_accessibility(DW_ACCESS_public)
    9104                      .dwattr $C$DW$520, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/spll/spl
    9105                      .dwattr $C$DW$520, DW_AT_decl_line(0x65)
    9106                      .dwattr $C$DW$520, DW_AT_decl_column(0x11)
    9107              
    9108              $C$DW$521       .dwtag  DW_TAG_member
    9109                      .dwattr $C$DW$521, DW_AT_type(*$C$DW$T$19)
    9110                      .dwattr $C$DW$521, DW_AT_name("sine")
    9111                      .dwattr $C$DW$521, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    9112                      .dwattr $C$DW$521, DW_AT_accessibility(DW_ACCESS_public)
    9113                      .dwattr $C$DW$521, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/spll/spl
    9114                      .dwattr $C$DW$521, DW_AT_decl_line(0x66)
    9115                      .dwattr $C$DW$521, DW_AT_decl_column(0x11)
    9116              
    9117              $C$DW$522       .dwtag  DW_TAG_member
    9118                      .dwattr $C$DW$522, DW_AT_type(*$C$DW$T$19)
    9119                      .dwattr $C$DW$522, DW_AT_name("delta_t")
    9120                      .dwattr $C$DW$522, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
    9121                      .dwattr $C$DW$522, DW_AT_accessibility(DW_ACCESS_public)
    9122                      .dwattr $C$DW$522, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/spll/spl
    9123                      .dwattr $C$DW$522, DW_AT_decl_line(0x67)
    9124                      .dwattr $C$DW$522, DW_AT_decl_column(0x11)
    9125              
    9126              $C$DW$523       .dwtag  DW_TAG_member
    9127                      .dwattr $C$DW$523, DW_AT_type(*$C$DW$T$19)
    9128                      .dwattr $C$DW$523, DW_AT_name("ef2")
    9129                      .dwattr $C$DW$523, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    9130                      .dwattr $C$DW$523, DW_AT_accessibility(DW_ACCESS_public)
    9131                      .dwattr $C$DW$523, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/spll/spl
    9132                      .dwattr $C$DW$523, DW_AT_decl_line(0x68)
    9133                      .dwattr $C$DW$523, DW_AT_decl_column(0x11)
    9134              
    9135              $C$DW$524       .dwtag  DW_TAG_member
    9136                      .dwattr $C$DW$524, DW_AT_type(*$C$DW$T$28)
    9137                      .dwattr $C$DW$524, DW_AT_name("x3")
    9138                      .dwattr $C$DW$524, DW_AT_data_member_location[DW_OP_plus_uconst 0x2e]
    9139                      .dwattr $C$DW$524, DW_AT_accessibility(DW_ACCESS_public)
    9140                      .dwattr $C$DW$524, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/spll/spl
    9141                      .dwattr $C$DW$524, DW_AT_decl_line(0x69)
    9142                      .dwattr $C$DW$524, DW_AT_decl_column(0x11)
    9143              
    9144              $C$DW$525       .dwtag  DW_TAG_member
    9145                      .dwattr $C$DW$525, DW_AT_type(*$C$DW$T$19)
    9146                      .dwattr $C$DW$525, DW_AT_name("w_dash")
    9147                      .dwattr $C$DW$525, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
    9148                      .dwattr $C$DW$525, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v22.6.0 Tue Dec 20 15:55:16 2022

Copyright (c) 1996-2018 Texas Instruments Incorporated
ttplpfc.asm                                                          PAGE  190

    9149                      .dwattr $C$DW$525, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/spll/spl
    9150                      .dwattr $C$DW$525, DW_AT_decl_line(0x6a)
    9151                      .dwattr $C$DW$525, DW_AT_decl_column(0x11)
    9152              
    9153              $C$DW$526       .dwtag  DW_TAG_member
    9154                      .dwattr $C$DW$526, DW_AT_type(*$C$DW$T$19)
    9155                      .dwattr $C$DW$526, DW_AT_name("gamma")
    9156                      .dwattr $C$DW$526, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    9157                      .dwattr $C$DW$526, DW_AT_accessibility(DW_ACCESS_public)
    9158                      .dwattr $C$DW$526, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/spll/spl
    9159                      .dwattr $C$DW$526, DW_AT_decl_line(0x6b)
    9160                      .dwattr $C$DW$526, DW_AT_decl_column(0x11)
    9161              
    9162              $C$DW$527       .dwtag  DW_TAG_member
    9163                      .dwattr $C$DW$527, DW_AT_type(*$C$DW$T$19)
    9164                      .dwattr $C$DW$527, DW_AT_name("k")
    9165                      .dwattr $C$DW$527, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
    9166                      .dwattr $C$DW$527, DW_AT_accessibility(DW_ACCESS_public)
    9167                      .dwattr $C$DW$527, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/spll/spl
    9168                      .dwattr $C$DW$527, DW_AT_decl_line(0x6c)
    9169                      .dwattr $C$DW$527, DW_AT_decl_column(0x11)
    9170              
    9171              $C$DW$528       .dwtag  DW_TAG_member
    9172                      .dwattr $C$DW$528, DW_AT_type(*$C$DW$T$40)
    9173                      .dwattr $C$DW$528, DW_AT_name("osg_coeff")
    9174                      .dwattr $C$DW$528, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    9175                      .dwattr $C$DW$528, DW_AT_accessibility(DW_ACCESS_public)
    9176                      .dwattr $C$DW$528, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/spll/spl
    9177                      .dwattr $C$DW$528, DW_AT_decl_line(0x6d)
    9178                      .dwattr $C$DW$528, DW_AT_decl_column(0x21)
    9179              
    9180              $C$DW$529       .dwtag  DW_TAG_member
    9181                      .dwattr $C$DW$529, DW_AT_type(*$C$DW$T$41)
    9182                      .dwattr $C$DW$529, DW_AT_name("lpf_coeff")
    9183                      .dwattr $C$DW$529, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
    9184                      .dwattr $C$DW$529, DW_AT_accessibility(DW_ACCESS_public)
    9185                      .dwattr $C$DW$529, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/spll/spl
    9186                      .dwattr $C$DW$529, DW_AT_decl_line(0x6e)
    9187                      .dwattr $C$DW$529, DW_AT_decl_column(0x21)
    9188              
    9189                      .dwattr $C$DW$T$42, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/spll/sp
    9190                      .dwattr $C$DW$T$42, DW_AT_decl_line(0x5a)
    9191                      .dwattr $C$DW$T$42, DW_AT_decl_column(0x0f)
    9192                      .dwendtag $C$DW$T$42
    9193              
    9194                      .dwendtag $C$DW$TU$42
    9195              
    9196              
    9197              $C$DW$TU$88     .dwtag  DW_TAG_type_unit
    9198                      .dwmtype  $C$DW$T$88
    9199              $C$DW$T$88      .dwtag  DW_TAG_typedef
    9200                      .dwattr $C$DW$T$88, DW_AT_name("SPLL_1PH_SOGI_FLL")
    9201                      .dwattr $C$DW$T$88, DW_AT_type(*$C$DW$T$42)
    9202                      .dwattr $C$DW$T$88, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/spll/sp
    9203                      .dwattr $C$DW$T$88, DW_AT_decl_line(0x6f)
TMS320C2000 Assembler PC v22.6.0 Tue Dec 20 15:55:16 2022

Copyright (c) 1996-2018 Texas Instruments Incorporated
ttplpfc.asm                                                          PAGE  191

    9204                      .dwattr $C$DW$T$88, DW_AT_decl_column(0x03)
    9205              
    9206                      .dwendtag $C$DW$TU$88
    9207              
    9208              
    9209              $C$DW$TU$45     .dwtag  DW_TAG_type_unit
    9210                      .dwmtype  $C$DW$T$45
    9211              
    9212              $C$DW$T$45      .dwtag  DW_TAG_structure_type
    9213                      .dwattr $C$DW$T$45, DW_AT_byte_size(0x40)
    9214              $C$DW$530       .dwtag  DW_TAG_member
    9215                      .dwattr $C$DW$530, DW_AT_type(*$C$DW$T$19)
    9216                      .dwattr $C$DW$530, DW_AT_name("v")
    9217                      .dwattr $C$DW$530, DW_AT_accessibility(DW_ACCESS_public)
    9218                      .dwattr $C$DW$530, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/power_me
    9219                      .dwattr $C$DW$530, DW_AT_decl_line(0x42)
    9220                      .dwattr $C$DW$530, DW_AT_decl_column(0x0f)
    9221              
    9222              $C$DW$531       .dwtag  DW_TAG_member
    9223                      .dwattr $C$DW$531, DW_AT_type(*$C$DW$T$19)
    9224                      .dwattr $C$DW$531, DW_AT_name("i")
    9225                      .dwattr $C$DW$531, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    9226                      .dwattr $C$DW$531, DW_AT_accessibility(DW_ACCESS_public)
    9227                      .dwattr $C$DW$531, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/power_me
    9228                      .dwattr $C$DW$531, DW_AT_decl_line(0x43)
    9229                      .dwattr $C$DW$531, DW_AT_decl_column(0x0f)
    9230              
    9231              $C$DW$532       .dwtag  DW_TAG_member
    9232                      .dwattr $C$DW$532, DW_AT_type(*$C$DW$T$19)
    9233                      .dwattr $C$DW$532, DW_AT_name("sampleFreq")
    9234                      .dwattr $C$DW$532, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    9235                      .dwattr $C$DW$532, DW_AT_accessibility(DW_ACCESS_public)
    9236                      .dwattr $C$DW$532, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/power_me
    9237                      .dwattr $C$DW$532, DW_AT_decl_line(0x44)
    9238                      .dwattr $C$DW$532, DW_AT_decl_column(0x0f)
    9239              
    9240              $C$DW$533       .dwtag  DW_TAG_member
    9241                      .dwattr $C$DW$533, DW_AT_type(*$C$DW$T$19)
    9242                      .dwattr $C$DW$533, DW_AT_name("threshold")
    9243                      .dwattr $C$DW$533, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    9244                      .dwattr $C$DW$533, DW_AT_accessibility(DW_ACCESS_public)
    9245                      .dwattr $C$DW$533, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/power_me
    9246                      .dwattr $C$DW$533, DW_AT_decl_line(0x45)
    9247                      .dwattr $C$DW$533, DW_AT_decl_column(0x0f)
    9248              
    9249              $C$DW$534       .dwtag  DW_TAG_member
    9250                      .dwattr $C$DW$534, DW_AT_type(*$C$DW$T$19)
    9251                      .dwattr $C$DW$534, DW_AT_name("vRms")
    9252                      .dwattr $C$DW$534, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    9253                      .dwattr $C$DW$534, DW_AT_accessibility(DW_ACCESS_public)
    9254                      .dwattr $C$DW$534, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/power_me
    9255                      .dwattr $C$DW$534, DW_AT_decl_line(0x46)
    9256                      .dwattr $C$DW$534, DW_AT_decl_column(0x0f)
    9257              
    9258              $C$DW$535       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v22.6.0 Tue Dec 20 15:55:16 2022

Copyright (c) 1996-2018 Texas Instruments Incorporated
ttplpfc.asm                                                          PAGE  192

    9259                      .dwattr $C$DW$535, DW_AT_type(*$C$DW$T$19)
    9260                      .dwattr $C$DW$535, DW_AT_name("vAvg")
    9261                      .dwattr $C$DW$535, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    9262                      .dwattr $C$DW$535, DW_AT_accessibility(DW_ACCESS_public)
    9263                      .dwattr $C$DW$535, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/power_me
    9264                      .dwattr $C$DW$535, DW_AT_decl_line(0x47)
    9265                      .dwattr $C$DW$535, DW_AT_decl_column(0x0f)
    9266              
    9267              $C$DW$536       .dwtag  DW_TAG_member
    9268                      .dwattr $C$DW$536, DW_AT_type(*$C$DW$T$19)
    9269                      .dwattr $C$DW$536, DW_AT_name("vEma")
    9270                      .dwattr $C$DW$536, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    9271                      .dwattr $C$DW$536, DW_AT_accessibility(DW_ACCESS_public)
    9272                      .dwattr $C$DW$536, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/power_me
    9273                      .dwattr $C$DW$536, DW_AT_decl_line(0x48)
    9274                      .dwattr $C$DW$536, DW_AT_decl_column(0x0f)
    9275              
    9276              $C$DW$537       .dwtag  DW_TAG_member
    9277                      .dwattr $C$DW$537, DW_AT_type(*$C$DW$T$19)
    9278                      .dwattr $C$DW$537, DW_AT_name("acFreq")
    9279                      .dwattr $C$DW$537, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    9280                      .dwattr $C$DW$537, DW_AT_accessibility(DW_ACCESS_public)
    9281                      .dwattr $C$DW$537, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/power_me
    9282                      .dwattr $C$DW$537, DW_AT_decl_line(0x49)
    9283                      .dwattr $C$DW$537, DW_AT_decl_column(0x0f)
    9284              
    9285              $C$DW$538       .dwtag  DW_TAG_member
    9286                      .dwattr $C$DW$538, DW_AT_type(*$C$DW$T$19)
    9287                      .dwattr $C$DW$538, DW_AT_name("acFreqAvg")
    9288                      .dwattr $C$DW$538, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    9289                      .dwattr $C$DW$538, DW_AT_accessibility(DW_ACCESS_public)
    9290                      .dwattr $C$DW$538, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/power_me
    9291                      .dwattr $C$DW$538, DW_AT_decl_line(0x4a)
    9292                      .dwattr $C$DW$538, DW_AT_decl_column(0x0f)
    9293              
    9294              $C$DW$539       .dwtag  DW_TAG_member
    9295                      .dwattr $C$DW$539, DW_AT_type(*$C$DW$T$19)
    9296                      .dwattr $C$DW$539, DW_AT_name("iRms")
    9297                      .dwattr $C$DW$539, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    9298                      .dwattr $C$DW$539, DW_AT_accessibility(DW_ACCESS_public)
    9299                      .dwattr $C$DW$539, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/power_me
    9300                      .dwattr $C$DW$539, DW_AT_decl_line(0x4b)
    9301                      .dwattr $C$DW$539, DW_AT_decl_column(0x0f)
    9302              
    9303              $C$DW$540       .dwtag  DW_TAG_member
    9304                      .dwattr $C$DW$540, DW_AT_type(*$C$DW$T$19)
    9305                      .dwattr $C$DW$540, DW_AT_name("pRms")
    9306                      .dwattr $C$DW$540, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
