TMS320C2000 Assembler PC v22.6.0 Tue Dec 20 15:55:16 2022

Copyright (c) 1996-2018 Texas Instruments Incorporated
ttplpfc_hal.asm                                                      PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 G3 C/C++ Codegen                               PC v22.6.0.LTS *
       3              ;* Date/Time created: Tue Dec 20 15:55:15 2022                 *
       4              ;***************************************************************
       5                      .compiler_opts --abi=eabi --cla_support=cla2 --diag_wrap=off --float_support=fpu64 --hll_source=on --
       6                      .asg    XAR2, FP
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("../ttplpfc/ttplpfc_hal.c")
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 G3 C/C++ Codegen PC v22.6.0.LTS Copyright (c) 1996-2
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("C:\Users\gerar\workspace_v12\7.4kW_OBC_F28003x\RELEASE")
      13              
      14              $C$DW$1 .dwtag  DW_TAG_subprogram
      15                      .dwattr $C$DW$1, DW_AT_name("Device_init")
      16                      .dwattr $C$DW$1, DW_AT_linkage_name("Device_init")

    8973              
    8974                      .dwendtag $C$DW$TU$125
    8975              
    8976              
    8977              $C$DW$TU$126    .dwtag  DW_TAG_type_unit
    8978                      .dwmtype  $C$DW$T$126
    8979              $C$DW$T$126     .dwtag  DW_TAG_typedef
    8980                      .dwattr $C$DW$T$126, DW_AT_name("GPIO_Direction")
    8981                      .dwattr $C$DW$T$126, DW_AT_type(*$C$DW$T$125)
TMS320C2000 Assembler PC v22.6.0 Tue Dec 20 15:55:16 2022

Copyright (c) 1996-2018 Texas Instruments Incorporated
ttplpfc_hal.asm                                                      PAGE  173

    8982                      .dwattr $C$DW$T$126, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/device/driverlib
    8983                      .dwattr $C$DW$T$126, DW_AT_decl_line(0x81)
    8984                      .dwattr $C$DW$T$126, DW_AT_decl_column(0x03)
    8985              
    8986                      .dwendtag $C$DW$TU$126
    8987              
    8988              
    8989              $C$DW$TU$127    .dwtag  DW_TAG_type_unit
    8990                      .dwmtype  $C$DW$T$127
    8991              
    8992              $C$DW$T$127     .dwtag  DW_TAG_enumeration_type
    8993                      .dwattr $C$DW$T$127, DW_AT_byte_size(0x01)
    8994              $C$DW$833       .dwtag  DW_TAG_enumerator
    8995                      .dwattr $C$DW$833, DW_AT_name("GPIO_QUAL_SYNC")
    8996                      .dwattr $C$DW$833, DW_AT_const_value(0x00)
    8997                      .dwattr $C$DW$833, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/device/driverlib/g
    8998                      .dwattr $C$DW$833, DW_AT_decl_line(0x98)
    8999                      .dwattr $C$DW$833, DW_AT_decl_column(0x05)
    9000              
    9001              $C$DW$834       .dwtag  DW_TAG_enumerator
    9002                      .dwattr $C$DW$834, DW_AT_name("GPIO_QUAL_3SAMPLE")
    9003                      .dwattr $C$DW$834, DW_AT_const_value(0x01)
    9004                      .dwattr $C$DW$834, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/device/driverlib/g
    9005                      .dwattr $C$DW$834, DW_AT_decl_line(0x99)
    9006                      .dwattr $C$DW$834, DW_AT_decl_column(0x05)
    9007              
    9008              $C$DW$835       .dwtag  DW_TAG_enumerator
    9009                      .dwattr $C$DW$835, DW_AT_name("GPIO_QUAL_6SAMPLE")
    9010                      .dwattr $C$DW$835, DW_AT_const_value(0x02)
    9011                      .dwattr $C$DW$835, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/device/driverlib/g
    9012                      .dwattr $C$DW$835, DW_AT_decl_line(0x9a)
    9013                      .dwattr $C$DW$835, DW_AT_decl_column(0x05)
    9014              
    9015              $C$DW$836       .dwtag  DW_TAG_enumerator
    9016                      .dwattr $C$DW$836, DW_AT_name("GPIO_QUAL_ASYNC")
    9017                      .dwattr $C$DW$836, DW_AT_const_value(0x03)
    9018                      .dwattr $C$DW$836, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/device/driverlib/g
    9019                      .dwattr $C$DW$836, DW_AT_decl_line(0x9b)
    9020                      .dwattr $C$DW$836, DW_AT_decl_column(0x05)
    9021              
    9022                      .dwattr $C$DW$T$127, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/device/driverlib
    9023                      .dwattr $C$DW$T$127, DW_AT_decl_line(0x97)
    9024                      .dwattr $C$DW$T$127, DW_AT_decl_column(0x01)
    9025                      .dwendtag $C$DW$T$127
    9026              
    9027                      .dwendtag $C$DW$TU$127
    9028              
    9029              
    9030              $C$DW$TU$128    .dwtag  DW_TAG_type_unit
    9031                      .dwmtype  $C$DW$T$128
    9032              $C$DW$T$128     .dwtag  DW_TAG_typedef
    9033                      .dwattr $C$DW$T$128, DW_AT_name("GPIO_QualificationMode")
    9034                      .dwattr $C$DW$T$128, DW_AT_type(*$C$DW$T$127)
    9035                      .dwattr $C$DW$T$128, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/device/driverlib
    9036                      .dwattr $C$DW$T$128, DW_AT_decl_line(0x9c)
TMS320C2000 Assembler PC v22.6.0 Tue Dec 20 15:55:16 2022

Copyright (c) 1996-2018 Texas Instruments Incorporated
ttplpfc_hal.asm                                                      PAGE  174

    9037                      .dwattr $C$DW$T$128, DW_AT_decl_column(0x03)
    9038              
    9039                      .dwendtag $C$DW$TU$128
    9040              
    9041              
    9042              $C$DW$TU$20     .dwtag  DW_TAG_type_unit
    9043                      .dwmtype  $C$DW$T$20
    9044              
    9045              $C$DW$T$20      .dwtag  DW_TAG_structure_type
    9046                      .dwattr $C$DW$T$20, DW_AT_byte_size(0x18)
    9047              $C$DW$837       .dwtag  DW_TAG_member
    9048                      .dwattr $C$DW$837, DW_AT_type(*$C$DW$T$19)
    9049                      .dwattr $C$DW$837, DW_AT_name("TTPLPFC_PH1_H_TEMP")
    9050                      .dwattr $C$DW$837, DW_AT_accessibility(DW_ACCESS_public)
    9051                      .dwattr $C$DW$837, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/ttplpfc/ttplpfc_ha
    9052                      .dwattr $C$DW$837, DW_AT_decl_line(0x2d)
    9053                      .dwattr $C$DW$837, DW_AT_decl_column(0x13)
    9054              
    9055              $C$DW$838       .dwtag  DW_TAG_member
    9056                      .dwattr $C$DW$838, DW_AT_type(*$C$DW$T$19)
    9057                      .dwattr $C$DW$838, DW_AT_name("TTPLPFC_PH1_L_TEMP")
    9058                      .dwattr $C$DW$838, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    9059                      .dwattr $C$DW$838, DW_AT_accessibility(DW_ACCESS_public)
    9060                      .dwattr $C$DW$838, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/ttplpfc/ttplpfc_ha
    9061                      .dwattr $C$DW$838, DW_AT_decl_line(0x2e)
    9062                      .dwattr $C$DW$838, DW_AT_decl_column(0x13)
    9063              
    9064              $C$DW$839       .dwtag  DW_TAG_member
    9065                      .dwattr $C$DW$839, DW_AT_type(*$C$DW$T$19)
    9066                      .dwattr $C$DW$839, DW_AT_name("TTPLPFC_PH2_L_TEMP")
    9067                      .dwattr $C$DW$839, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    9068                      .dwattr $C$DW$839, DW_AT_accessibility(DW_ACCESS_public)
    9069                      .dwattr $C$DW$839, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/ttplpfc/ttplpfc_ha
    9070                      .dwattr $C$DW$839, DW_AT_decl_line(0x2f)
    9071                      .dwattr $C$DW$839, DW_AT_decl_column(0x13)
    9072              
    9073              $C$DW$840       .dwtag  DW_TAG_member
    9074                      .dwattr $C$DW$840, DW_AT_type(*$C$DW$T$19)
    9075                      .dwattr $C$DW$840, DW_AT_name("TTPLPFC_PH2_H_TEMP")
    9076                      .dwattr $C$DW$840, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    9077                      .dwattr $C$DW$840, DW_AT_accessibility(DW_ACCESS_public)
    9078                      .dwattr $C$DW$840, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/ttplpfc/ttplpfc_ha
    9079                      .dwattr $C$DW$840, DW_AT_decl_line(0x30)
    9080                      .dwattr $C$DW$840, DW_AT_decl_column(0x13)
    9081              
    9082              $C$DW$841       .dwtag  DW_TAG_member
    9083                      .dwattr $C$DW$841, DW_AT_type(*$C$DW$T$19)
    9084                      .dwattr $C$DW$841, DW_AT_name("CLLLC_PRIM_LEG1_H_TEMP")
    9085                      .dwattr $C$DW$841, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    9086                      .dwattr $C$DW$841, DW_AT_accessibility(DW_ACCESS_public)
    9087                      .dwattr $C$DW$841, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/ttplpfc/ttplpfc_ha
    9088                      .dwattr $C$DW$841, DW_AT_decl_line(0x31)
    9089                      .dwattr $C$DW$841, DW_AT_decl_column(0x13)
    9090              
    9091              $C$DW$842       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v22.6.0 Tue Dec 20 15:55:16 2022

Copyright (c) 1996-2018 Texas Instruments Incorporated
ttplpfc_hal.asm                                                      PAGE  175

    9092                      .dwattr $C$DW$842, DW_AT_type(*$C$DW$T$19)
    9093                      .dwattr $C$DW$842, DW_AT_name("CLLLC_PRIM_LEG1_L_TEMP")
    9094                      .dwattr $C$DW$842, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    9095                      .dwattr $C$DW$842, DW_AT_accessibility(DW_ACCESS_public)
    9096                      .dwattr $C$DW$842, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/ttplpfc/ttplpfc_ha
    9097                      .dwattr $C$DW$842, DW_AT_decl_line(0x32)
    9098                      .dwattr $C$DW$842, DW_AT_decl_column(0x13)
    9099              
    9100              $C$DW$843       .dwtag  DW_TAG_member
    9101                      .dwattr $C$DW$843, DW_AT_type(*$C$DW$T$19)
    9102                      .dwattr $C$DW$843, DW_AT_name("CLLLC_PRIM_LEG2_L_TEMP")
    9103                      .dwattr $C$DW$843, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    9104                      .dwattr $C$DW$843, DW_AT_accessibility(DW_ACCESS_public)
    9105                      .dwattr $C$DW$843, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/ttplpfc/ttplpfc_ha
    9106                      .dwattr $C$DW$843, DW_AT_decl_line(0x33)
    9107                      .dwattr $C$DW$843, DW_AT_decl_column(0x13)
    9108              
    9109              $C$DW$844       .dwtag  DW_TAG_member
    9110                      .dwattr $C$DW$844, DW_AT_type(*$C$DW$T$19)
    9111                      .dwattr $C$DW$844, DW_AT_name("CLLLC_PRIM_LEG2_H_TEMP")
    9112                      .dwattr $C$DW$844, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    9113                      .dwattr $C$DW$844, DW_AT_accessibility(DW_ACCESS_public)
    9114                      .dwattr $C$DW$844, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/ttplpfc/ttplpfc_ha
    9115                      .dwattr $C$DW$844, DW_AT_decl_line(0x34)
    9116                      .dwattr $C$DW$844, DW_AT_decl_column(0x13)
    9117              
    9118              $C$DW$845       .dwtag  DW_TAG_member
    9119                      .dwattr $C$DW$845, DW_AT_type(*$C$DW$T$19)
    9120                      .dwattr $C$DW$845, DW_AT_name("CLLLC_SEC_LEG1_H_TEMP")
    9121                      .dwattr $C$DW$845, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    9122                      .dwattr $C$DW$845, DW_AT_accessibility(DW_ACCESS_public)
    9123                      .dwattr $C$DW$845, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/ttplpfc/ttplpfc_ha
    9124                      .dwattr $C$DW$845, DW_AT_decl_line(0x35)
    9125                      .dwattr $C$DW$845, DW_AT_decl_column(0x13)
    9126              
    9127              $C$DW$846       .dwtag  DW_TAG_member
    9128                      .dwattr $C$DW$846, DW_AT_type(*$C$DW$T$19)
    9129                      .dwattr $C$DW$846, DW_AT_name("CLLLC_SEC_LEG1_L_TEMP")
    9130                      .dwattr $C$DW$846, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    9131                      .dwattr $C$DW$846, DW_AT_accessibility(DW_ACCESS_public)
    9132                      .dwattr $C$DW$846, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/ttplpfc/ttplpfc_ha
    9133                      .dwattr $C$DW$846, DW_AT_decl_line(0x36)
    9134                      .dwattr $C$DW$846, DW_AT_decl_column(0x13)
    9135              
    9136              $C$DW$847       .dwtag  DW_TAG_member
    9137                      .dwattr $C$DW$847, DW_AT_type(*$C$DW$T$19)
    9138                      .dwattr $C$DW$847, DW_AT_name("CLLLC_SEC_LEG2_L_TEMP")
    9139                      .dwattr $C$DW$847, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    9140                      .dwattr $C$DW$847, DW_AT_accessibility(DW_ACCESS_public)
    9141                      .dwattr $C$DW$847, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/ttplpfc/ttplpfc_ha
    9142                      .dwattr $C$DW$847, DW_AT_decl_line(0x37)
    9143                      .dwattr $C$DW$847, DW_AT_decl_column(0x13)
    9144              
    9145              $C$DW$848       .dwtag  DW_TAG_member
    9146                      .dwattr $C$DW$848, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v22.6.0 Tue Dec 20 15:55:16 2022

Copyright (c) 1996-2018 Texas Instruments Incorporated
ttplpfc_hal.asm                                                      PAGE  176

    9147                      .dwattr $C$DW$848, DW_AT_name("CLLLC_SEC_LEG2_H_TEMP")
    9148                      .dwattr $C$DW$848, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    9149                      .dwattr $C$DW$848, DW_AT_accessibility(DW_ACCESS_public)
    9150                      .dwattr $C$DW$848, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/ttplpfc/ttplpfc_ha
    9151                      .dwattr $C$DW$848, DW_AT_decl_line(0x38)
    9152                      .dwattr $C$DW$848, DW_AT_decl_column(0x13)
    9153              
    9154                      .dwattr $C$DW$T$20, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/ttplpfc/ttplpfc_h
    9155                      .dwattr $C$DW$T$20, DW_AT_decl_line(0x2c)
    9156                      .dwattr $C$DW$T$20, DW_AT_decl_column(0x0c)
    9157                      .dwendtag $C$DW$T$20
    9158              
    9159                      .dwendtag $C$DW$TU$20
    9160              
    9161              
    9162              $C$DW$TU$22     .dwtag  DW_TAG_type_unit
    9163                      .dwmtype  $C$DW$T$22
    9164              
    9165              $C$DW$T$22      .dwtag  DW_TAG_union_type
    9166                      .dwattr $C$DW$T$22, DW_AT_byte_size(0x18)
    9167              $C$DW$849       .dwtag  DW_TAG_member
    9168                      .dwattr $C$DW$849, DW_AT_type(*$C$DW$T$20)
    9169                      .dwattr $C$DW$849, DW_AT_name("device")
    9170                      .dwattr $C$DW$849, DW_AT_accessibility(DW_ACCESS_public)
    9171                      .dwattr $C$DW$849, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/ttplpfc/ttplpfc_ha
    9172                      .dwattr $C$DW$849, DW_AT_decl_line(0x39)
    9173                      .dwattr $C$DW$849, DW_AT_decl_column(0x07)
    9174              
    9175              $C$DW$850       .dwtag  DW_TAG_member
    9176                      .dwattr $C$DW$850, DW_AT_type(*$C$DW$T$21)
    9177                      .dwattr $C$DW$850, DW_AT_name("array")
    9178                      .dwattr $C$DW$850, DW_AT_accessibility(DW_ACCESS_public)
    9179                      .dwattr $C$DW$850, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/ttplpfc/ttplpfc_ha
    9180                      .dwattr $C$DW$850, DW_AT_decl_line(0x3a)
    9181                      .dwattr $C$DW$850, DW_AT_decl_column(0x0f)
    9182              
    9183                      .dwattr $C$DW$T$22, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/ttplpfc/ttplpfc_h
    9184                      .dwattr $C$DW$T$22, DW_AT_decl_line(0x2b)
    9185                      .dwattr $C$DW$T$22, DW_AT_decl_column(0x0f)
    9186                      .dwendtag $C$DW$T$22
    9187              
    9188                      .dwendtag $C$DW$TU$22
    9189              
    9190              
    9191              $C$DW$TU$129    .dwtag  DW_TAG_type_unit
    9192                      .dwmtype  $C$DW$T$129
    9193              $C$DW$T$129     .dwtag  DW_TAG_typedef
    9194                      .dwattr $C$DW$T$129, DW_AT_name("TTPLPFC_HAL_GaNTemp_Struct")
    9195                      .dwattr $C$DW$T$129, DW_AT_type(*$C$DW$T$22)
    9196                      .dwattr $C$DW$T$129, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/ttplpfc/ttplpfc_
    9197                      .dwattr $C$DW$T$129, DW_AT_decl_line(0x3b)
    9198                      .dwattr $C$DW$T$129, DW_AT_decl_column(0x03)
    9199              
    9200                      .dwendtag $C$DW$TU$129
    9201              
TMS320C2000 Assembler PC v22.6.0 Tue Dec 20 15:55:16 2022

Copyright (c) 1996-2018 Texas Instruments Incorporated
ttplpfc_hal.asm                                                      PAGE  177

    9202              
    9203              $C$DW$TU$2      .dwtag  DW_TAG_type_unit
    9204                      .dwmtype  $C$DW$T$2
    9205              $C$DW$T$2       .dwtag  DW_TAG_unspecified_type
