TMS320C2000 Assembler PC v22.6.0 Tue Dec 20 15:55:15 2022

Copyright (c) 1996-2018 Texas Instruments Incorporated
sfra_gui_scicomms_driverlib.asm                                      PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 G3 C/C++ Codegen                               PC v22.6.0.LTS *
       3              ;* Date/Time created: Tue Dec 20 15:55:14 2022                 *
       4              ;***************************************************************
       5                      .compiler_opts --abi=eabi --cla_support=cla2 --diag_wrap=off --float_support=fpu64 --hll_source=on --
       6                      .asg    XAR2, FP
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("../libraries/sfra/sfra_gui_scicomms_driverlib.c")
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 G3 C/C++ Codegen PC v22.6.0.LTS Copyright (c) 1996-2
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("C:\Users\gerar\workspace_v12\7.4kW_OBC_F28003x\RELEASE")
      13              
      14              ;**************************************************************
      15              ;* FUNCTION SYNONYMS                                          *

    5507                      .dwendtag $C$DW$T$24
    5508              
    5509                      .dwendtag $C$DW$TU$24
    5510              
    5511              
    5512              $C$DW$TU$25     .dwtag  DW_TAG_type_unit
    5513                      .dwmtype  $C$DW$T$25
    5514              $C$DW$T$25      .dwtag  DW_TAG_typedef
    5515                      .dwattr $C$DW$T$25, DW_AT_name("GPIO_Direction")
    5516                      .dwattr $C$DW$T$25, DW_AT_type(*$C$DW$T$24)
    5517                      .dwattr $C$DW$T$25, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/device/driverlib/
    5518                      .dwattr $C$DW$T$25, DW_AT_decl_line(0x81)
    5519                      .dwattr $C$DW$T$25, DW_AT_decl_column(0x03)
    5520              
TMS320C2000 Assembler PC v22.6.0 Tue Dec 20 15:55:15 2022

Copyright (c) 1996-2018 Texas Instruments Incorporated
sfra_gui_scicomms_driverlib.asm                                      PAGE  108

    5521                      .dwendtag $C$DW$TU$25
    5522              
    5523              
    5524              $C$DW$TU$26     .dwtag  DW_TAG_type_unit
    5525                      .dwmtype  $C$DW$T$26
    5526              
    5527              $C$DW$T$26      .dwtag  DW_TAG_enumeration_type
    5528                      .dwattr $C$DW$T$26, DW_AT_byte_size(0x01)
    5529              $C$DW$304       .dwtag  DW_TAG_enumerator
    5530                      .dwattr $C$DW$304, DW_AT_name("GPIO_QUAL_SYNC")
    5531                      .dwattr $C$DW$304, DW_AT_const_value(0x00)
    5532                      .dwattr $C$DW$304, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/device/driverlib/g
    5533                      .dwattr $C$DW$304, DW_AT_decl_line(0x98)
    5534                      .dwattr $C$DW$304, DW_AT_decl_column(0x05)
    5535              
    5536              $C$DW$305       .dwtag  DW_TAG_enumerator
    5537                      .dwattr $C$DW$305, DW_AT_name("GPIO_QUAL_3SAMPLE")
    5538                      .dwattr $C$DW$305, DW_AT_const_value(0x01)
    5539                      .dwattr $C$DW$305, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/device/driverlib/g
    5540                      .dwattr $C$DW$305, DW_AT_decl_line(0x99)
    5541                      .dwattr $C$DW$305, DW_AT_decl_column(0x05)
    5542              
    5543              $C$DW$306       .dwtag  DW_TAG_enumerator
    5544                      .dwattr $C$DW$306, DW_AT_name("GPIO_QUAL_6SAMPLE")
    5545                      .dwattr $C$DW$306, DW_AT_const_value(0x02)
    5546                      .dwattr $C$DW$306, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/device/driverlib/g
    5547                      .dwattr $C$DW$306, DW_AT_decl_line(0x9a)
    5548                      .dwattr $C$DW$306, DW_AT_decl_column(0x05)
    5549              
    5550              $C$DW$307       .dwtag  DW_TAG_enumerator
    5551                      .dwattr $C$DW$307, DW_AT_name("GPIO_QUAL_ASYNC")
    5552                      .dwattr $C$DW$307, DW_AT_const_value(0x03)
    5553                      .dwattr $C$DW$307, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/device/driverlib/g
    5554                      .dwattr $C$DW$307, DW_AT_decl_line(0x9b)
    5555                      .dwattr $C$DW$307, DW_AT_decl_column(0x05)
    5556              
    5557                      .dwattr $C$DW$T$26, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/device/driverlib/
    5558                      .dwattr $C$DW$T$26, DW_AT_decl_line(0x97)
    5559                      .dwattr $C$DW$T$26, DW_AT_decl_column(0x01)
    5560                      .dwendtag $C$DW$T$26
    5561              
    5562                      .dwendtag $C$DW$TU$26
    5563              
    5564              
    5565              $C$DW$TU$27     .dwtag  DW_TAG_type_unit
    5566                      .dwmtype  $C$DW$T$27
    5567              $C$DW$T$27      .dwtag  DW_TAG_typedef
    5568                      .dwattr $C$DW$T$27, DW_AT_name("GPIO_QualificationMode")
    5569                      .dwattr $C$DW$T$27, DW_AT_type(*$C$DW$T$26)
    5570                      .dwattr $C$DW$T$27, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/device/driverlib/
    5571                      .dwattr $C$DW$T$27, DW_AT_decl_line(0x9c)
    5572                      .dwattr $C$DW$T$27, DW_AT_decl_column(0x03)
    5573              
    5574                      .dwendtag $C$DW$TU$27
    5575              
TMS320C2000 Assembler PC v22.6.0 Tue Dec 20 15:55:15 2022

Copyright (c) 1996-2018 Texas Instruments Incorporated
sfra_gui_scicomms_driverlib.asm                                      PAGE  109

    5576              
    5577              $C$DW$TU$23     .dwtag  DW_TAG_type_unit
    5578                      .dwmtype  $C$DW$T$23
    5579              
    5580              $C$DW$T$23      .dwtag  DW_TAG_structure_type
    5581                      .dwattr $C$DW$T$23, DW_AT_byte_size(0x20)
    5582              $C$DW$308       .dwtag  DW_TAG_member
    5583                      .dwattr $C$DW$308, DW_AT_type(*$C$DW$T$20)
    5584                      .dwattr $C$DW$308, DW_AT_name("h_magVect")
    5585                      .dwattr $C$DW$308, DW_AT_accessibility(DW_ACCESS_public)
    5586                      .dwattr $C$DW$308, DW_AT_decl_file("..\libraries\sfra\sfra_f32.h")
    5587                      .dwattr $C$DW$308, DW_AT_decl_line(0x40)
    5588                      .dwattr $C$DW$308, DW_AT_decl_column(0x10)
    5589              
    5590              $C$DW$309       .dwtag  DW_TAG_member
    5591                      .dwattr $C$DW$309, DW_AT_type(*$C$DW$T$20)
    5592                      .dwattr $C$DW$309, DW_AT_name("h_phaseVect")
    5593                      .dwattr $C$DW$309, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5594                      .dwattr $C$DW$309, DW_AT_accessibility(DW_ACCESS_public)
    5595                      .dwattr $C$DW$309, DW_AT_decl_file("..\libraries\sfra\sfra_f32.h")
    5596                      .dwattr $C$DW$309, DW_AT_decl_line(0x41)
    5597                      .dwattr $C$DW$309, DW_AT_decl_column(0x10)
    5598              
    5599              $C$DW$310       .dwtag  DW_TAG_member
    5600                      .dwattr $C$DW$310, DW_AT_type(*$C$DW$T$20)
    5601                      .dwattr $C$DW$310, DW_AT_name("gh_magVect")
    5602                      .dwattr $C$DW$310, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5603                      .dwattr $C$DW$310, DW_AT_accessibility(DW_ACCESS_public)
    5604                      .dwattr $C$DW$310, DW_AT_decl_file("..\libraries\sfra\sfra_f32.h")
    5605                      .dwattr $C$DW$310, DW_AT_decl_line(0x42)
    5606                      .dwattr $C$DW$310, DW_AT_decl_column(0x10)
    5607              
    5608              $C$DW$311       .dwtag  DW_TAG_member
    5609                      .dwattr $C$DW$311, DW_AT_type(*$C$DW$T$20)
    5610                      .dwattr $C$DW$311, DW_AT_name("gh_phaseVect")
    5611                      .dwattr $C$DW$311, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    5612                      .dwattr $C$DW$311, DW_AT_accessibility(DW_ACCESS_public)
    5613                      .dwattr $C$DW$311, DW_AT_decl_file("..\libraries\sfra\sfra_f32.h")
    5614                      .dwattr $C$DW$311, DW_AT_decl_line(0x43)
    5615                      .dwattr $C$DW$311, DW_AT_decl_column(0x10)
    5616              
    5617              $C$DW$312       .dwtag  DW_TAG_member
    5618                      .dwattr $C$DW$312, DW_AT_type(*$C$DW$T$20)
    5619                      .dwattr $C$DW$312, DW_AT_name("cl_magVect")
    5620                      .dwattr $C$DW$312, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    5621                      .dwattr $C$DW$312, DW_AT_accessibility(DW_ACCESS_public)
    5622                      .dwattr $C$DW$312, DW_AT_decl_file("..\libraries\sfra\sfra_f32.h")
    5623                      .dwattr $C$DW$312, DW_AT_decl_line(0x44)
    5624                      .dwattr $C$DW$312, DW_AT_decl_column(0x10)
    5625              
    5626              $C$DW$313       .dwtag  DW_TAG_member
    5627                      .dwattr $C$DW$313, DW_AT_type(*$C$DW$T$20)
    5628                      .dwattr $C$DW$313, DW_AT_name("cl_phaseVect")
    5629                      .dwattr $C$DW$313, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    5630                      .dwattr $C$DW$313, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v22.6.0 Tue Dec 20 15:55:15 2022

Copyright (c) 1996-2018 Texas Instruments Incorporated
sfra_gui_scicomms_driverlib.asm                                      PAGE  110

    5631                      .dwattr $C$DW$313, DW_AT_decl_file("..\libraries\sfra\sfra_f32.h")
    5632                      .dwattr $C$DW$313, DW_AT_decl_line(0x45)
    5633                      .dwattr $C$DW$313, DW_AT_decl_column(0x10)
    5634              
    5635              $C$DW$314       .dwtag  DW_TAG_member
    5636                      .dwattr $C$DW$314, DW_AT_type(*$C$DW$T$20)
    5637                      .dwattr $C$DW$314, DW_AT_name("freqVect")
    5638                      .dwattr $C$DW$314, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    5639                      .dwattr $C$DW$314, DW_AT_accessibility(DW_ACCESS_public)
    5640                      .dwattr $C$DW$314, DW_AT_decl_file("..\libraries\sfra\sfra_f32.h")
    5641                      .dwattr $C$DW$314, DW_AT_decl_line(0x46)
    5642                      .dwattr $C$DW$314, DW_AT_decl_column(0x10)
    5643              
    5644              $C$DW$315       .dwtag  DW_TAG_member
    5645                      .dwattr $C$DW$315, DW_AT_type(*$C$DW$T$19)
    5646                      .dwattr $C$DW$315, DW_AT_name("amplitude")
    5647                      .dwattr $C$DW$315, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    5648                      .dwattr $C$DW$315, DW_AT_accessibility(DW_ACCESS_public)
    5649                      .dwattr $C$DW$315, DW_AT_decl_file("..\libraries\sfra\sfra_f32.h")
    5650                      .dwattr $C$DW$315, DW_AT_decl_line(0x47)
    5651                      .dwattr $C$DW$315, DW_AT_decl_column(0x0f)
    5652              
    5653              $C$DW$316       .dwtag  DW_TAG_member
    5654                      .dwattr $C$DW$316, DW_AT_type(*$C$DW$T$19)
    5655                      .dwattr $C$DW$316, DW_AT_name("isrFreq")
    5656                      .dwattr $C$DW$316, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    5657                      .dwattr $C$DW$316, DW_AT_accessibility(DW_ACCESS_public)
    5658                      .dwattr $C$DW$316, DW_AT_decl_file("..\libraries\sfra\sfra_f32.h")
    5659                      .dwattr $C$DW$316, DW_AT_decl_line(0x48)
    5660                      .dwattr $C$DW$316, DW_AT_decl_column(0x0f)
    5661              
    5662              $C$DW$317       .dwtag  DW_TAG_member
    5663                      .dwattr $C$DW$317, DW_AT_type(*$C$DW$T$19)
    5664                      .dwattr $C$DW$317, DW_AT_name("freqStart")
    5665                      .dwattr $C$DW$317, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    5666                      .dwattr $C$DW$317, DW_AT_accessibility(DW_ACCESS_public)
    5667                      .dwattr $C$DW$317, DW_AT_decl_file("..\libraries\sfra\sfra_f32.h")
    5668                      .dwattr $C$DW$317, DW_AT_decl_line(0x49)
    5669                      .dwattr $C$DW$317, DW_AT_decl_column(0x0f)
    5670              
    5671              $C$DW$318       .dwtag  DW_TAG_member
    5672                      .dwattr $C$DW$318, DW_AT_type(*$C$DW$T$19)
    5673                      .dwattr $C$DW$318, DW_AT_name("freqStep")
    5674                      .dwattr $C$DW$318, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    5675                      .dwattr $C$DW$318, DW_AT_accessibility(DW_ACCESS_public)
    5676                      .dwattr $C$DW$318, DW_AT_decl_file("..\libraries\sfra\sfra_f32.h")
    5677                      .dwattr $C$DW$318, DW_AT_decl_line(0x4a)
    5678                      .dwattr $C$DW$318, DW_AT_decl_column(0x0f)
    5679              
    5680              $C$DW$319       .dwtag  DW_TAG_member
    5681                      .dwattr $C$DW$319, DW_AT_type(*$C$DW$T$22)
    5682                      .dwattr $C$DW$319, DW_AT_name("start")
    5683                      .dwattr $C$DW$319, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    5684                      .dwattr $C$DW$319, DW_AT_accessibility(DW_ACCESS_public)
    5685                      .dwattr $C$DW$319, DW_AT_decl_file("..\libraries\sfra\sfra_f32.h")
TMS320C2000 Assembler PC v22.6.0 Tue Dec 20 15:55:15 2022

Copyright (c) 1996-2018 Texas Instruments Incorporated
sfra_gui_scicomms_driverlib.asm                                      PAGE  111

    5686                      .dwattr $C$DW$319, DW_AT_decl_line(0x4b)
    5687                      .dwattr $C$DW$319, DW_AT_decl_column(0x0d)
    5688              
    5689              $C$DW$320       .dwtag  DW_TAG_member
    5690                      .dwattr $C$DW$320, DW_AT_type(*$C$DW$T$22)
    5691                      .dwattr $C$DW$320, DW_AT_name("state")
    5692                      .dwattr $C$DW$320, DW_AT_data_member_location[DW_OP_plus_uconst 0x17]
    5693                      .dwattr $C$DW$320, DW_AT_accessibility(DW_ACCESS_public)
    5694                      .dwattr $C$DW$320, DW_AT_decl_file("..\libraries\sfra\sfra_f32.h")
    5695                      .dwattr $C$DW$320, DW_AT_decl_line(0x4c)
    5696                      .dwattr $C$DW$320, DW_AT_decl_column(0x0d)
    5697              
    5698              $C$DW$321       .dwtag  DW_TAG_member
    5699                      .dwattr $C$DW$321, DW_AT_type(*$C$DW$T$22)
    5700                      .dwattr $C$DW$321, DW_AT_name("status")
    5701                      .dwattr $C$DW$321, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    5702                      .dwattr $C$DW$321, DW_AT_accessibility(DW_ACCESS_public)
    5703                      .dwattr $C$DW$321, DW_AT_decl_file("..\libraries\sfra\sfra_f32.h")
    5704                      .dwattr $C$DW$321, DW_AT_decl_line(0x4d)
    5705                      .dwattr $C$DW$321, DW_AT_decl_column(0x0d)
    5706              
    5707              $C$DW$322       .dwtag  DW_TAG_member
    5708                      .dwattr $C$DW$322, DW_AT_type(*$C$DW$T$22)
    5709                      .dwattr $C$DW$322, DW_AT_name("vecLength")
    5710                      .dwattr $C$DW$322, DW_AT_data_member_location[DW_OP_plus_uconst 0x19]
    5711                      .dwattr $C$DW$322, DW_AT_accessibility(DW_ACCESS_public)
    5712                      .dwattr $C$DW$322, DW_AT_decl_file("..\libraries\sfra\sfra_f32.h")
    5713                      .dwattr $C$DW$322, DW_AT_decl_line(0x4e)
    5714                      .dwattr $C$DW$322, DW_AT_decl_column(0x0d)
    5715              
    5716              $C$DW$323       .dwtag  DW_TAG_member
    5717                      .dwattr $C$DW$323, DW_AT_type(*$C$DW$T$22)
    5718                      .dwattr $C$DW$323, DW_AT_name("freqIndex")
    5719                      .dwattr $C$DW$323, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    5720                      .dwattr $C$DW$323, DW_AT_accessibility(DW_ACCESS_public)
    5721                      .dwattr $C$DW$323, DW_AT_decl_file("..\libraries\sfra\sfra_f32.h")
    5722                      .dwattr $C$DW$323, DW_AT_decl_line(0x4f)
    5723                      .dwattr $C$DW$323, DW_AT_decl_column(0x0d)
    5724              
    5725              $C$DW$324       .dwtag  DW_TAG_member
    5726                      .dwattr $C$DW$324, DW_AT_type(*$C$DW$T$22)
    5727                      .dwattr $C$DW$324, DW_AT_name("storeH")
    5728                      .dwattr $C$DW$324, DW_AT_data_member_location[DW_OP_plus_uconst 0x1b]
    5729                      .dwattr $C$DW$324, DW_AT_accessibility(DW_ACCESS_public)
    5730                      .dwattr $C$DW$324, DW_AT_decl_file("..\libraries\sfra\sfra_f32.h")
    5731                      .dwattr $C$DW$324, DW_AT_decl_line(0x50)
    5732                      .dwattr $C$DW$324, DW_AT_decl_column(0x0d)
    5733              
    5734              $C$DW$325       .dwtag  DW_TAG_member
    5735                      .dwattr $C$DW$325, DW_AT_type(*$C$DW$T$22)
    5736                      .dwattr $C$DW$325, DW_AT_name("storeGH")
    5737                      .dwattr $C$DW$325, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    5738                      .dwattr $C$DW$325, DW_AT_accessibility(DW_ACCESS_public)
    5739                      .dwattr $C$DW$325, DW_AT_decl_file("..\libraries\sfra\sfra_f32.h")
    5740                      .dwattr $C$DW$325, DW_AT_decl_line(0x51)
TMS320C2000 Assembler PC v22.6.0 Tue Dec 20 15:55:15 2022

Copyright (c) 1996-2018 Texas Instruments Incorporated
sfra_gui_scicomms_driverlib.asm                                      PAGE  112

    5741                      .dwattr $C$DW$325, DW_AT_decl_column(0x0d)
    5742              
    5743              $C$DW$326       .dwtag  DW_TAG_member
    5744                      .dwattr $C$DW$326, DW_AT_type(*$C$DW$T$22)
    5745                      .dwattr $C$DW$326, DW_AT_name("storeCL")
    5746                      .dwattr $C$DW$326, DW_AT_data_member_location[DW_OP_plus_uconst 0x1d]
    5747                      .dwattr $C$DW$326, DW_AT_accessibility(DW_ACCESS_public)
    5748                      .dwattr $C$DW$326, DW_AT_decl_file("..\libraries\sfra\sfra_f32.h")
    5749                      .dwattr $C$DW$326, DW_AT_decl_line(0x52)
    5750                      .dwattr $C$DW$326, DW_AT_decl_column(0x0d)
    5751              
    5752              $C$DW$327       .dwtag  DW_TAG_member
    5753                      .dwattr $C$DW$327, DW_AT_type(*$C$DW$T$22)
    5754                      .dwattr $C$DW$327, DW_AT_name("speed")
    5755                      .dwattr $C$DW$327, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    5756                      .dwattr $C$DW$327, DW_AT_accessibility(DW_ACCESS_public)
    5757                      .dwattr $C$DW$327, DW_AT_decl_file("..\libraries\sfra\sfra_f32.h")
    5758                      .dwattr $C$DW$327, DW_AT_decl_line(0x53)
    5759                      .dwattr $C$DW$327, DW_AT_decl_column(0x0d)
    5760              
    5761                      .dwattr $C$DW$T$23, DW_AT_decl_file("..\libraries\sfra\sfra_f32.h")
    5762                      .dwattr $C$DW$T$23, DW_AT_decl_line(0x3f)
    5763                      .dwattr $C$DW$T$23, DW_AT_decl_column(0x0f)
    5764                      .dwendtag $C$DW$T$23
    5765              
    5766                      .dwendtag $C$DW$TU$23
    5767              
    5768              
    5769              $C$DW$TU$28     .dwtag  DW_TAG_type_unit
    5770                      .dwmtype  $C$DW$T$28
    5771              $C$DW$T$28      .dwtag  DW_TAG_typedef
    5772                      .dwattr $C$DW$T$28, DW_AT_name("SFRA_F32")
    5773                      .dwattr $C$DW$T$28, DW_AT_type(*$C$DW$T$23)
    5774                      .dwattr $C$DW$T$28, DW_AT_decl_file("..\libraries\sfra\sfra_f32.h")
    5775                      .dwattr $C$DW$T$28, DW_AT_decl_line(0x54)
    5776                      .dwattr $C$DW$T$28, DW_AT_decl_column(0x02)
    5777              
    5778                      .dwendtag $C$DW$TU$28
    5779              
    5780              
    5781              $C$DW$TU$29     .dwtag  DW_TAG_type_unit
    5782                      .dwmtype  $C$DW$T$29
    5783              $C$DW$T$29      .dwtag  DW_TAG_pointer_type
    5784                      .dwattr $C$DW$T$29, DW_AT_type(*$C$DW$T$28)
    5785                      .dwattr $C$DW$T$29, DW_AT_address_class(0x20)
    5786              
    5787                      .dwendtag $C$DW$TU$29
    5788              
    5789              
    5790              $C$DW$TU$30     .dwtag  DW_TAG_type_unit
    5791                      .dwmtype  $C$DW$T$30
    5792              $C$DW$328       .dwtag  DW_TAG_TI_far_type
    5793                      .dwattr $C$DW$328, DW_AT_type(*$C$DW$T$29)
    5794              
    5795              $C$DW$T$30      .dwtag  DW_TAG_const_type
TMS320C2000 Assembler PC v22.6.0 Tue Dec 20 15:55:15 2022

Copyright (c) 1996-2018 Texas Instruments Incorporated
sfra_gui_scicomms_driverlib.asm                                      PAGE  113

    5796                      .dwattr $C$DW$T$30, DW_AT_type(*$C$DW$328)
    5797              
    5798                      .dwendtag $C$DW$TU$30
    5799              
    5800              
    5801              $C$DW$TU$2      .dwtag  DW_TAG_type_unit
    5802                      .dwmtype  $C$DW$T$2
    5803              $C$DW$T$2       .dwtag  DW_TAG_unspecified_type
    5804                      .dwattr $C$DW$T$2, DW_AT_name("void")
    5805              
    5806                      .dwendtag $C$DW$TU$2
    5807              
    5808              
    5809              $C$DW$TU$51     .dwtag  DW_TAG_type_unit
    5810                      .dwmtype  $C$DW$T$51
    5811              
    5812              $C$DW$T$51      .dwtag  DW_TAG_subroutine_type
    5813                      .dwendtag $C$DW$T$51
    5814              
    5815                      .dwendtag $C$DW$TU$51
    5816              
    5817              
    5818              $C$DW$TU$52     .dwtag  DW_TAG_type_unit
    5819                      .dwmtype  $C$DW$T$52
    5820              $C$DW$T$52      .dwtag  DW_TAG_pointer_type
    5821                      .dwattr $C$DW$T$52, DW_AT_type(*$C$DW$T$51)
    5822                      .dwattr $C$DW$T$52, DW_AT_address_class(0x20)
    5823              
    5824                      .dwendtag $C$DW$TU$52
    5825              
    5826              
