;***************************************************************
;* TMS320C2000 G3 C/C++ Codegen                               PC v22.6.0.LTS *
;* Date/Time created: Tue Dec 20 15:55:13 2022                 *
;***************************************************************
	.compiler_opts --abi=eabi --cla_support=cla2 --diag_wrap=off --float_support=fpu64 --hll_source=on --mem_model:code=flat --mem_model:data=large --object_format=elf --quiet --silicon_errata_fpu1_workaround=off --silicon_version=28 --symdebug:dwarf --symdebug:dwarf_version=4 --tmu_support=tmu0 --vcu_support=vcu2 
	.asg	XAR2, FP

$C$DW$CU	.dwtag  DW_TAG_compile_unit
	.dwattr $C$DW$CU, DW_AT_name("../clllc/clllc_hal.c")
	.dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 G3 C/C++ Codegen PC v22.6.0.LTS Copyright (c) 1996-2018 Texas Instruments Incorporated")
	.dwattr $C$DW$CU, DW_AT_TI_version(0x01)
	.dwattr $C$DW$CU, DW_AT_comp_dir("C:\Users\gerar\workspace_v12\7.4kW_OBC_F28003x\RELEASE")

$C$DW$1	.dwtag  DW_TAG_subprogram
	.dwattr $C$DW$1, DW_AT_name("Device_init")
	.dwattr $C$DW$1, DW_AT_linkage_name("Device_init")
	.dwattr $C$DW$1, DW_AT_declaration
	.dwattr $C$DW$1, DW_AT_external
	.dwattr $C$DW$1, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/device/device.h")
	.dwattr $C$DW$1, DW_AT_decl_line(0x17c)
	.dwattr $C$DW$1, DW_AT_decl_column(0x0d)
	.dwendtag $C$DW$1


$C$DW$2	.dwtag  DW_TAG_subprogram
	.dwattr $C$DW$2, DW_AT_name("Device_initGPIO")

	.dwattr $C$DW$1223, DW_AT_name("SCI_FIFO_TX3")
	.dwattr $C$DW$1223, DW_AT_const_value(0x03)
	.dwattr $C$DW$1223, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/device/driverlib/sci.h")
	.dwattr $C$DW$1223, DW_AT_decl_line(0x85)
	.dwattr $C$DW$1223, DW_AT_decl_column(0x05)

$C$DW$1224	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$1224, DW_AT_name("SCI_FIFO_TX4")
	.dwattr $C$DW$1224, DW_AT_const_value(0x04)
	.dwattr $C$DW$1224, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/device/driverlib/sci.h")
	.dwattr $C$DW$1224, DW_AT_decl_line(0x86)
	.dwattr $C$DW$1224, DW_AT_decl_column(0x05)

$C$DW$1225	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$1225, DW_AT_name("SCI_FIFO_TX5")
	.dwattr $C$DW$1225, DW_AT_const_value(0x05)
	.dwattr $C$DW$1225, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/device/driverlib/sci.h")
	.dwattr $C$DW$1225, DW_AT_decl_line(0x87)
	.dwattr $C$DW$1225, DW_AT_decl_column(0x05)

$C$DW$1226	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$1226, DW_AT_name("SCI_FIFO_TX6")
	.dwattr $C$DW$1226, DW_AT_const_value(0x06)
	.dwattr $C$DW$1226, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/device/driverlib/sci.h")
	.dwattr $C$DW$1226, DW_AT_decl_line(0x88)
	.dwattr $C$DW$1226, DW_AT_decl_column(0x05)

$C$DW$1227	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$1227, DW_AT_name("SCI_FIFO_TX7")
	.dwattr $C$DW$1227, DW_AT_const_value(0x07)
	.dwattr $C$DW$1227, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/device/driverlib/sci.h")
	.dwattr $C$DW$1227, DW_AT_decl_line(0x89)
	.dwattr $C$DW$1227, DW_AT_decl_column(0x05)

$C$DW$1228	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$1228, DW_AT_name("SCI_FIFO_TX8")
	.dwattr $C$DW$1228, DW_AT_const_value(0x08)
	.dwattr $C$DW$1228, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/device/driverlib/sci.h")
	.dwattr $C$DW$1228, DW_AT_decl_line(0x8a)
	.dwattr $C$DW$1228, DW_AT_decl_column(0x05)

$C$DW$1229	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$1229, DW_AT_name("SCI_FIFO_TX9")
	.dwattr $C$DW$1229, DW_AT_const_value(0x09)
	.dwattr $C$DW$1229, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/device/driverlib/sci.h")
	.dwattr $C$DW$1229, DW_AT_decl_line(0x8b)
	.dwattr $C$DW$1229, DW_AT_decl_column(0x05)

$C$DW$1230	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$1230, DW_AT_name("SCI_FIFO_TX10")
	.dwattr $C$DW$1230, DW_AT_const_value(0x0a)
	.dwattr $C$DW$1230, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/device/driverlib/sci.h")
	.dwattr $C$DW$1230, DW_AT_decl_line(0x8c)
	.dwattr $C$DW$1230, DW_AT_decl_column(0x05)

$C$DW$1231	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$1231, DW_AT_name("SCI_FIFO_TX11")
	.dwattr $C$DW$1231, DW_AT_const_value(0x0b)
	.dwattr $C$DW$1231, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/device/driverlib/sci.h")
	.dwattr $C$DW$1231, DW_AT_decl_line(0x8d)
	.dwattr $C$DW$1231, DW_AT_decl_column(0x05)

$C$DW$1232	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$1232, DW_AT_name("SCI_FIFO_TX12")
	.dwattr $C$DW$1232, DW_AT_const_value(0x0c)
	.dwattr $C$DW$1232, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/device/driverlib/sci.h")
	.dwattr $C$DW$1232, DW_AT_decl_line(0x8e)
	.dwattr $C$DW$1232, DW_AT_decl_column(0x05)

$C$DW$1233	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$1233, DW_AT_name("SCI_FIFO_TX13")
	.dwattr $C$DW$1233, DW_AT_const_value(0x0d)
	.dwattr $C$DW$1233, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/device/driverlib/sci.h")
	.dwattr $C$DW$1233, DW_AT_decl_line(0x8f)
	.dwattr $C$DW$1233, DW_AT_decl_column(0x05)

$C$DW$1234	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$1234, DW_AT_name("SCI_FIFO_TX14")
	.dwattr $C$DW$1234, DW_AT_const_value(0x0e)
	.dwattr $C$DW$1234, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/device/driverlib/sci.h")
	.dwattr $C$DW$1234, DW_AT_decl_line(0x90)
	.dwattr $C$DW$1234, DW_AT_decl_column(0x05)

$C$DW$1235	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$1235, DW_AT_name("SCI_FIFO_TX15")
	.dwattr $C$DW$1235, DW_AT_const_value(0x0f)
	.dwattr $C$DW$1235, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/device/driverlib/sci.h")
	.dwattr $C$DW$1235, DW_AT_decl_line(0x91)
	.dwattr $C$DW$1235, DW_AT_decl_column(0x05)

$C$DW$1236	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$1236, DW_AT_name("SCI_FIFO_TX16")
	.dwattr $C$DW$1236, DW_AT_const_value(0x10)
	.dwattr $C$DW$1236, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/device/driverlib/sci.h")
	.dwattr $C$DW$1236, DW_AT_decl_line(0x92)
	.dwattr $C$DW$1236, DW_AT_decl_column(0x05)

	.dwattr $C$DW$T$153, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/device/driverlib/sci.h")
	.dwattr $C$DW$T$153, DW_AT_decl_line(0x81)
	.dwattr $C$DW$T$153, DW_AT_decl_column(0x01)
	.dwendtag $C$DW$T$153

	.dwendtag $C$DW$TU$153


$C$DW$TU$154	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$154
$C$DW$T$154	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$154, DW_AT_name("SCI_TxFIFOLevel")
	.dwattr $C$DW$T$154, DW_AT_type(*$C$DW$T$153)
	.dwattr $C$DW$T$154, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/device/driverlib/sci.h")
	.dwattr $C$DW$T$154, DW_AT_decl_line(0x93)
	.dwattr $C$DW$T$154, DW_AT_decl_column(0x03)

	.dwendtag $C$DW$TU$154


$C$DW$TU$20	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$20

$C$DW$T$20	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$20, DW_AT_byte_size(0x18)
$C$DW$1237	.dwtag  DW_TAG_member
	.dwattr $C$DW$1237, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$1237, DW_AT_name("TTPLPFC_PH1_H_TEMP")
	.dwattr $C$DW$1237, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1237, DW_AT_decl_file("..\clllc\clllc_hal.h")
	.dwattr $C$DW$1237, DW_AT_decl_line(0x2e)
	.dwattr $C$DW$1237, DW_AT_decl_column(0x13)

$C$DW$1238	.dwtag  DW_TAG_member
	.dwattr $C$DW$1238, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$1238, DW_AT_name("TTPLPFC_PH1_L_TEMP")
	.dwattr $C$DW$1238, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$1238, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1238, DW_AT_decl_file("..\clllc\clllc_hal.h")
	.dwattr $C$DW$1238, DW_AT_decl_line(0x2f)
	.dwattr $C$DW$1238, DW_AT_decl_column(0x13)

$C$DW$1239	.dwtag  DW_TAG_member
	.dwattr $C$DW$1239, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$1239, DW_AT_name("TTPLPFC_PH2_L_TEMP")
	.dwattr $C$DW$1239, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$1239, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1239, DW_AT_decl_file("..\clllc\clllc_hal.h")
	.dwattr $C$DW$1239, DW_AT_decl_line(0x30)
	.dwattr $C$DW$1239, DW_AT_decl_column(0x13)

$C$DW$1240	.dwtag  DW_TAG_member
	.dwattr $C$DW$1240, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$1240, DW_AT_name("TTPLPFC_PH2_H_TEMP")
	.dwattr $C$DW$1240, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr $C$DW$1240, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1240, DW_AT_decl_file("..\clllc\clllc_hal.h")
	.dwattr $C$DW$1240, DW_AT_decl_line(0x31)
	.dwattr $C$DW$1240, DW_AT_decl_column(0x13)

$C$DW$1241	.dwtag  DW_TAG_member
	.dwattr $C$DW$1241, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$1241, DW_AT_name("CLLLC_PRIM_LEG1_H_TEMP")
	.dwattr $C$DW$1241, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$1241, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1241, DW_AT_decl_file("..\clllc\clllc_hal.h")
	.dwattr $C$DW$1241, DW_AT_decl_line(0x32)
	.dwattr $C$DW$1241, DW_AT_decl_column(0x13)

$C$DW$1242	.dwtag  DW_TAG_member
	.dwattr $C$DW$1242, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$1242, DW_AT_name("CLLLC_PRIM_LEG1_L_TEMP")
	.dwattr $C$DW$1242, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
	.dwattr $C$DW$1242, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1242, DW_AT_decl_file("..\clllc\clllc_hal.h")
	.dwattr $C$DW$1242, DW_AT_decl_line(0x33)
	.dwattr $C$DW$1242, DW_AT_decl_column(0x13)

$C$DW$1243	.dwtag  DW_TAG_member
	.dwattr $C$DW$1243, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$1243, DW_AT_name("CLLLC_PRIM_LEG2_L_TEMP")
	.dwattr $C$DW$1243, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$1243, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1243, DW_AT_decl_file("..\clllc\clllc_hal.h")
	.dwattr $C$DW$1243, DW_AT_decl_line(0x34)
	.dwattr $C$DW$1243, DW_AT_decl_column(0x13)

$C$DW$1244	.dwtag  DW_TAG_member
	.dwattr $C$DW$1244, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$1244, DW_AT_name("CLLLC_PRIM_LEG2_H_TEMP")
	.dwattr $C$DW$1244, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
	.dwattr $C$DW$1244, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1244, DW_AT_decl_file("..\clllc\clllc_hal.h")
	.dwattr $C$DW$1244, DW_AT_decl_line(0x35)
	.dwattr $C$DW$1244, DW_AT_decl_column(0x13)

$C$DW$1245	.dwtag  DW_TAG_member
	.dwattr $C$DW$1245, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$1245, DW_AT_name("CLLLC_SEC_LEG1_H_TEMP")
	.dwattr $C$DW$1245, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$1245, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1245, DW_AT_decl_file("..\clllc\clllc_hal.h")
	.dwattr $C$DW$1245, DW_AT_decl_line(0x36)
	.dwattr $C$DW$1245, DW_AT_decl_column(0x13)

$C$DW$1246	.dwtag  DW_TAG_member
	.dwattr $C$DW$1246, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$1246, DW_AT_name("CLLLC_SEC_LEG1_L_TEMP")
	.dwattr $C$DW$1246, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
	.dwattr $C$DW$1246, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1246, DW_AT_decl_file("..\clllc\clllc_hal.h")
	.dwattr $C$DW$1246, DW_AT_decl_line(0x37)
	.dwattr $C$DW$1246, DW_AT_decl_column(0x13)

$C$DW$1247	.dwtag  DW_TAG_member
	.dwattr $C$DW$1247, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$1247, DW_AT_name("CLLLC_SEC_LEG2_L_TEMP")
	.dwattr $C$DW$1247, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr $C$DW$1247, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1247, DW_AT_decl_file("..\clllc\clllc_hal.h")
	.dwattr $C$DW$1247, DW_AT_decl_line(0x38)
	.dwattr $C$DW$1247, DW_AT_decl_column(0x13)

$C$DW$1248	.dwtag  DW_TAG_member
	.dwattr $C$DW$1248, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$1248, DW_AT_name("CLLLC_SEC_LEG2_H_TEMP")
	.dwattr $C$DW$1248, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
	.dwattr $C$DW$1248, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1248, DW_AT_decl_file("..\clllc\clllc_hal.h")
	.dwattr $C$DW$1248, DW_AT_decl_line(0x39)
	.dwattr $C$DW$1248, DW_AT_decl_column(0x13)

	.dwattr $C$DW$T$20, DW_AT_decl_file("..\clllc\clllc_hal.h")
	.dwattr $C$DW$T$20, DW_AT_decl_line(0x2d)
	.dwattr $C$DW$T$20, DW_AT_decl_column(0x0c)
	.dwendtag $C$DW$T$20

	.dwendtag $C$DW$TU$20


$C$DW$TU$22	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$22

$C$DW$T$22	.dwtag  DW_TAG_union_type
	.dwattr $C$DW$T$22, DW_AT_byte_size(0x18)
$C$DW$1249	.dwtag  DW_TAG_member
	.dwattr $C$DW$1249, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$1249, DW_AT_name("device")
	.dwattr $C$DW$1249, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1249, DW_AT_decl_file("..\clllc\clllc_hal.h")
	.dwattr $C$DW$1249, DW_AT_decl_line(0x3a)
	.dwattr $C$DW$1249, DW_AT_decl_column(0x07)

$C$DW$1250	.dwtag  DW_TAG_member
	.dwattr $C$DW$1250, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$1250, DW_AT_name("array")
	.dwattr $C$DW$1250, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1250, DW_AT_decl_file("..\clllc\clllc_hal.h")
	.dwattr $C$DW$1250, DW_AT_decl_line(0x3b)
	.dwattr $C$DW$1250, DW_AT_decl_column(0x0f)

	.dwattr $C$DW$T$22, DW_AT_decl_file("..\clllc\clllc_hal.h")
	.dwattr $C$DW$T$22, DW_AT_decl_line(0x2c)
	.dwattr $C$DW$T$22, DW_AT_decl_column(0x0f)
	.dwendtag $C$DW$T$22

	.dwendtag $C$DW$TU$22


$C$DW$TU$158	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$158
$C$DW$T$158	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$158, DW_AT_name("CLLLC_HAL_GaNTemp_Struct")
	.dwattr $C$DW$T$158, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$T$158, DW_AT_decl_file("..\clllc\clllc_hal.h")
	.dwattr $C$DW$T$158, DW_AT_decl_line(0x3c)
	.dwattr $C$DW$T$158, DW_AT_decl_column(0x03)

	.dwendtag $C$DW$TU$158


$C$DW$TU$2	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$2
$C$DW$T$2	.dwtag  DW_TAG_unspecified_type
	.dwattr $C$DW$T$2, DW_AT_name("void")

	.dwendtag $C$DW$TU$2


$C$DW$TU$4	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$4
$C$DW$T$4	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
	.dwattr $C$DW$T$4, DW_AT_name("bool")
	.dwattr $C$DW$T$4, DW_AT_byte_size(0x01)

	.dwendtag $C$DW$TU$4


$C$DW$TU$5	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$5
$C$DW$T$5	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
	.dwattr $C$DW$T$5, DW_AT_name("signed char")
	.dwattr $C$DW$T$5, DW_AT_byte_size(0x01)

	.dwendtag $C$DW$TU$5


$C$DW$TU$6	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$6
$C$DW$T$6	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
	.dwattr $C$DW$T$6, DW_AT_name("unsigned char")
	.dwattr $C$DW$T$6, DW_AT_byte_size(0x01)

	.dwendtag $C$DW$TU$6


$C$DW$TU$7	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$7
$C$DW$T$7	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$7, DW_AT_encoding(DW_ATE_signed_char)
	.dwattr $C$DW$T$7, DW_AT_name("wchar_t")
	.dwattr $C$DW$T$7, DW_AT_byte_size(0x02)

	.dwendtag $C$DW$TU$7


$C$DW$TU$8	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$8
$C$DW$T$8	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$8, DW_AT_encoding(DW_ATE_signed)
	.dwattr $C$DW$T$8, DW_AT_name("short")
	.dwattr $C$DW$T$8, DW_AT_byte_size(0x01)

	.dwendtag $C$DW$TU$8


$C$DW$TU$9	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$9
$C$DW$T$9	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$9, DW_AT_encoding(DW_ATE_unsigned)
	.dwattr $C$DW$T$9, DW_AT_name("unsigned short")
	.dwattr $C$DW$T$9, DW_AT_byte_size(0x01)

	.dwendtag $C$DW$TU$9


$C$DW$TU$10	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$10
$C$DW$T$10	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$10, DW_AT_encoding(DW_ATE_signed)
	.dwattr $C$DW$T$10, DW_AT_name("int")
	.dwattr $C$DW$T$10, DW_AT_byte_size(0x01)

	.dwendtag $C$DW$TU$10


$C$DW$TU$252	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$252
