TMS320C2000 Assembler PC v22.6.0 Tue Dec 20 15:55:15 2022

Copyright (c) 1996-2018 Texas Instruments Incorporated
obc_7_4kw_main.asm                                                   PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 G3 C/C++ Codegen                               PC v22.6.0.LTS *
       3              ;* Date/Time created: Tue Dec 20 15:55:13 2022                 *
       4              ;***************************************************************
       5                      .compiler_opts --abi=eabi --cla_support=cla2 --diag_wrap=off --float_support=fpu64 --hll_source=on --
       6                      .asg    XAR2, FP
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("../obc_7_4kw_main.c")
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 G3 C/C++ Codegen PC v22.6.0.LTS Copyright (c) 1996-2
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("C:\Users\gerar\workspace_v12\7.4kW_OBC_F28003x\RELEASE")
      13              
      14              $C$DW$1 .dwtag  DW_TAG_subprogram
      15                      .dwattr $C$DW$1, DW_AT_name("__SFRA_F32_collect")
      16                      .dwattr $C$DW$1, DW_AT_linkage_name("__SFRA_F32_collect")

    8720                      .dwattr $C$DW$457, DW_AT_decl_file("C:\Users\gerar\workspace_v12\7.4kW_OBC_F28003x\device\driverlib\x
    8721                      .dwattr $C$DW$457, DW_AT_decl_line(0x2a1)
    8722                      .dwattr $C$DW$457, DW_AT_decl_column(0x05)
    8723              
    8724              $C$DW$458       .dwtag  DW_TAG_enumerator
    8725                      .dwattr $C$DW$458, DW_AT_name("XBAR_INPUT_FLG_CLB3_OUT4")
    8726                      .dwattr $C$DW$458, DW_AT_const_value(0x314)
    8727                      .dwattr $C$DW$458, DW_AT_decl_file("C:\Users\gerar\workspace_v12\7.4kW_OBC_F28003x\device\driverlib\x
    8728                      .dwattr $C$DW$458, DW_AT_decl_line(0x2a2)
    8729                      .dwattr $C$DW$458, DW_AT_decl_column(0x05)
    8730              
    8731              $C$DW$459       .dwtag  DW_TAG_enumerator
    8732                      .dwattr $C$DW$459, DW_AT_name("XBAR_INPUT_FLG_CLB3_OUT5")
    8733                      .dwattr $C$DW$459, DW_AT_const_value(0x315)
    8734                      .dwattr $C$DW$459, DW_AT_decl_file("C:\Users\gerar\workspace_v12\7.4kW_OBC_F28003x\device\driverlib\x
    8735                      .dwattr $C$DW$459, DW_AT_decl_line(0x2a3)
    8736                      .dwattr $C$DW$459, DW_AT_decl_column(0x05)
    8737              
    8738              $C$DW$460       .dwtag  DW_TAG_enumerator
    8739                      .dwattr $C$DW$460, DW_AT_name("XBAR_INPUT_FLG_CLB4_OUT4")
    8740                      .dwattr $C$DW$460, DW_AT_const_value(0x316)
    8741                      .dwattr $C$DW$460, DW_AT_decl_file("C:\Users\gerar\workspace_v12\7.4kW_OBC_F28003x\device\driverlib\x
    8742                      .dwattr $C$DW$460, DW_AT_decl_line(0x2a4)
    8743                      .dwattr $C$DW$460, DW_AT_decl_column(0x05)
    8744              
    8745              $C$DW$461       .dwtag  DW_TAG_enumerator
    8746                      .dwattr $C$DW$461, DW_AT_name("XBAR_INPUT_FLG_CLB4_OUT5")
    8747                      .dwattr $C$DW$461, DW_AT_const_value(0x317)
    8748                      .dwattr $C$DW$461, DW_AT_decl_file("C:\Users\gerar\workspace_v12\7.4kW_OBC_F28003x\device\driverlib\x
    8749                      .dwattr $C$DW$461, DW_AT_decl_line(0x2a5)
    8750                      .dwattr $C$DW$461, DW_AT_decl_column(0x05)
    8751              
    8752              $C$DW$462       .dwtag  DW_TAG_enumerator
    8753                      .dwattr $C$DW$462, DW_AT_name("XBAR_INPUT_FLG_ERRORSTS_ERROR")
    8754                      .dwattr $C$DW$462, DW_AT_const_value(0x31c)
    8755                      .dwattr $C$DW$462, DW_AT_decl_file("C:\Users\gerar\workspace_v12\7.4kW_OBC_F28003x\device\driverlib\x
    8756                      .dwattr $C$DW$462, DW_AT_decl_line(0x2a6)
    8757                      .dwattr $C$DW$462, DW_AT_decl_column(0x05)
    8758              
    8759              $C$DW$463       .dwtag  DW_TAG_enumerator
    8760                      .dwattr $C$DW$463, DW_AT_name("XBAR_INPUT_FLG_CLAHALT")
    8761                      .dwattr $C$DW$463, DW_AT_const_value(0x31f)
    8762                      .dwattr $C$DW$463, DW_AT_decl_file("C:\Users\gerar\workspace_v12\7.4kW_OBC_F28003x\device\driverlib\x
    8763                      .dwattr $C$DW$463, DW_AT_decl_line(0x2a7)
    8764                      .dwattr $C$DW$463, DW_AT_decl_column(0x05)
    8765              
    8766                      .dwattr $C$DW$T$71, DW_AT_decl_file("C:\Users\gerar\workspace_v12\7.4kW_OBC_F28003x\device\driverlib\
    8767                      .dwattr $C$DW$T$71, DW_AT_decl_line(0x241)
    8768                      .dwattr $C$DW$T$71, DW_AT_decl_column(0x01)
TMS320C2000 Assembler PC v22.6.0 Tue Dec 20 15:55:15 2022

Copyright (c) 1996-2018 Texas Instruments Incorporated
obc_7_4kw_main.asm                                                   PAGE  187

    8769                      .dwendtag $C$DW$T$71
    8770              
    8771                      .dwendtag $C$DW$TU$71
    8772              
    8773              
    8774              $C$DW$TU$72     .dwtag  DW_TAG_type_unit
    8775                      .dwmtype  $C$DW$T$72
    8776              $C$DW$T$72      .dwtag  DW_TAG_typedef
    8777                      .dwattr $C$DW$T$72, DW_AT_name("XBAR_InputFlag")
    8778                      .dwattr $C$DW$T$72, DW_AT_type(*$C$DW$T$71)
    8779                      .dwattr $C$DW$T$72, DW_AT_decl_file("C:\Users\gerar\workspace_v12\7.4kW_OBC_F28003x\device\driverlib\
    8780                      .dwattr $C$DW$T$72, DW_AT_decl_line(0x2a8)
    8781                      .dwattr $C$DW$T$72, DW_AT_decl_column(0x03)
    8782              
    8783                      .dwendtag $C$DW$TU$72
    8784              
    8785              
    8786              $C$DW$TU$23     .dwtag  DW_TAG_type_unit
    8787                      .dwmtype  $C$DW$T$23
    8788              
    8789              $C$DW$T$23      .dwtag  DW_TAG_structure_type
    8790                      .dwattr $C$DW$T$23, DW_AT_byte_size(0x1a)
    8791              $C$DW$464       .dwtag  DW_TAG_member
    8792                      .dwattr $C$DW$464, DW_AT_type(*$C$DW$T$20)
    8793                      .dwattr $C$DW$464, DW_AT_name("inputPtr1")
    8794                      .dwattr $C$DW$464, DW_AT_accessibility(DW_ACCESS_public)
    8795                      .dwattr $C$DW$464, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/utilitie
    8796                      .dwattr $C$DW$464, DW_AT_decl_line(0x42)
    8797                      .dwattr $C$DW$464, DW_AT_decl_column(0x0d)
    8798              
    8799              $C$DW$465       .dwtag  DW_TAG_member
    8800                      .dwattr $C$DW$465, DW_AT_type(*$C$DW$T$20)
    8801                      .dwattr $C$DW$465, DW_AT_name("inputPtr2")
    8802                      .dwattr $C$DW$465, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    8803                      .dwattr $C$DW$465, DW_AT_accessibility(DW_ACCESS_public)
    8804                      .dwattr $C$DW$465, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/utilitie
    8805                      .dwattr $C$DW$465, DW_AT_decl_line(0x43)
    8806                      .dwattr $C$DW$465, DW_AT_decl_column(0x0d)
    8807              
    8808              $C$DW$466       .dwtag  DW_TAG_member
    8809                      .dwattr $C$DW$466, DW_AT_type(*$C$DW$T$20)
    8810                      .dwattr $C$DW$466, DW_AT_name("inputPtr3")
    8811                      .dwattr $C$DW$466, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    8812                      .dwattr $C$DW$466, DW_AT_accessibility(DW_ACCESS_public)
    8813                      .dwattr $C$DW$466, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/utilitie
    8814                      .dwattr $C$DW$466, DW_AT_decl_line(0x44)
    8815                      .dwattr $C$DW$466, DW_AT_decl_column(0x0d)
    8816              
    8817              $C$DW$467       .dwtag  DW_TAG_member
    8818                      .dwattr $C$DW$467, DW_AT_type(*$C$DW$T$20)
    8819                      .dwattr $C$DW$467, DW_AT_name("inputPtr4")
    8820                      .dwattr $C$DW$467, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    8821                      .dwattr $C$DW$467, DW_AT_accessibility(DW_ACCESS_public)
    8822                      .dwattr $C$DW$467, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/utilitie
    8823                      .dwattr $C$DW$467, DW_AT_decl_line(0x45)
TMS320C2000 Assembler PC v22.6.0 Tue Dec 20 15:55:15 2022

Copyright (c) 1996-2018 Texas Instruments Incorporated
obc_7_4kw_main.asm                                                   PAGE  188

    8824                      .dwattr $C$DW$467, DW_AT_decl_column(0x0d)
    8825              
    8826              $C$DW$468       .dwtag  DW_TAG_member
    8827                      .dwattr $C$DW$468, DW_AT_type(*$C$DW$T$20)
    8828                      .dwattr $C$DW$468, DW_AT_name("outputPtr1")
    8829                      .dwattr $C$DW$468, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    8830                      .dwattr $C$DW$468, DW_AT_accessibility(DW_ACCESS_public)
    8831                      .dwattr $C$DW$468, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/utilitie
    8832                      .dwattr $C$DW$468, DW_AT_decl_line(0x46)
    8833                      .dwattr $C$DW$468, DW_AT_decl_column(0x0d)
    8834              
    8835              $C$DW$469       .dwtag  DW_TAG_member
    8836                      .dwattr $C$DW$469, DW_AT_type(*$C$DW$T$20)
    8837                      .dwattr $C$DW$469, DW_AT_name("outputPtr2")
    8838                      .dwattr $C$DW$469, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    8839                      .dwattr $C$DW$469, DW_AT_accessibility(DW_ACCESS_public)
    8840                      .dwattr $C$DW$469, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/utilitie
    8841                      .dwattr $C$DW$469, DW_AT_decl_line(0x47)
    8842                      .dwattr $C$DW$469, DW_AT_decl_column(0x0d)
    8843              
    8844              $C$DW$470       .dwtag  DW_TAG_member
    8845                      .dwattr $C$DW$470, DW_AT_type(*$C$DW$T$20)
    8846                      .dwattr $C$DW$470, DW_AT_name("outputPtr3")
    8847                      .dwattr $C$DW$470, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    8848                      .dwattr $C$DW$470, DW_AT_accessibility(DW_ACCESS_public)
    8849                      .dwattr $C$DW$470, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/utilitie
    8850                      .dwattr $C$DW$470, DW_AT_decl_line(0x48)
    8851                      .dwattr $C$DW$470, DW_AT_decl_column(0x0d)
    8852              
    8853              $C$DW$471       .dwtag  DW_TAG_member
    8854                      .dwattr $C$DW$471, DW_AT_type(*$C$DW$T$20)
    8855                      .dwattr $C$DW$471, DW_AT_name("outputPtr4")
    8856                      .dwattr $C$DW$471, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    8857                      .dwattr $C$DW$471, DW_AT_accessibility(DW_ACCESS_public)
    8858                      .dwattr $C$DW$471, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/utilitie
    8859                      .dwattr $C$DW$471, DW_AT_decl_line(0x49)
    8860                      .dwattr $C$DW$471, DW_AT_decl_column(0x0d)
    8861              
    8862              $C$DW$472       .dwtag  DW_TAG_member
    8863                      .dwattr $C$DW$472, DW_AT_type(*$C$DW$T$19)
    8864                      .dwattr $C$DW$472, DW_AT_name("prevValue")
    8865                      .dwattr $C$DW$472, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    8866                      .dwattr $C$DW$472, DW_AT_accessibility(DW_ACCESS_public)
    8867                      .dwattr $C$DW$472, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/utilitie
    8868                      .dwattr $C$DW$472, DW_AT_decl_line(0x4a)
    8869                      .dwattr $C$DW$472, DW_AT_decl_column(0x0c)
    8870              
    8871              $C$DW$473       .dwtag  DW_TAG_member
    8872                      .dwattr $C$DW$473, DW_AT_type(*$C$DW$T$19)
    8873                      .dwattr $C$DW$473, DW_AT_name("trigValue")
    8874                      .dwattr $C$DW$473, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    8875                      .dwattr $C$DW$473, DW_AT_accessibility(DW_ACCESS_public)
    8876                      .dwattr $C$DW$473, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/utilitie
    8877                      .dwattr $C$DW$473, DW_AT_decl_line(0x4b)
    8878                      .dwattr $C$DW$473, DW_AT_decl_column(0x0c)
TMS320C2000 Assembler PC v22.6.0 Tue Dec 20 15:55:15 2022

Copyright (c) 1996-2018 Texas Instruments Incorporated
obc_7_4kw_main.asm                                                   PAGE  189

    8879              
    8880              $C$DW$474       .dwtag  DW_TAG_member
    8881                      .dwattr $C$DW$474, DW_AT_type(*$C$DW$T$22)
    8882                      .dwattr $C$DW$474, DW_AT_name("status")
    8883                      .dwattr $C$DW$474, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    8884                      .dwattr $C$DW$474, DW_AT_accessibility(DW_ACCESS_public)
    8885                      .dwattr $C$DW$474, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/utilitie
    8886                      .dwattr $C$DW$474, DW_AT_decl_line(0x4c)
    8887                      .dwattr $C$DW$474, DW_AT_decl_column(0x0a)
    8888              
    8889              $C$DW$475       .dwtag  DW_TAG_member
    8890                      .dwattr $C$DW$475, DW_AT_type(*$C$DW$T$22)
    8891                      .dwattr $C$DW$475, DW_AT_name("preScalar")
    8892                      .dwattr $C$DW$475, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
    8893                      .dwattr $C$DW$475, DW_AT_accessibility(DW_ACCESS_public)
    8894                      .dwattr $C$DW$475, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/utilitie
    8895                      .dwattr $C$DW$475, DW_AT_decl_line(0x4d)
    8896                      .dwattr $C$DW$475, DW_AT_decl_column(0x0a)
    8897              
    8898              $C$DW$476       .dwtag  DW_TAG_member
    8899                      .dwattr $C$DW$476, DW_AT_type(*$C$DW$T$22)
    8900                      .dwattr $C$DW$476, DW_AT_name("skipCount")
    8901                      .dwattr $C$DW$476, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    8902                      .dwattr $C$DW$476, DW_AT_accessibility(DW_ACCESS_public)
    8903                      .dwattr $C$DW$476, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/utilitie
    8904                      .dwattr $C$DW$476, DW_AT_decl_line(0x4e)
    8905                      .dwattr $C$DW$476, DW_AT_decl_column(0x0a)
    8906              
    8907              $C$DW$477       .dwtag  DW_TAG_member
    8908                      .dwattr $C$DW$477, DW_AT_type(*$C$DW$T$22)
    8909                      .dwattr $C$DW$477, DW_AT_name("size")
    8910                      .dwattr $C$DW$477, DW_AT_data_member_location[DW_OP_plus_uconst 0x17]
    8911                      .dwattr $C$DW$477, DW_AT_accessibility(DW_ACCESS_public)
    8912                      .dwattr $C$DW$477, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/utilitie
    8913                      .dwattr $C$DW$477, DW_AT_decl_line(0x4f)
    8914                      .dwattr $C$DW$477, DW_AT_decl_column(0x0a)
    8915              
    8916              $C$DW$478       .dwtag  DW_TAG_member
    8917                      .dwattr $C$DW$478, DW_AT_type(*$C$DW$T$22)
    8918                      .dwattr $C$DW$478, DW_AT_name("count")
    8919                      .dwattr $C$DW$478, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    8920                      .dwattr $C$DW$478, DW_AT_accessibility(DW_ACCESS_public)
    8921                      .dwattr $C$DW$478, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/utilitie
    8922                      .dwattr $C$DW$478, DW_AT_decl_line(0x50)
    8923                      .dwattr $C$DW$478, DW_AT_decl_column(0x0a)
    8924              
    8925                      .dwattr $C$DW$T$23, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/utiliti
    8926                      .dwattr $C$DW$T$23, DW_AT_decl_line(0x41)
    8927                      .dwattr $C$DW$T$23, DW_AT_decl_column(0x18)
    8928                      .dwendtag $C$DW$T$23
    8929              
    8930                      .dwendtag $C$DW$TU$23
    8931              
    8932              
    8933              $C$DW$TU$73     .dwtag  DW_TAG_type_unit
TMS320C2000 Assembler PC v22.6.0 Tue Dec 20 15:55:15 2022

Copyright (c) 1996-2018 Texas Instruments Incorporated
obc_7_4kw_main.asm                                                   PAGE  190

    8934                      .dwmtype  $C$DW$T$73
    8935              $C$DW$479       .dwtag  DW_TAG_TI_far_type
    8936                      .dwattr $C$DW$479, DW_AT_type(*$C$DW$T$23)
    8937              
    8938              $C$DW$T$73      .dwtag  DW_TAG_volatile_type
    8939                      .dwattr $C$DW$T$73, DW_AT_type(*$C$DW$479)
    8940              
    8941                      .dwendtag $C$DW$TU$73
    8942              
    8943              
    8944              $C$DW$TU$74     .dwtag  DW_TAG_type_unit
    8945                      .dwmtype  $C$DW$T$74
    8946              $C$DW$T$74      .dwtag  DW_TAG_typedef
    8947                      .dwattr $C$DW$T$74, DW_AT_name("DLOG_4CH")
    8948                      .dwattr $C$DW$T$74, DW_AT_type(*$C$DW$T$73)
    8949                      .dwattr $C$DW$T$74, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/utiliti
    8950                      .dwattr $C$DW$T$74, DW_AT_decl_line(0x51)
    8951                      .dwattr $C$DW$T$74, DW_AT_decl_column(0x03)
    8952              
    8953                      .dwendtag $C$DW$TU$74
    8954              
    8955              
    8956              $C$DW$TU$24     .dwtag  DW_TAG_type_unit
    8957                      .dwmtype  $C$DW$T$24
    8958              
    8959              $C$DW$T$24      .dwtag  DW_TAG_structure_type
    8960                      .dwattr $C$DW$T$24, DW_AT_byte_size(0x14)
    8961              $C$DW$480       .dwtag  DW_TAG_member
    8962                      .dwattr $C$DW$480, DW_AT_type(*$C$DW$T$19)
    8963                      .dwattr $C$DW$480, DW_AT_name("osg_k")
    8964                      .dwattr $C$DW$480, DW_AT_accessibility(DW_ACCESS_public)
    8965                      .dwattr $C$DW$480, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/spll/spl
    8966                      .dwattr $C$DW$480, DW_AT_decl_line(0x41)
    8967                      .dwattr $C$DW$480, DW_AT_decl_column(0x0f)
    8968              
    8969              $C$DW$481       .dwtag  DW_TAG_member
    8970                      .dwattr $C$DW$481, DW_AT_type(*$C$DW$T$19)
    8971                      .dwattr $C$DW$481, DW_AT_name("osg_x")
    8972                      .dwattr $C$DW$481, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    8973                      .dwattr $C$DW$481, DW_AT_accessibility(DW_ACCESS_public)
    8974                      .dwattr $C$DW$481, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/spll/spl
    8975                      .dwattr $C$DW$481, DW_AT_decl_line(0x42)
    8976                      .dwattr $C$DW$481, DW_AT_decl_column(0x0f)
    8977              
    8978              $C$DW$482       .dwtag  DW_TAG_member
    8979                      .dwattr $C$DW$482, DW_AT_type(*$C$DW$T$19)
    8980                      .dwattr $C$DW$482, DW_AT_name("osg_y")
    8981                      .dwattr $C$DW$482, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    8982                      .dwattr $C$DW$482, DW_AT_accessibility(DW_ACCESS_public)
    8983                      .dwattr $C$DW$482, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/spll/spl
    8984                      .dwattr $C$DW$482, DW_AT_decl_line(0x43)
    8985                      .dwattr $C$DW$482, DW_AT_decl_column(0x0f)
    8986              
    8987              $C$DW$483       .dwtag  DW_TAG_member
    8988                      .dwattr $C$DW$483, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v22.6.0 Tue Dec 20 15:55:15 2022

Copyright (c) 1996-2018 Texas Instruments Incorporated
obc_7_4kw_main.asm                                                   PAGE  191

    8989                      .dwattr $C$DW$483, DW_AT_name("osg_b0")
    8990                      .dwattr $C$DW$483, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    8991                      .dwattr $C$DW$483, DW_AT_accessibility(DW_ACCESS_public)
    8992                      .dwattr $C$DW$483, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/spll/spl
    8993                      .dwattr $C$DW$483, DW_AT_decl_line(0x44)
    8994                      .dwattr $C$DW$483, DW_AT_decl_column(0x0f)
    8995              
    8996              $C$DW$484       .dwtag  DW_TAG_member
    8997                      .dwattr $C$DW$484, DW_AT_type(*$C$DW$T$19)
    8998                      .dwattr $C$DW$484, DW_AT_name("osg_b2")
    8999                      .dwattr $C$DW$484, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    9000                      .dwattr $C$DW$484, DW_AT_accessibility(DW_ACCESS_public)
    9001                      .dwattr $C$DW$484, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/spll/spl
    9002                      .dwattr $C$DW$484, DW_AT_decl_line(0x45)
    9003                      .dwattr $C$DW$484, DW_AT_decl_column(0x0f)
    9004              
    9005              $C$DW$485       .dwtag  DW_TAG_member
    9006                      .dwattr $C$DW$485, DW_AT_type(*$C$DW$T$19)
    9007                      .dwattr $C$DW$485, DW_AT_name("osg_a1")
    9008                      .dwattr $C$DW$485, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    9009                      .dwattr $C$DW$485, DW_AT_accessibility(DW_ACCESS_public)
    9010                      .dwattr $C$DW$485, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/spll/spl
    9011                      .dwattr $C$DW$485, DW_AT_decl_line(0x46)
    9012                      .dwattr $C$DW$485, DW_AT_decl_column(0x0f)
    9013              
    9014              $C$DW$486       .dwtag  DW_TAG_member
    9015                      .dwattr $C$DW$486, DW_AT_type(*$C$DW$T$19)
    9016                      .dwattr $C$DW$486, DW_AT_name("osg_a2")
    9017                      .dwattr $C$DW$486, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    9018                      .dwattr $C$DW$486, DW_AT_accessibility(DW_ACCESS_public)
    9019                      .dwattr $C$DW$486, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/spll/spl
    9020                      .dwattr $C$DW$486, DW_AT_decl_line(0x47)
    9021                      .dwattr $C$DW$486, DW_AT_decl_column(0x0f)
    9022              
    9023              $C$DW$487       .dwtag  DW_TAG_member
    9024                      .dwattr $C$DW$487, DW_AT_type(*$C$DW$T$19)
    9025                      .dwattr $C$DW$487, DW_AT_name("osg_qb0")
    9026                      .dwattr $C$DW$487, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    9027                      .dwattr $C$DW$487, DW_AT_accessibility(DW_ACCESS_public)
    9028                      .dwattr $C$DW$487, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/spll/spl
    9029                      .dwattr $C$DW$487, DW_AT_decl_line(0x48)
    9030                      .dwattr $C$DW$487, DW_AT_decl_column(0x0f)
    9031              
    9032              $C$DW$488       .dwtag  DW_TAG_member
    9033                      .dwattr $C$DW$488, DW_AT_type(*$C$DW$T$19)
    9034                      .dwattr $C$DW$488, DW_AT_name("osg_qb1")
    9035                      .dwattr $C$DW$488, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    9036                      .dwattr $C$DW$488, DW_AT_accessibility(DW_ACCESS_public)
    9037                      .dwattr $C$DW$488, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/spll/spl
    9038                      .dwattr $C$DW$488, DW_AT_decl_line(0x49)
    9039                      .dwattr $C$DW$488, DW_AT_decl_column(0x0f)
    9040              
    9041              $C$DW$489       .dwtag  DW_TAG_member
    9042                      .dwattr $C$DW$489, DW_AT_type(*$C$DW$T$19)
    9043                      .dwattr $C$DW$489, DW_AT_name("osg_qb2")
TMS320C2000 Assembler PC v22.6.0 Tue Dec 20 15:55:15 2022

Copyright (c) 1996-2018 Texas Instruments Incorporated
obc_7_4kw_main.asm                                                   PAGE  192

    9044                      .dwattr $C$DW$489, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    9045                      .dwattr $C$DW$489, DW_AT_accessibility(DW_ACCESS_public)
    9046                      .dwattr $C$DW$489, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/spll/spl
    9047                      .dwattr $C$DW$489, DW_AT_decl_line(0x4a)
    9048                      .dwattr $C$DW$489, DW_AT_decl_column(0x0f)
    9049              
    9050                      .dwattr $C$DW$T$24, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/spll/sp
    9051                      .dwattr $C$DW$T$24, DW_AT_decl_line(0x40)
    9052                      .dwattr $C$DW$T$24, DW_AT_decl_column(0x0f)
    9053                      .dwendtag $C$DW$T$24
    9054              
    9055                      .dwendtag $C$DW$TU$24
    9056              
    9057              
    9058              $C$DW$TU$28     .dwtag  DW_TAG_type_unit
    9059                      .dwmtype  $C$DW$T$28
    9060              $C$DW$T$28      .dwtag  DW_TAG_typedef
    9061                      .dwattr $C$DW$T$28, DW_AT_name("SPLL_1PH_SOGI_OSG_COEFF")
    9062                      .dwattr $C$DW$T$28, DW_AT_type(*$C$DW$T$24)
    9063                      .dwattr $C$DW$T$28, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/spll/sp
    9064                      .dwattr $C$DW$T$28, DW_AT_decl_line(0x4b)
    9065                      .dwattr $C$DW$T$28, DW_AT_decl_column(0x03)
    9066              
    9067                      .dwendtag $C$DW$TU$28
    9068              
    9069              
    9070              $C$DW$TU$25     .dwtag  DW_TAG_type_unit
    9071                      .dwmtype  $C$DW$T$25
    9072              
    9073              $C$DW$T$25      .dwtag  DW_TAG_structure_type
    9074                      .dwattr $C$DW$T$25, DW_AT_byte_size(0x04)
    9075              $C$DW$490       .dwtag  DW_TAG_member
    9076                      .dwattr $C$DW$490, DW_AT_type(*$C$DW$T$19)
    9077                      .dwattr $C$DW$490, DW_AT_name("b1")
    9078                      .dwattr $C$DW$490, DW_AT_accessibility(DW_ACCESS_public)
    9079                      .dwattr $C$DW$490, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/spll/spl
    9080                      .dwattr $C$DW$490, DW_AT_decl_line(0x50)
    9081                      .dwattr $C$DW$490, DW_AT_decl_column(0x0f)
    9082              
    9083              $C$DW$491       .dwtag  DW_TAG_member
    9084                      .dwattr $C$DW$491, DW_AT_type(*$C$DW$T$19)
    9085                      .dwattr $C$DW$491, DW_AT_name("b0")
    9086                      .dwattr $C$DW$491, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    9087                      .dwattr $C$DW$491, DW_AT_accessibility(DW_ACCESS_public)
    9088                      .dwattr $C$DW$491, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/spll/spl
    9089                      .dwattr $C$DW$491, DW_AT_decl_line(0x51)
    9090                      .dwattr $C$DW$491, DW_AT_decl_column(0x0f)
    9091              
    9092                      .dwattr $C$DW$T$25, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/spll/sp
    9093                      .dwattr $C$DW$T$25, DW_AT_decl_line(0x4f)
    9094                      .dwattr $C$DW$T$25, DW_AT_decl_column(0x0f)
    9095                      .dwendtag $C$DW$T$25
    9096              
    9097                      .dwendtag $C$DW$TU$25
    9098              
TMS320C2000 Assembler PC v22.6.0 Tue Dec 20 15:55:15 2022

Copyright (c) 1996-2018 Texas Instruments Incorporated
obc_7_4kw_main.asm                                                   PAGE  193

    9099              
    9100              $C$DW$TU$29     .dwtag  DW_TAG_type_unit
    9101                      .dwmtype  $C$DW$T$29
    9102              $C$DW$T$29      .dwtag  DW_TAG_typedef
    9103                      .dwattr $C$DW$T$29, DW_AT_name("SPLL_1PH_SOGI_LPF_COEFF")
    9104                      .dwattr $C$DW$T$29, DW_AT_type(*$C$DW$T$25)
    9105                      .dwattr $C$DW$T$29, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/spll/sp
    9106                      .dwattr $C$DW$T$29, DW_AT_decl_line(0x52)
    9107                      .dwattr $C$DW$T$29, DW_AT_decl_column(0x03)
    9108              
    9109                      .dwendtag $C$DW$TU$29
    9110              
    9111              
    9112              $C$DW$TU$30     .dwtag  DW_TAG_type_unit
    9113                      .dwmtype  $C$DW$T$30
    9114              
    9115              $C$DW$T$30      .dwtag  DW_TAG_structure_type
    9116                      .dwattr $C$DW$T$30, DW_AT_byte_size(0x42)
    9117              $C$DW$492       .dwtag  DW_TAG_member
    9118                      .dwattr $C$DW$492, DW_AT_type(*$C$DW$T$26)
    9119                      .dwattr $C$DW$492, DW_AT_name("u")
    9120                      .dwattr $C$DW$492, DW_AT_accessibility(DW_ACCESS_public)
    9121                      .dwattr $C$DW$492, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/spll/spl
    9122                      .dwattr $C$DW$492, DW_AT_decl_line(0x5c)
    9123                      .dwattr $C$DW$492, DW_AT_decl_column(0x11)
    9124              
    9125              $C$DW$493       .dwtag  DW_TAG_member
    9126                      .dwattr $C$DW$493, DW_AT_type(*$C$DW$T$26)
    9127                      .dwattr $C$DW$493, DW_AT_name("osg_u")
    9128                      .dwattr $C$DW$493, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    9129                      .dwattr $C$DW$493, DW_AT_accessibility(DW_ACCESS_public)
    9130                      .dwattr $C$DW$493, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/spll/spl
    9131                      .dwattr $C$DW$493, DW_AT_decl_line(0x5d)
    9132                      .dwattr $C$DW$493, DW_AT_decl_column(0x11)
    9133              
    9134              $C$DW$494       .dwtag  DW_TAG_member
    9135                      .dwattr $C$DW$494, DW_AT_type(*$C$DW$T$26)
    9136                      .dwattr $C$DW$494, DW_AT_name("osg_qu")
    9137                      .dwattr $C$DW$494, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    9138                      .dwattr $C$DW$494, DW_AT_accessibility(DW_ACCESS_public)
    9139                      .dwattr $C$DW$494, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/spll/spl
    9140                      .dwattr $C$DW$494, DW_AT_decl_line(0x5e)
    9141                      .dwattr $C$DW$494, DW_AT_decl_column(0x11)
    9142              
    9143              $C$DW$495       .dwtag  DW_TAG_member
    9144                      .dwattr $C$DW$495, DW_AT_type(*$C$DW$T$27)
    9145                      .dwattr $C$DW$495, DW_AT_name("u_Q")
    9146                      .dwattr $C$DW$495, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    9147                      .dwattr $C$DW$495, DW_AT_accessibility(DW_ACCESS_public)
    9148                      .dwattr $C$DW$495, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/spll/spl
    9149                      .dwattr $C$DW$495, DW_AT_decl_line(0x5f)
    9150                      .dwattr $C$DW$495, DW_AT_decl_column(0x11)
    9151              
    9152              $C$DW$496       .dwtag  DW_TAG_member
    9153                      .dwattr $C$DW$496, DW_AT_type(*$C$DW$T$27)
TMS320C2000 Assembler PC v22.6.0 Tue Dec 20 15:55:15 2022

Copyright (c) 1996-2018 Texas Instruments Incorporated
obc_7_4kw_main.asm                                                   PAGE  194

    9154                      .dwattr $C$DW$496, DW_AT_name("u_D")
    9155                      .dwattr $C$DW$496, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    9156                      .dwattr $C$DW$496, DW_AT_accessibility(DW_ACCESS_public)
    9157                      .dwattr $C$DW$496, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/spll/spl
    9158                      .dwattr $C$DW$496, DW_AT_decl_line(0x60)
    9159                      .dwattr $C$DW$496, DW_AT_decl_column(0x11)
    9160              
    9161              $C$DW$497       .dwtag  DW_TAG_member
    9162                      .dwattr $C$DW$497, DW_AT_type(*$C$DW$T$27)
    9163                      .dwattr $C$DW$497, DW_AT_name("ylf")
    9164                      .dwattr $C$DW$497, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    9165                      .dwattr $C$DW$497, DW_AT_accessibility(DW_ACCESS_public)
    9166                      .dwattr $C$DW$497, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/spll/spl
    9167                      .dwattr $C$DW$497, DW_AT_decl_line(0x61)
    9168                      .dwattr $C$DW$497, DW_AT_decl_column(0x11)
    9169              
    9170              $C$DW$498       .dwtag  DW_TAG_member
    9171                      .dwattr $C$DW$498, DW_AT_type(*$C$DW$T$19)
    9172                      .dwattr $C$DW$498, DW_AT_name("fo")
    9173                      .dwattr $C$DW$498, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    9174                      .dwattr $C$DW$498, DW_AT_accessibility(DW_ACCESS_public)
    9175                      .dwattr $C$DW$498, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/spll/spl
    9176                      .dwattr $C$DW$498, DW_AT_decl_line(0x62)
    9177                      .dwattr $C$DW$498, DW_AT_decl_column(0x11)
    9178              
    9179              $C$DW$499       .dwtag  DW_TAG_member
    9180                      .dwattr $C$DW$499, DW_AT_type(*$C$DW$T$19)
    9181                      .dwattr $C$DW$499, DW_AT_name("fn")
    9182                      .dwattr $C$DW$499, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    9183                      .dwattr $C$DW$499, DW_AT_accessibility(DW_ACCESS_public)
    9184                      .dwattr $C$DW$499, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/spll/spl
    9185                      .dwattr $C$DW$499, DW_AT_decl_line(0x63)
    9186                      .dwattr $C$DW$499, DW_AT_decl_column(0x11)
    9187              
    9188              $C$DW$500       .dwtag  DW_TAG_member
    9189                      .dwattr $C$DW$500, DW_AT_type(*$C$DW$T$19)
    9190                      .dwattr $C$DW$500, DW_AT_name("theta")
    9191                      .dwattr $C$DW$500, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    9192                      .dwattr $C$DW$500, DW_AT_accessibility(DW_ACCESS_public)
    9193                      .dwattr $C$DW$500, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/spll/spl
    9194                      .dwattr $C$DW$500, DW_AT_decl_line(0x64)
    9195                      .dwattr $C$DW$500, DW_AT_decl_column(0x11)
    9196              
    9197              $C$DW$501       .dwtag  DW_TAG_member
    9198                      .dwattr $C$DW$501, DW_AT_type(*$C$DW$T$19)
    9199                      .dwattr $C$DW$501, DW_AT_name("cosine")
    9200                      .dwattr $C$DW$501, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    9201                      .dwattr $C$DW$501, DW_AT_accessibility(DW_ACCESS_public)
    9202                      .dwattr $C$DW$501, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/spll/spl
    9203                      .dwattr $C$DW$501, DW_AT_decl_line(0x65)
    9204                      .dwattr $C$DW$501, DW_AT_decl_column(0x11)
    9205              
    9206              $C$DW$502       .dwtag  DW_TAG_member
    9207                      .dwattr $C$DW$502, DW_AT_type(*$C$DW$T$19)
    9208                      .dwattr $C$DW$502, DW_AT_name("sine")
TMS320C2000 Assembler PC v22.6.0 Tue Dec 20 15:55:15 2022

Copyright (c) 1996-2018 Texas Instruments Incorporated
obc_7_4kw_main.asm                                                   PAGE  195

    9209                      .dwattr $C$DW$502, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
    9210                      .dwattr $C$DW$502, DW_AT_accessibility(DW_ACCESS_public)
    9211                      .dwattr $C$DW$502, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/spll/spl
    9212                      .dwattr $C$DW$502, DW_AT_decl_line(0x66)
    9213                      .dwattr $C$DW$502, DW_AT_decl_column(0x11)
    9214              
    9215              $C$DW$503       .dwtag  DW_TAG_member
    9216                      .dwattr $C$DW$503, DW_AT_type(*$C$DW$T$19)
    9217                      .dwattr $C$DW$503, DW_AT_name("delta_t")
    9218                      .dwattr $C$DW$503, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    9219                      .dwattr $C$DW$503, DW_AT_accessibility(DW_ACCESS_public)
    9220                      .dwattr $C$DW$503, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/spll/spl
    9221                      .dwattr $C$DW$503, DW_AT_decl_line(0x67)
    9222                      .dwattr $C$DW$503, DW_AT_decl_column(0x11)
    9223              
    9224              $C$DW$504       .dwtag  DW_TAG_member
    9225                      .dwattr $C$DW$504, DW_AT_type(*$C$DW$T$28)
    9226                      .dwattr $C$DW$504, DW_AT_name("osg_coeff")
    9227                      .dwattr $C$DW$504, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
    9228                      .dwattr $C$DW$504, DW_AT_accessibility(DW_ACCESS_public)
    9229                      .dwattr $C$DW$504, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/spll/spl
    9230                      .dwattr $C$DW$504, DW_AT_decl_line(0x68)
    9231                      .dwattr $C$DW$504, DW_AT_decl_column(0x1d)
    9232              
    9233              $C$DW$505       .dwtag  DW_TAG_member
    9234                      .dwattr $C$DW$505, DW_AT_type(*$C$DW$T$29)
    9235                      .dwattr $C$DW$505, DW_AT_name("lpf_coeff")
    9236                      .dwattr $C$DW$505, DW_AT_data_member_location[DW_OP_plus_uconst 0x3e]
    9237                      .dwattr $C$DW$505, DW_AT_accessibility(DW_ACCESS_public)
    9238                      .dwattr $C$DW$505, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/spll/spl
    9239                      .dwattr $C$DW$505, DW_AT_decl_line(0x69)
    9240                      .dwattr $C$DW$505, DW_AT_decl_column(0x1d)
    9241              
    9242                      .dwattr $C$DW$T$30, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/spll/sp
    9243                      .dwattr $C$DW$T$30, DW_AT_decl_line(0x5b)
    9244                      .dwattr $C$DW$T$30, DW_AT_decl_column(0x0f)
    9245                      .dwendtag $C$DW$T$30
    9246              
    9247                      .dwendtag $C$DW$TU$30
    9248              
    9249              
    9250              $C$DW$TU$76     .dwtag  DW_TAG_type_unit
    9251                      .dwmtype  $C$DW$T$76
    9252              $C$DW$T$76      .dwtag  DW_TAG_typedef
    9253                      .dwattr $C$DW$T$76, DW_AT_name("SPLL_1PH_SOGI")
    9254                      .dwattr $C$DW$T$76, DW_AT_type(*$C$DW$T$30)
    9255                      .dwattr $C$DW$T$76, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/spll/sp
    9256                      .dwattr $C$DW$T$76, DW_AT_decl_line(0x6a)
    9257                      .dwattr $C$DW$T$76, DW_AT_decl_column(0x03)
    9258              
    9259                      .dwendtag $C$DW$TU$76
    9260              
    9261              
    9262              $C$DW$TU$33     .dwtag  DW_TAG_type_unit
    9263                      .dwmtype  $C$DW$T$33
TMS320C2000 Assembler PC v22.6.0 Tue Dec 20 15:55:15 2022

Copyright (c) 1996-2018 Texas Instruments Incorporated
obc_7_4kw_main.asm                                                   PAGE  196

    9264              
    9265              $C$DW$T$33      .dwtag  DW_TAG_structure_type
    9266                      .dwattr $C$DW$T$33, DW_AT_byte_size(0x40)
    9267              $C$DW$506       .dwtag  DW_TAG_member
    9268                      .dwattr $C$DW$506, DW_AT_type(*$C$DW$T$19)
    9269                      .dwattr $C$DW$506, DW_AT_name("v")
    9270                      .dwattr $C$DW$506, DW_AT_accessibility(DW_ACCESS_public)
    9271                      .dwattr $C$DW$506, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/power_me
    9272                      .dwattr $C$DW$506, DW_AT_decl_line(0x42)
    9273                      .dwattr $C$DW$506, DW_AT_decl_column(0x0f)
    9274              
    9275              $C$DW$507       .dwtag  DW_TAG_member
    9276                      .dwattr $C$DW$507, DW_AT_type(*$C$DW$T$19)
    9277                      .dwattr $C$DW$507, DW_AT_name("i")
    9278                      .dwattr $C$DW$507, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    9279                      .dwattr $C$DW$507, DW_AT_accessibility(DW_ACCESS_public)
    9280                      .dwattr $C$DW$507, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/power_me
    9281                      .dwattr $C$DW$507, DW_AT_decl_line(0x43)
    9282                      .dwattr $C$DW$507, DW_AT_decl_column(0x0f)
    9283              
    9284              $C$DW$508       .dwtag  DW_TAG_member
    9285                      .dwattr $C$DW$508, DW_AT_type(*$C$DW$T$19)
    9286                      .dwattr $C$DW$508, DW_AT_name("sampleFreq")
    9287                      .dwattr $C$DW$508, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    9288                      .dwattr $C$DW$508, DW_AT_accessibility(DW_ACCESS_public)
    9289                      .dwattr $C$DW$508, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/power_me
    9290                      .dwattr $C$DW$508, DW_AT_decl_line(0x44)
    9291                      .dwattr $C$DW$508, DW_AT_decl_column(0x0f)
    9292              
    9293              $C$DW$509       .dwtag  DW_TAG_member
    9294                      .dwattr $C$DW$509, DW_AT_type(*$C$DW$T$19)
    9295                      .dwattr $C$DW$509, DW_AT_name("threshold")
    9296                      .dwattr $C$DW$509, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    9297                      .dwattr $C$DW$509, DW_AT_accessibility(DW_ACCESS_public)
    9298                      .dwattr $C$DW$509, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/power_me
    9299                      .dwattr $C$DW$509, DW_AT_decl_line(0x45)
    9300                      .dwattr $C$DW$509, DW_AT_decl_column(0x0f)
    9301              
    9302              $C$DW$510       .dwtag  DW_TAG_member
    9303                      .dwattr $C$DW$510, DW_AT_type(*$C$DW$T$19)
    9304                      .dwattr $C$DW$510, DW_AT_name("vRms")
    9305                      .dwattr $C$DW$510, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    9306                      .dwattr $C$DW$510, DW_AT_accessibility(DW_ACCESS_public)
    9307                      .dwattr $C$DW$510, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/power_me
    9308                      .dwattr $C$DW$510, DW_AT_decl_line(0x46)
    9309                      .dwattr $C$DW$510, DW_AT_decl_column(0x0f)
    9310              
    9311              $C$DW$511       .dwtag  DW_TAG_member
    9312                      .dwattr $C$DW$511, DW_AT_type(*$C$DW$T$19)
    9313                      .dwattr $C$DW$511, DW_AT_name("vAvg")
    9314                      .dwattr $C$DW$511, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    9315                      .dwattr $C$DW$511, DW_AT_accessibility(DW_ACCESS_public)
    9316                      .dwattr $C$DW$511, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/power_me
    9317                      .dwattr $C$DW$511, DW_AT_decl_line(0x47)
    9318                      .dwattr $C$DW$511, DW_AT_decl_column(0x0f)
TMS320C2000 Assembler PC v22.6.0 Tue Dec 20 15:55:15 2022

Copyright (c) 1996-2018 Texas Instruments Incorporated
obc_7_4kw_main.asm                                                   PAGE  197

    9319              
    9320              $C$DW$512       .dwtag  DW_TAG_member
    9321                      .dwattr $C$DW$512, DW_AT_type(*$C$DW$T$19)
    9322                      .dwattr $C$DW$512, DW_AT_name("vEma")
    9323                      .dwattr $C$DW$512, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    9324                      .dwattr $C$DW$512, DW_AT_accessibility(DW_ACCESS_public)
    9325                      .dwattr $C$DW$512, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/power_me
    9326                      .dwattr $C$DW$512, DW_AT_decl_line(0x48)
    9327                      .dwattr $C$DW$512, DW_AT_decl_column(0x0f)
    9328              
    9329              $C$DW$513       .dwtag  DW_TAG_member
    9330                      .dwattr $C$DW$513, DW_AT_type(*$C$DW$T$19)
    9331                      .dwattr $C$DW$513, DW_AT_name("acFreq")
    9332                      .dwattr $C$DW$513, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    9333                      .dwattr $C$DW$513, DW_AT_accessibility(DW_ACCESS_public)
    9334                      .dwattr $C$DW$513, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/power_me
    9335                      .dwattr $C$DW$513, DW_AT_decl_line(0x49)
    9336                      .dwattr $C$DW$513, DW_AT_decl_column(0x0f)
    9337              
    9338              $C$DW$514       .dwtag  DW_TAG_member
    9339                      .dwattr $C$DW$514, DW_AT_type(*$C$DW$T$19)
    9340                      .dwattr $C$DW$514, DW_AT_name("acFreqAvg")
    9341                      .dwattr $C$DW$514, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    9342                      .dwattr $C$DW$514, DW_AT_accessibility(DW_ACCESS_public)
    9343                      .dwattr $C$DW$514, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/power_me
    9344                      .dwattr $C$DW$514, DW_AT_decl_line(0x4a)
    9345                      .dwattr $C$DW$514, DW_AT_decl_column(0x0f)
    9346              
    9347              $C$DW$515       .dwtag  DW_TAG_member
    9348                      .dwattr $C$DW$515, DW_AT_type(*$C$DW$T$19)
    9349                      .dwattr $C$DW$515, DW_AT_name("iRms")
    9350                      .dwattr $C$DW$515, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    9351                      .dwattr $C$DW$515, DW_AT_accessibility(DW_ACCESS_public)
    9352                      .dwattr $C$DW$515, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/power_me
    9353                      .dwattr $C$DW$515, DW_AT_decl_line(0x4b)
    9354                      .dwattr $C$DW$515, DW_AT_decl_column(0x0f)
    9355              
    9356              $C$DW$516       .dwtag  DW_TAG_member
    9357                      .dwattr $C$DW$516, DW_AT_type(*$C$DW$T$19)
    9358                      .dwattr $C$DW$516, DW_AT_name("pRms")
    9359                      .dwattr $C$DW$516, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    9360                      .dwattr $C$DW$516, DW_AT_accessibility(DW_ACCESS_public)
    9361                      .dwattr $C$DW$516, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/power_me
    9362                      .dwattr $C$DW$516, DW_AT_decl_line(0x4c)
    9363                      .dwattr $C$DW$516, DW_AT_decl_column(0x0f)
    9364              
    9365              $C$DW$517       .dwtag  DW_TAG_member
    9366                      .dwattr $C$DW$517, DW_AT_type(*$C$DW$T$19)
    9367                      .dwattr $C$DW$517, DW_AT_name("vaRms")
    9368                      .dwattr $C$DW$517, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    9369                      .dwattr $C$DW$517, DW_AT_accessibility(DW_ACCESS_public)
    9370                      .dwattr $C$DW$517, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/power_me
    9371                      .dwattr $C$DW$517, DW_AT_decl_line(0x4d)
    9372                      .dwattr $C$DW$517, DW_AT_decl_column(0x0f)
    9373              
TMS320C2000 Assembler PC v22.6.0 Tue Dec 20 15:55:15 2022

Copyright (c) 1996-2018 Texas Instruments Incorporated
obc_7_4kw_main.asm                                                   PAGE  198

    9374              $C$DW$518       .dwtag  DW_TAG_member
    9375                      .dwattr $C$DW$518, DW_AT_type(*$C$DW$T$19)
    9376                      .dwattr $C$DW$518, DW_AT_name("powerFactor")
    9377                      .dwattr $C$DW$518, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    9378                      .dwattr $C$DW$518, DW_AT_accessibility(DW_ACCESS_public)
    9379                      .dwattr $C$DW$518, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/power_me
    9380                      .dwattr $C$DW$518, DW_AT_decl_line(0x4e)
    9381                      .dwattr $C$DW$518, DW_AT_decl_column(0x0f)
    9382              
    9383              $C$DW$519       .dwtag  DW_TAG_member
    9384                      .dwattr $C$DW$519, DW_AT_type(*$C$DW$T$22)
    9385                      .dwattr $C$DW$519, DW_AT_name("zcd")
    9386                      .dwattr $C$DW$519, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    9387                      .dwattr $C$DW$519, DW_AT_accessibility(DW_ACCESS_public)
    9388                      .dwattr $C$DW$519, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/power_me
    9389                      .dwattr $C$DW$519, DW_AT_decl_line(0x4f)
    9390                      .dwattr $C$DW$519, DW_AT_decl_column(0x0e)
    9391              
    9392              $C$DW$520       .dwtag  DW_TAG_member
    9393                      .dwattr $C$DW$520, DW_AT_type(*$C$DW$T$19)
    9394                      .dwattr $C$DW$520, DW_AT_name("vSum")
    9395                      .dwattr $C$DW$520, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    9396                      .dwattr $C$DW$520, DW_AT_accessibility(DW_ACCESS_public)
    9397                      .dwattr $C$DW$520, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/power_me
    9398                      .dwattr $C$DW$520, DW_AT_decl_line(0x51)
    9399                      .dwattr $C$DW$520, DW_AT_decl_column(0x0f)
    9400              
    9401              $C$DW$521       .dwtag  DW_TAG_member
    9402                      .dwattr $C$DW$521, DW_AT_type(*$C$DW$T$19)
    9403                      .dwattr $C$DW$521, DW_AT_name("vSqrSum")
    9404                      .dwattr $C$DW$521, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    9405                      .dwattr $C$DW$521, DW_AT_accessibility(DW_ACCESS_public)
    9406                      .dwattr $C$DW$521, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/power_me
    9407                      .dwattr $C$DW$521, DW_AT_decl_line(0x52)
    9408                      .dwattr $C$DW$521, DW_AT_decl_column(0x0f)
    9409              
    9410              $C$DW$522       .dwtag  DW_TAG_member
    9411                      .dwattr $C$DW$522, DW_AT_type(*$C$DW$T$19)
    9412                      .dwattr $C$DW$522, DW_AT_name("iSqrSum")
    9413                      .dwattr $C$DW$522, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    9414                      .dwattr $C$DW$522, DW_AT_accessibility(DW_ACCESS_public)
    9415                      .dwattr $C$DW$522, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/power_me
    9416                      .dwattr $C$DW$522, DW_AT_decl_line(0x53)
    9417                      .dwattr $C$DW$522, DW_AT_decl_column(0x0f)
    9418              
    9419              $C$DW$523       .dwtag  DW_TAG_member
    9420                      .dwattr $C$DW$523, DW_AT_type(*$C$DW$T$19)
    9421                      .dwattr $C$DW$523, DW_AT_name("acFreqSum")
    9422                      .dwattr $C$DW$523, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    9423                      .dwattr $C$DW$523, DW_AT_accessibility(DW_ACCESS_public)
    9424                      .dwattr $C$DW$523, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/power_me
    9425                      .dwattr $C$DW$523, DW_AT_decl_line(0x54)
    9426                      .dwattr $C$DW$523, DW_AT_decl_column(0x0f)
    9427              
    9428              $C$DW$524       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v22.6.0 Tue Dec 20 15:55:15 2022

Copyright (c) 1996-2018 Texas Instruments Incorporated
obc_7_4kw_main.asm                                                   PAGE  199

    9429                      .dwattr $C$DW$524, DW_AT_type(*$C$DW$T$19)
    9430                      .dwattr $C$DW$524, DW_AT_name("pSum")
    9431                      .dwattr $C$DW$524, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    9432                      .dwattr $C$DW$524, DW_AT_accessibility(DW_ACCESS_public)
    9433                      .dwattr $C$DW$524, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/power_me
    9434                      .dwattr $C$DW$524, DW_AT_decl_line(0x55)
    9435                      .dwattr $C$DW$524, DW_AT_decl_column(0x0f)
    9436              
    9437              $C$DW$525       .dwtag  DW_TAG_member
    9438                      .dwattr $C$DW$525, DW_AT_type(*$C$DW$T$19)
    9439                      .dwattr $C$DW$525, DW_AT_name("vaSumMul")
    9440                      .dwattr $C$DW$525, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
    9441                      .dwattr $C$DW$525, DW_AT_accessibility(DW_ACCESS_public)
    9442                      .dwattr $C$DW$525, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/power_me
    9443                      .dwattr $C$DW$525, DW_AT_decl_line(0x56)
    9444                      .dwattr $C$DW$525, DW_AT_decl_column(0x0f)
    9445              
    9446              $C$DW$526       .dwtag  DW_TAG_member
    9447                      .dwattr $C$DW$526, DW_AT_type(*$C$DW$T$19)
    9448                      .dwattr $C$DW$526, DW_AT_name("vNorm")
    9449                      .dwattr $C$DW$526, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    9450                      .dwattr $C$DW$526, DW_AT_accessibility(DW_ACCESS_public)
    9451                      .dwattr $C$DW$526, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/power_me
    9452                      .dwattr $C$DW$526, DW_AT_decl_line(0x57)
    9453                      .dwattr $C$DW$526, DW_AT_decl_column(0x0f)
    9454              
    9455              $C$DW$527       .dwtag  DW_TAG_member
    9456                      .dwattr $C$DW$527, DW_AT_type(*$C$DW$T$19)
    9457                      .dwattr $C$DW$527, DW_AT_name("iNorm")
    9458                      .dwattr $C$DW$527, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
    9459                      .dwattr $C$DW$527, DW_AT_accessibility(DW_ACCESS_public)
    9460                      .dwattr $C$DW$527, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/power_me
    9461                      .dwattr $C$DW$527, DW_AT_decl_line(0x58)
    9462                      .dwattr $C$DW$527, DW_AT_decl_column(0x0f)
    9463              
    9464              $C$DW$528       .dwtag  DW_TAG_member
    9465                      .dwattr $C$DW$528, DW_AT_type(*$C$DW$T$22)
    9466                      .dwattr $C$DW$528, DW_AT_name("prevSign")
    9467                      .dwattr $C$DW$528, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    9468                      .dwattr $C$DW$528, DW_AT_accessibility(DW_ACCESS_public)
    9469                      .dwattr $C$DW$528, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/power_me
    9470                      .dwattr $C$DW$528, DW_AT_decl_line(0x59)
    9471                      .dwattr $C$DW$528, DW_AT_decl_column(0x0e)
    9472              
    9473              $C$DW$529       .dwtag  DW_TAG_member
    9474                      .dwattr $C$DW$529, DW_AT_type(*$C$DW$T$22)
    9475                      .dwattr $C$DW$529, DW_AT_name("currSign")
    9476                      .dwattr $C$DW$529, DW_AT_data_member_location[DW_OP_plus_uconst 0x2d]
    9477                      .dwattr $C$DW$529, DW_AT_accessibility(DW_ACCESS_public)
    9478                      .dwattr $C$DW$529, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/power_me
    9479                      .dwattr $C$DW$529, DW_AT_decl_line(0x5a)
    9480                      .dwattr $C$DW$529, DW_AT_decl_column(0x0e)
    9481              
    9482              $C$DW$530       .dwtag  DW_TAG_member
    9483                      .dwattr $C$DW$530, DW_AT_type(*$C$DW$T$32)
TMS320C2000 Assembler PC v22.6.0 Tue Dec 20 15:55:15 2022

Copyright (c) 1996-2018 Texas Instruments Incorporated
obc_7_4kw_main.asm                                                   PAGE  200

    9484                      .dwattr $C$DW$530, DW_AT_name("nSamples")
    9485                      .dwattr $C$DW$530, DW_AT_data_member_location[DW_OP_plus_uconst 0x2e]
    9486                      .dwattr $C$DW$530, DW_AT_accessibility(DW_ACCESS_public)
    9487                      .dwattr $C$DW$530, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/power_me
    9488                      .dwattr $C$DW$530, DW_AT_decl_line(0x5b)
    9489                      .dwattr $C$DW$530, DW_AT_decl_column(0x0e)
    9490              
    9491              $C$DW$531       .dwtag  DW_TAG_member
    9492                      .dwattr $C$DW$531, DW_AT_type(*$C$DW$T$32)
    9493                      .dwattr $C$DW$531, DW_AT_name("nSamplesMin")
    9494                      .dwattr $C$DW$531, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    9495                      .dwattr $C$DW$531, DW_AT_accessibility(DW_ACCESS_public)
    9496                      .dwattr $C$DW$531, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/power_me
    9497                      .dwattr $C$DW$531, DW_AT_decl_line(0x5c)
    9498                      .dwattr $C$DW$531, DW_AT_decl_column(0x0e)
    9499              
    9500              $C$DW$532       .dwtag  DW_TAG_member
    9501                      .dwattr $C$DW$532, DW_AT_type(*$C$DW$T$32)
    9502                      .dwattr $C$DW$532, DW_AT_name("nSamplesMax")
    9503                      .dwattr $C$DW$532, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
    9504                      .dwattr $C$DW$532, DW_AT_accessibility(DW_ACCESS_public)
    9505                      .dwattr $C$DW$532, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/power_me
    9506                      .dwattr $C$DW$532, DW_AT_decl_line(0x5d)
    9507                      .dwattr $C$DW$532, DW_AT_decl_column(0x0e)
    9508              
    9509              $C$DW$533       .dwtag  DW_TAG_member
    9510                      .dwattr $C$DW$533, DW_AT_type(*$C$DW$T$19)
    9511                      .dwattr $C$DW$533, DW_AT_name("inverse_nSamples")
    9512                      .dwattr $C$DW$533, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    9513                      .dwattr $C$DW$533, DW_AT_accessibility(DW_ACCESS_public)
    9514                      .dwattr $C$DW$533, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/power_me
    9515                      .dwattr $C$DW$533, DW_AT_decl_line(0x5e)
    9516                      .dwattr $C$DW$533, DW_AT_decl_column(0x0f)
    9517              
    9518              $C$DW$534       .dwtag  DW_TAG_member
    9519                      .dwattr $C$DW$534, DW_AT_type(*$C$DW$T$19)
    9520                      .dwattr $C$DW$534, DW_AT_name("sqrt_inverse_nSamples")
    9521                      .dwattr $C$DW$534, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
    9522                      .dwattr $C$DW$534, DW_AT_accessibility(DW_ACCESS_public)
    9523                      .dwattr $C$DW$534, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/power_me
    9524                      .dwattr $C$DW$534, DW_AT_decl_line(0x5f)
    9525                      .dwattr $C$DW$534, DW_AT_decl_column(0x0f)
    9526              
    9527              $C$DW$535       .dwtag  DW_TAG_member
    9528                      .dwattr $C$DW$535, DW_AT_type(*$C$DW$T$22)
    9529                      .dwattr $C$DW$535, DW_AT_name("slewPowerUpdate")
    9530                      .dwattr $C$DW$535, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    9531                      .dwattr $C$DW$535, DW_AT_accessibility(DW_ACCESS_public)
    9532                      .dwattr $C$DW$535, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/power_me
    9533                      .dwattr $C$DW$535, DW_AT_decl_line(0x60)
    9534                      .dwattr $C$DW$535, DW_AT_decl_column(0x0e)
    9535              
    9536              $C$DW$536       .dwtag  DW_TAG_member
    9537                      .dwattr $C$DW$536, DW_AT_type(*$C$DW$T$19)
    9538                      .dwattr $C$DW$536, DW_AT_name("pRmsSumMul")
TMS320C2000 Assembler PC v22.6.0 Tue Dec 20 15:55:15 2022

Copyright (c) 1996-2018 Texas Instruments Incorporated
obc_7_4kw_main.asm                                                   PAGE  201

    9539                      .dwattr $C$DW$536, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a]
    9540                      .dwattr $C$DW$536, DW_AT_accessibility(DW_ACCESS_public)
    9541                      .dwattr $C$DW$536, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/power_me
    9542                      .dwattr $C$DW$536, DW_AT_decl_line(0x61)
    9543                      .dwattr $C$DW$536, DW_AT_decl_column(0x0f)
    9544              
    9545              $C$DW$537       .dwtag  DW_TAG_member
    9546                      .dwattr $C$DW$537, DW_AT_type(*$C$DW$T$22)
    9547                      .dwattr $C$DW$537, DW_AT_name("jitterCount")
    9548                      .dwattr $C$DW$537, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
    9549                      .dwattr $C$DW$537, DW_AT_accessibility(DW_ACCESS_public)
    9550                      .dwattr $C$DW$537, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/power_me
    9551                      .dwattr $C$DW$537, DW_AT_decl_line(0x62)
    9552                      .dwattr $C$DW$537, DW_AT_decl_column(0x0d)
    9553              
    9554              $C$DW$538       .dwtag  DW_TAG_member
    9555                      .dwattr $C$DW$538, DW_AT_type(*$C$DW$T$19)
    9556                      .dwattr $C$DW$538, DW_AT_name("emaFilterMultiplier")
    9557                      .dwattr $C$DW$538, DW_AT_data_member_location[DW_OP_plus_uconst 0x3e]
    9558                      .dwattr $C$DW$538, DW_AT_accessibility(DW_ACCESS_public)
    9559                      .dwattr $C$DW$538, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/power_me
    9560                      .dwattr $C$DW$538, DW_AT_decl_line(0x63)
    9561                      .dwattr $C$DW$538, DW_AT_decl_column(0x0f)
    9562              
    9563                      .dwattr $C$DW$T$33, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/power_m
    9564                      .dwattr $C$DW$T$33, DW_AT_decl_line(0x41)
    9565                      .dwattr $C$DW$T$33, DW_AT_decl_column(0x19)
    9566                      .dwendtag $C$DW$T$33
    9567              
    9568                      .dwendtag $C$DW$TU$33
    9569              
    9570              
    9571              $C$DW$TU$79     .dwtag  DW_TAG_type_unit
    9572                      .dwmtype  $C$DW$T$79
    9573              $C$DW$539       .dwtag  DW_TAG_TI_far_type
    9574                      .dwattr $C$DW$539, DW_AT_type(*$C$DW$T$33)
    9575              
    9576              $C$DW$T$79      .dwtag  DW_TAG_volatile_type
    9577                      .dwattr $C$DW$T$79, DW_AT_type(*$C$DW$539)
    9578              
    9579                      .dwendtag $C$DW$TU$79
    9580              
    9581              
    9582              $C$DW$TU$80     .dwtag  DW_TAG_type_unit
    9583                      .dwmtype  $C$DW$T$80
    9584              $C$DW$T$80      .dwtag  DW_TAG_typedef
    9585                      .dwattr $C$DW$T$80, DW_AT_name("POWER_MEAS_SINE_ANALYZER")
    9586                      .dwattr $C$DW$T$80, DW_AT_type(*$C$DW$T$79)
    9587                      .dwattr $C$DW$T$80, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/power_m
    9588                      .dwattr $C$DW$T$80, DW_AT_decl_line(0x64)
    9589                      .dwattr $C$DW$T$80, DW_AT_decl_column(0x03)
    9590              
    9591                      .dwendtag $C$DW$TU$80
    9592              
    9593              
TMS320C2000 Assembler PC v22.6.0 Tue Dec 20 15:55:15 2022

Copyright (c) 1996-2018 Texas Instruments Incorporated
obc_7_4kw_main.asm                                                   PAGE  202

    9594              $C$DW$TU$34     .dwtag  DW_TAG_type_unit
    9595                      .dwmtype  $C$DW$T$34
    9596              
    9597              $C$DW$T$34      .dwtag  DW_TAG_structure_type
    9598                      .dwattr $C$DW$T$34, DW_AT_byte_size(0x18)
    9599              $C$DW$540       .dwtag  DW_TAG_member
    9600                      .dwattr $C$DW$540, DW_AT_type(*$C$DW$T$19)
    9601                      .dwattr $C$DW$540, DW_AT_name("TTPLPFC_PH1_H_TEMP")
    9602                      .dwattr $C$DW$540, DW_AT_accessibility(DW_ACCESS_public)
    9603                      .dwattr $C$DW$540, DW_AT_decl_file("C:\Users\gerar\workspace_v12\7.4kW_OBC_F28003x\ttplpfc\ttplpfc_ha
    9604                      .dwattr $C$DW$540, DW_AT_decl_line(0x2d)
    9605                      .dwattr $C$DW$540, DW_AT_decl_column(0x13)
    9606              
    9607              $C$DW$541       .dwtag  DW_TAG_member
    9608                      .dwattr $C$DW$541, DW_AT_type(*$C$DW$T$19)
    9609                      .dwattr $C$DW$541, DW_AT_name("TTPLPFC_PH1_L_TEMP")
    9610                      .dwattr $C$DW$541, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    9611                      .dwattr $C$DW$541, DW_AT_accessibility(DW_ACCESS_public)
    9612                      .dwattr $C$DW$541, DW_AT_decl_file("C:\Users\gerar\workspace_v12\7.4kW_OBC_F28003x\ttplpfc\ttplpfc_ha
    9613                      .dwattr $C$DW$541, DW_AT_decl_line(0x2e)
    9614                      .dwattr $C$DW$541, DW_AT_decl_column(0x13)
    9615              
    9616              $C$DW$542       .dwtag  DW_TAG_member
    9617                      .dwattr $C$DW$542, DW_AT_type(*$C$DW$T$19)
    9618                      .dwattr $C$DW$542, DW_AT_name("TTPLPFC_PH2_L_TEMP")
    9619                      .dwattr $C$DW$542, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    9620                      .dwattr $C$DW$542, DW_AT_accessibility(DW_ACCESS_public)
    9621                      .dwattr $C$DW$542, DW_AT_decl_file("C:\Users\gerar\workspace_v12\7.4kW_OBC_F28003x\ttplpfc\ttplpfc_ha
    9622                      .dwattr $C$DW$542, DW_AT_decl_line(0x2f)
    9623                      .dwattr $C$DW$542, DW_AT_decl_column(0x13)
    9624              
    9625              $C$DW$543       .dwtag  DW_TAG_member
    9626                      .dwattr $C$DW$543, DW_AT_type(*$C$DW$T$19)
    9627                      .dwattr $C$DW$543, DW_AT_name("TTPLPFC_PH2_H_TEMP")
    9628                      .dwattr $C$DW$543, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    9629                      .dwattr $C$DW$543, DW_AT_accessibility(DW_ACCESS_public)
    9630                      .dwattr $C$DW$543, DW_AT_decl_file("C:\Users\gerar\workspace_v12\7.4kW_OBC_F28003x\ttplpfc\ttplpfc_ha
    9631                      .dwattr $C$DW$543, DW_AT_decl_line(0x30)
    9632                      .dwattr $C$DW$543, DW_AT_decl_column(0x13)
    9633              
    9634              $C$DW$544       .dwtag  DW_TAG_member
    9635                      .dwattr $C$DW$544, DW_AT_type(*$C$DW$T$19)
    9636                      .dwattr $C$DW$544, DW_AT_name("CLLLC_PRIM_LEG1_H_TEMP")
    9637                      .dwattr $C$DW$544, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    9638                      .dwattr $C$DW$544, DW_AT_accessibility(DW_ACCESS_public)
    9639                      .dwattr $C$DW$544, DW_AT_decl_file("C:\Users\gerar\workspace_v12\7.4kW_OBC_F28003x\ttplpfc\ttplpfc_ha
    9640                      .dwattr $C$DW$544, DW_AT_decl_line(0x31)
    9641                      .dwattr $C$DW$544, DW_AT_decl_column(0x13)
    9642              
    9643              $C$DW$545       .dwtag  DW_TAG_member
    9644                      .dwattr $C$DW$545, DW_AT_type(*$C$DW$T$19)
    9645                      .dwattr $C$DW$545, DW_AT_name("CLLLC_PRIM_LEG1_L_TEMP")
    9646                      .dwattr $C$DW$545, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    9647                      .dwattr $C$DW$545, DW_AT_accessibility(DW_ACCESS_public)
    9648                      .dwattr $C$DW$545, DW_AT_decl_file("C:\Users\gerar\workspace_v12\7.4kW_OBC_F28003x\ttplpfc\ttplpfc_ha
TMS320C2000 Assembler PC v22.6.0 Tue Dec 20 15:55:15 2022

Copyright (c) 1996-2018 Texas Instruments Incorporated
obc_7_4kw_main.asm                                                   PAGE  203

    9649                      .dwattr $C$DW$545, DW_AT_decl_line(0x32)
    9650                      .dwattr $C$DW$545, DW_AT_decl_column(0x13)
    9651              
    9652              $C$DW$546       .dwtag  DW_TAG_member
    9653                      .dwattr $C$DW$546, DW_AT_type(*$C$DW$T$19)
    9654                      .dwattr $C$DW$546, DW_AT_name("CLLLC_PRIM_LEG2_L_TEMP")
    9655                      .dwattr $C$DW$546, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    9656                      .dwattr $C$DW$546, DW_AT_accessibility(DW_ACCESS_public)
    9657                      .dwattr $C$DW$546, DW_AT_decl_file("C:\Users\gerar\workspace_v12\7.4kW_OBC_F28003x\ttplpfc\ttplpfc_ha
    9658                      .dwattr $C$DW$546, DW_AT_decl_line(0x33)
    9659                      .dwattr $C$DW$546, DW_AT_decl_column(0x13)
    9660              
    9661              $C$DW$547       .dwtag  DW_TAG_member
    9662                      .dwattr $C$DW$547, DW_AT_type(*$C$DW$T$19)
    9663                      .dwattr $C$DW$547, DW_AT_name("CLLLC_PRIM_LEG2_H_TEMP")
    9664                      .dwattr $C$DW$547, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    9665                      .dwattr $C$DW$547, DW_AT_accessibility(DW_ACCESS_public)
    9666                      .dwattr $C$DW$547, DW_AT_decl_file("C:\Users\gerar\workspace_v12\7.4kW_OBC_F28003x\ttplpfc\ttplpfc_ha
    9667                      .dwattr $C$DW$547, DW_AT_decl_line(0x34)
    9668                      .dwattr $C$DW$547, DW_AT_decl_column(0x13)
    9669              
    9670              $C$DW$548       .dwtag  DW_TAG_member
    9671                      .dwattr $C$DW$548, DW_AT_type(*$C$DW$T$19)
    9672                      .dwattr $C$DW$548, DW_AT_name("CLLLC_SEC_LEG1_H_TEMP")
    9673                      .dwattr $C$DW$548, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    9674                      .dwattr $C$DW$548, DW_AT_accessibility(DW_ACCESS_public)
    9675                      .dwattr $C$DW$548, DW_AT_decl_file("C:\Users\gerar\workspace_v12\7.4kW_OBC_F28003x\ttplpfc\ttplpfc_ha
    9676                      .dwattr $C$DW$548, DW_AT_decl_line(0x35)
    9677                      .dwattr $C$DW$548, DW_AT_decl_column(0x13)
    9678              
    9679              $C$DW$549       .dwtag  DW_TAG_member
    9680                      .dwattr $C$DW$549, DW_AT_type(*$C$DW$T$19)
    9681                      .dwattr $C$DW$549, DW_AT_name("CLLLC_SEC_LEG1_L_TEMP")
    9682                      .dwattr $C$DW$549, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    9683                      .dwattr $C$DW$549, DW_AT_accessibility(DW_ACCESS_public)
    9684                      .dwattr $C$DW$549, DW_AT_decl_file("C:\Users\gerar\workspace_v12\7.4kW_OBC_F28003x\ttplpfc\ttplpfc_ha
    9685                      .dwattr $C$DW$549, DW_AT_decl_line(0x36)
    9686                      .dwattr $C$DW$549, DW_AT_decl_column(0x13)
    9687              
    9688              $C$DW$550       .dwtag  DW_TAG_member
    9689                      .dwattr $C$DW$550, DW_AT_type(*$C$DW$T$19)
    9690                      .dwattr $C$DW$550, DW_AT_name("CLLLC_SEC_LEG2_L_TEMP")
    9691                      .dwattr $C$DW$550, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    9692                      .dwattr $C$DW$550, DW_AT_accessibility(DW_ACCESS_public)
    9693                      .dwattr $C$DW$550, DW_AT_decl_file("C:\Users\gerar\workspace_v12\7.4kW_OBC_F28003x\ttplpfc\ttplpfc_ha
    9694                      .dwattr $C$DW$550, DW_AT_decl_line(0x37)
    9695                      .dwattr $C$DW$550, DW_AT_decl_column(0x13)
    9696              
    9697              $C$DW$551       .dwtag  DW_TAG_member
    9698                      .dwattr $C$DW$551, DW_AT_type(*$C$DW$T$19)
    9699                      .dwattr $C$DW$551, DW_AT_name("CLLLC_SEC_LEG2_H_TEMP")
    9700                      .dwattr $C$DW$551, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    9701                      .dwattr $C$DW$551, DW_AT_accessibility(DW_ACCESS_public)
    9702                      .dwattr $C$DW$551, DW_AT_decl_file("C:\Users\gerar\workspace_v12\7.4kW_OBC_F28003x\ttplpfc\ttplpfc_ha
    9703                      .dwattr $C$DW$551, DW_AT_decl_line(0x38)
TMS320C2000 Assembler PC v22.6.0 Tue Dec 20 15:55:15 2022

Copyright (c) 1996-2018 Texas Instruments Incorporated
obc_7_4kw_main.asm                                                   PAGE  204

    9704                      .dwattr $C$DW$551, DW_AT_decl_column(0x13)
    9705              
    9706                      .dwattr $C$DW$T$34, DW_AT_decl_file("C:\Users\gerar\workspace_v12\7.4kW_OBC_F28003x\ttplpfc\ttplpfc_h
    9707                      .dwattr $C$DW$T$34, DW_AT_decl_line(0x2c)
    9708                      .dwattr $C$DW$T$34, DW_AT_decl_column(0x0c)
    9709                      .dwendtag $C$DW$T$34
    9710              
    9711                      .dwendtag $C$DW$TU$34
    9712              
    9713              
    9714              $C$DW$TU$36     .dwtag  DW_TAG_type_unit
    9715                      .dwmtype  $C$DW$T$36
    9716              
    9717              $C$DW$T$36      .dwtag  DW_TAG_union_type
    9718                      .dwattr $C$DW$T$36, DW_AT_byte_size(0x18)
    9719              $C$DW$552       .dwtag  DW_TAG_member
    9720                      .dwattr $C$DW$552, DW_AT_type(*$C$DW$T$34)
    9721                      .dwattr $C$DW$552, DW_AT_name("device")
    9722                      .dwattr $C$DW$552, DW_AT_accessibility(DW_ACCESS_public)
    9723                      .dwattr $C$DW$552, DW_AT_decl_file("C:\Users\gerar\workspace_v12\7.4kW_OBC_F28003x\ttplpfc\ttplpfc_ha
    9724                      .dwattr $C$DW$552, DW_AT_decl_line(0x39)
    9725                      .dwattr $C$DW$552, DW_AT_decl_column(0x07)
    9726              
    9727              $C$DW$553       .dwtag  DW_TAG_member
    9728                      .dwattr $C$DW$553, DW_AT_type(*$C$DW$T$35)
    9729                      .dwattr $C$DW$553, DW_AT_name("array")
    9730                      .dwattr $C$DW$553, DW_AT_accessibility(DW_ACCESS_public)
    9731                      .dwattr $C$DW$553, DW_AT_decl_file("C:\Users\gerar\workspace_v12\7.4kW_OBC_F28003x\ttplpfc\ttplpfc_ha
    9732                      .dwattr $C$DW$553, DW_AT_decl_line(0x3a)
    9733                      .dwattr $C$DW$553, DW_AT_decl_column(0x0f)
    9734              
    9735                      .dwattr $C$DW$T$36, DW_AT_decl_file("C:\Users\gerar\workspace_v12\7.4kW_OBC_F28003x\ttplpfc\ttplpfc_h
    9736                      .dwattr $C$DW$T$36, DW_AT_decl_line(0x2b)
    9737                      .dwattr $C$DW$T$36, DW_AT_decl_column(0x0f)
    9738                      .dwendtag $C$DW$T$36
    9739              
    9740                      .dwendtag $C$DW$TU$36
    9741              
    9742              
    9743              $C$DW$TU$82     .dwtag  DW_TAG_type_unit
    9744                      .dwmtype  $C$DW$T$82
    9745              $C$DW$T$82      .dwtag  DW_TAG_typedef
    9746                      .dwattr $C$DW$T$82, DW_AT_name("TTPLPFC_HAL_GaNTemp_Struct")
    9747                      .dwattr $C$DW$T$82, DW_AT_type(*$C$DW$T$36)
    9748                      .dwattr $C$DW$T$82, DW_AT_decl_file("C:\Users\gerar\workspace_v12\7.4kW_OBC_F28003x\ttplpfc\ttplpfc_h
    9749                      .dwattr $C$DW$T$82, DW_AT_decl_line(0x3b)
    9750                      .dwattr $C$DW$T$82, DW_AT_decl_column(0x03)
    9751              
    9752                      .dwendtag $C$DW$TU$82
    9753              
    9754              
    9755              $C$DW$TU$38     .dwtag  DW_TAG_type_unit
    9756                      .dwmtype  $C$DW$T$38
    9757              
    9758              $C$DW$T$38      .dwtag  DW_TAG_union_type
TMS320C2000 Assembler PC v22.6.0 Tue Dec 20 15:55:15 2022

Copyright (c) 1996-2018 Texas Instruments Incorporated
obc_7_4kw_main.asm                                                   PAGE  205

    9759                      .dwattr $C$DW$T$38, DW_AT_byte_size(0x02)
    9760              $C$DW$554       .dwtag  DW_TAG_member
    9761                      .dwattr $C$DW$554, DW_AT_type(*$C$DW$T$37)
    9762                      .dwattr $C$DW$554, DW_AT_name("enum_boardStatus")
    9763                      .dwattr $C$DW$554, DW_AT_accessibility(DW_ACCESS_public)
    9764                      .dwattr $C$DW$554, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/ttplpfc/ttplpfc.h"
    9765                      .dwattr $C$DW$554, DW_AT_decl_line(0xec)
    9766                      .dwattr $C$DW$554, DW_AT_decl_column(0x06)
    9767              
    9768              $C$DW$555       .dwtag  DW_TAG_member
    9769                      .dwattr $C$DW$555, DW_AT_type(*$C$DW$T$32)
    9770                      .dwattr $C$DW$555, DW_AT_name("pad")
    9771                      .dwattr $C$DW$555, DW_AT_accessibility(DW_ACCESS_public)
    9772                      .dwattr $C$DW$555, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/ttplpfc/ttplpfc.h"
    9773                      .dwattr $C$DW$555, DW_AT_decl_line(0xed)
    9774                      .dwattr $C$DW$555, DW_AT_decl_column(0x0d)
    9775              
    9776                      .dwattr $C$DW$T$38, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/ttplpfc/ttplpfc.h
    9777                      .dwattr $C$DW$T$38, DW_AT_decl_line(0xde)
    9778                      .dwattr $C$DW$T$38, DW_AT_decl_column(0x0e)
    9779                      .dwendtag $C$DW$T$38
    9780              
    9781                      .dwendtag $C$DW$TU$38
    9782              
    9783              
    9784              $C$DW$TU$84     .dwtag  DW_TAG_type_unit
    9785                      .dwmtype  $C$DW$T$84
    9786              $C$DW$T$84      .dwtag  DW_TAG_typedef
    9787                      .dwattr $C$DW$T$84, DW_AT_name("TTPLPFC_boardStatus")
    9788                      .dwattr $C$DW$T$84, DW_AT_type(*$C$DW$T$38)
    9789                      .dwattr $C$DW$T$84, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/ttplpfc/ttplpfc.h
    9790                      .dwattr $C$DW$T$84, DW_AT_decl_line(0xee)
    9791                      .dwattr $C$DW$T$84, DW_AT_decl_column(0x02)
    9792              
    9793                      .dwendtag $C$DW$TU$84
    9794              
    9795              
    9796              $C$DW$TU$40     .dwtag  DW_TAG_type_unit
    9797                      .dwmtype  $C$DW$T$40
    9798              
    9799              $C$DW$T$40      .dwtag  DW_TAG_union_type
    9800                      .dwattr $C$DW$T$40, DW_AT_byte_size(0x02)
    9801              $C$DW$556       .dwtag  DW_TAG_member
    9802                      .dwattr $C$DW$556, DW_AT_type(*$C$DW$T$39)
    9803                      .dwattr $C$DW$556, DW_AT_name("enum_pwmSwState")
    9804                      .dwattr $C$DW$556, DW_AT_accessibility(DW_ACCESS_public)
    9805                      .dwattr $C$DW$556, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/ttplpfc/ttplpfc.h"
    9806                      .dwattr $C$DW$556, DW_AT_decl_line(0xff)
    9807                      .dwattr $C$DW$556, DW_AT_decl_column(0x06)
    9808              
    9809              $C$DW$557       .dwtag  DW_TAG_member
    9810                      .dwattr $C$DW$557, DW_AT_type(*$C$DW$T$32)
    9811                      .dwattr $C$DW$557, DW_AT_name("pad")
    9812                      .dwattr $C$DW$557, DW_AT_accessibility(DW_ACCESS_public)
    9813                      .dwattr $C$DW$557, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/ttplpfc/ttplpfc.h"
TMS320C2000 Assembler PC v22.6.0 Tue Dec 20 15:55:15 2022

Copyright (c) 1996-2018 Texas Instruments Incorporated
obc_7_4kw_main.asm                                                   PAGE  206

    9814                      .dwattr $C$DW$557, DW_AT_decl_line(0x100)
    9815                      .dwattr $C$DW$557, DW_AT_decl_column(0x0d)
    9816              
    9817                      .dwattr $C$DW$T$40, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/ttplpfc/ttplpfc.h
    9818                      .dwattr $C$DW$T$40, DW_AT_decl_line(0xf2)
    9819                      .dwattr $C$DW$T$40, DW_AT_decl_column(0x0e)
    9820                      .dwendtag $C$DW$T$40
    9821              
    9822                      .dwendtag $C$DW$TU$40
    9823              
    9824              
    9825              $C$DW$TU$85     .dwtag  DW_TAG_type_unit
    9826                      .dwmtype  $C$DW$T$85
    9827              $C$DW$T$85      .dwtag  DW_TAG_typedef
    9828                      .dwattr $C$DW$T$85, DW_AT_name("TTPLPFC_pwmSwState")
    9829                      .dwattr $C$DW$T$85, DW_AT_type(*$C$DW$T$40)
    9830                      .dwattr $C$DW$T$85, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/ttplpfc/ttplpfc.h
    9831                      .dwattr $C$DW$T$85, DW_AT_decl_line(0x101)
    9832                      .dwattr $C$DW$T$85, DW_AT_decl_column(0x02)
    9833              
    9834                      .dwendtag $C$DW$TU$85
    9835              
    9836              
    9837              $C$DW$TU$42     .dwtag  DW_TAG_type_unit
    9838                      .dwmtype  $C$DW$T$42
    9839              
    9840              $C$DW$T$42      .dwtag  DW_TAG_union_type
    9841                      .dwattr $C$DW$T$42, DW_AT_byte_size(0x02)
    9842              $C$DW$558       .dwtag  DW_TAG_member
    9843                      .dwattr $C$DW$558, DW_AT_type(*$C$DW$T$41)
    9844                      .dwattr $C$DW$558, DW_AT_name("enum_interleavingState")
    9845                      .dwattr $C$DW$558, DW_AT_accessibility(DW_ACCESS_public)
    9846                      .dwattr $C$DW$558, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/ttplpfc/ttplpfc.h"
    9847                      .dwattr $C$DW$558, DW_AT_decl_line(0x10b)
    9848                      .dwattr $C$DW$558, DW_AT_decl_column(0x06)
    9849              
    9850              $C$DW$559       .dwtag  DW_TAG_member
    9851                      .dwattr $C$DW$559, DW_AT_type(*$C$DW$T$32)
    9852                      .dwattr $C$DW$559, DW_AT_name("pad")
    9853                      .dwattr $C$DW$559, DW_AT_accessibility(DW_ACCESS_public)
    9854                      .dwattr $C$DW$559, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/ttplpfc/ttplpfc.h"
    9855                      .dwattr $C$DW$559, DW_AT_decl_line(0x10c)
    9856                      .dwattr $C$DW$559, DW_AT_decl_column(0x0d)
    9857              
    9858                      .dwattr $C$DW$T$42, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/ttplpfc/ttplpfc.h
    9859                      .dwattr $C$DW$T$42, DW_AT_decl_line(0x105)
    9860                      .dwattr $C$DW$T$42, DW_AT_decl_column(0x0e)
    9861                      .dwendtag $C$DW$T$42
    9862              
    9863                      .dwendtag $C$DW$TU$42
    9864              
    9865              
    9866              $C$DW$TU$86     .dwtag  DW_TAG_type_unit
    9867                      .dwmtype  $C$DW$T$86
    9868              $C$DW$T$86      .dwtag  DW_TAG_typedef
TMS320C2000 Assembler PC v22.6.0 Tue Dec 20 15:55:15 2022

Copyright (c) 1996-2018 Texas Instruments Incorporated
obc_7_4kw_main.asm                                                   PAGE  207

    9869                      .dwattr $C$DW$T$86, DW_AT_name("TTPLPFC_interleavingState")
    9870                      .dwattr $C$DW$T$86, DW_AT_type(*$C$DW$T$42)
    9871                      .dwattr $C$DW$T$86, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/ttplpfc/ttplpfc.h
    9872                      .dwattr $C$DW$T$86, DW_AT_decl_line(0x10d)
    9873                      .dwattr $C$DW$T$86, DW_AT_decl_column(0x02)
    9874              
    9875                      .dwendtag $C$DW$TU$86
    9876              
    9877              
    9878              $C$DW$TU$44     .dwtag  DW_TAG_type_unit
    9879                      .dwmtype  $C$DW$T$44
    9880              
    9881              $C$DW$T$44      .dwtag  DW_TAG_structure_type
    9882                      .dwattr $C$DW$T$44, DW_AT_name("_Complex_double")
    9883                      .dwattr $C$DW$T$44, DW_AT_byte_size(0x08)
    9884              $C$DW$560       .dwtag  DW_TAG_member
    9885                      .dwattr $C$DW$560, DW_AT_type(*$C$DW$T$43)
    9886                      .dwattr $C$DW$560, DW_AT_name("_Vals")
    9887                      .dwattr $C$DW$560, DW_AT_accessibility(DW_ACCESS_public)
    9888                      .dwattr $C$DW$560, DW_AT_decl_file("C:\Users\gerar\workspace_v12\7.4kW_OBC_F28003x\clllc\clllc_hal.h"
    9889                      .dwattr $C$DW$560, DW_AT_decl_line(0x221)
    9890                      .dwattr $C$DW$560, DW_AT_decl_column(0x14)
    9891              
    9892                      .dwendtag $C$DW$T$44
    9893              
    9894                      .dwendtag $C$DW$TU$44
    9895              
    9896              
    9897              $C$DW$TU$87     .dwtag  DW_TAG_type_unit
    9898                      .dwmtype  $C$DW$T$87
    9899              $C$DW$T$87      .dwtag  DW_TAG_typedef
    9900                      .dwattr $C$DW$T$87, DW_AT_name("_Complex_double")
    9901                      .dwattr $C$DW$T$87, DW_AT_type(*$C$DW$T$44)
    9902                      .dwattr $C$DW$T$87, DW_AT_decl_file("C:\Users\gerar\workspace_v12\7.4kW_OBC_F28003x\clllc\clllc_hal.h
    9903                      .dwattr $C$DW$T$87, DW_AT_decl_line(0x221)
    9904                      .dwattr $C$DW$T$87, DW_AT_decl_column(0x14)
    9905              
    9906                      .dwendtag $C$DW$TU$87
    9907              
    9908              
    9909              $C$DW$TU$46     .dwtag  DW_TAG_type_unit
    9910                      .dwmtype  $C$DW$T$46
    9911              
    9912              $C$DW$T$46      .dwtag  DW_TAG_structure_type
    9913                      .dwattr $C$DW$T$46, DW_AT_name("_Complex_float")
    9914                      .dwattr $C$DW$T$46, DW_AT_byte_size(0x04)
    9915              $C$DW$561       .dwtag  DW_TAG_member
    9916                      .dwattr $C$DW$561, DW_AT_type(*$C$DW$T$45)
    9917                      .dwattr $C$DW$561, DW_AT_name("_Vals")
    9918                      .dwattr $C$DW$561, DW_AT_accessibility(DW_ACCESS_public)
    9919                      .dwattr $C$DW$561, DW_AT_decl_file("C:\Users\gerar\workspace_v12\7.4kW_OBC_F28003x\clllc\clllc_hal.h"
    9920                      .dwattr $C$DW$561, DW_AT_decl_line(0x221)
    9921                      .dwattr $C$DW$561, DW_AT_decl_column(0x14)
    9922              
    9923                      .dwendtag $C$DW$T$46
TMS320C2000 Assembler PC v22.6.0 Tue Dec 20 15:55:15 2022

Copyright (c) 1996-2018 Texas Instruments Incorporated
obc_7_4kw_main.asm                                                   PAGE  208

    9924              
    9925                      .dwendtag $C$DW$TU$46
    9926              
    9927              
    9928              $C$DW$TU$88     .dwtag  DW_TAG_type_unit
    9929                      .dwmtype  $C$DW$T$88
    9930              $C$DW$T$88      .dwtag  DW_TAG_typedef
    9931                      .dwattr $C$DW$T$88, DW_AT_name("_Complex_float")
    9932                      .dwattr $C$DW$T$88, DW_AT_type(*$C$DW$T$46)
    9933                      .dwattr $C$DW$T$88, DW_AT_decl_file("C:\Users\gerar\workspace_v12\7.4kW_OBC_F28003x\clllc\clllc_hal.h
    9934                      .dwattr $C$DW$T$88, DW_AT_decl_line(0x221)
    9935                      .dwattr $C$DW$T$88, DW_AT_decl_column(0x14)
    9936              
    9937                      .dwendtag $C$DW$TU$88
    9938              
    9939              
    9940              $C$DW$TU$48     .dwtag  DW_TAG_type_unit
    9941                      .dwmtype  $C$DW$T$48
    9942              
    9943              $C$DW$T$48      .dwtag  DW_TAG_structure_type
    9944                      .dwattr $C$DW$T$48, DW_AT_name("_Complex_long_double")
    9945                      .dwattr $C$DW$T$48, DW_AT_byte_size(0x08)
    9946              $C$DW$562       .dwtag  DW_TAG_member
    9947                      .dwattr $C$DW$562, DW_AT_type(*$C$DW$T$47)
    9948                      .dwattr $C$DW$562, DW_AT_name("_Vals")
    9949                      .dwattr $C$DW$562, DW_AT_accessibility(DW_ACCESS_public)
    9950                      .dwattr $C$DW$562, DW_AT_decl_file("C:\Users\gerar\workspace_v12\7.4kW_OBC_F28003x\clllc\clllc_hal.h"
    9951                      .dwattr $C$DW$562, DW_AT_decl_line(0x221)
    9952                      .dwattr $C$DW$562, DW_AT_decl_column(0x14)
    9953              
    9954                      .dwendtag $C$DW$T$48
    9955              
    9956                      .dwendtag $C$DW$TU$48
    9957              
    9958              
    9959              $C$DW$TU$90     .dwtag  DW_TAG_type_unit
    9960                      .dwmtype  $C$DW$T$90
    9961              $C$DW$T$90      .dwtag  DW_TAG_typedef
    9962                      .dwattr $C$DW$T$90, DW_AT_name("_Complex_long_double")
    9963                      .dwattr $C$DW$T$90, DW_AT_type(*$C$DW$T$48)
    9964                      .dwattr $C$DW$T$90, DW_AT_decl_file("C:\Users\gerar\workspace_v12\7.4kW_OBC_F28003x\clllc\clllc_hal.h
    9965                      .dwattr $C$DW$T$90, DW_AT_decl_line(0x221)
    9966                      .dwattr $C$DW$T$90, DW_AT_decl_column(0x14)
    9967              
    9968                      .dwendtag $C$DW$TU$90
    9969              
    9970              
    9971              $C$DW$TU$2      .dwtag  DW_TAG_type_unit
    9972                      .dwmtype  $C$DW$T$2
    9973              $C$DW$T$2       .dwtag  DW_TAG_unspecified_type
    9974                      .dwattr $C$DW$T$2, DW_AT_name("void")
    9975              
    9976                      .dwendtag $C$DW$TU$2
    9977              
    9978              
TMS320C2000 Assembler PC v22.6.0 Tue Dec 20 15:55:15 2022

Copyright (c) 1996-2018 Texas Instruments Incorporated
obc_7_4kw_main.asm                                                   PAGE  209

    9979              $C$DW$TU$91     .dwtag  DW_TAG_type_unit
    9980                      .dwmtype  $C$DW$T$91
    9981              
    9982              $C$DW$T$91      .dwtag  DW_TAG_subroutine_type
    9983                      .dwendtag $C$DW$T$91
    9984              
    9985                      .dwendtag $C$DW$TU$91
    9986              
    9987              
    9988              $C$DW$TU$92     .dwtag  DW_TAG_type_unit
    9989                      .dwmtype  $C$DW$T$92
    9990              $C$DW$T$92      .dwtag  DW_TAG_pointer_type
    9991                      .dwattr $C$DW$T$92, DW_AT_type(*$C$DW$T$91)
    9992                      .dwattr $C$DW$T$92, DW_AT_address_class(0x20)
    9993              
    9994                      .dwendtag $C$DW$TU$92
    9995              
    9996              
    9997              $C$DW$TU$4      .dwtag  DW_TAG_type_unit
    9998                      .dwmtype  $C$DW$T$4
    9999              $C$DW$T$4       .dwtag  DW_TAG_base_type
   10000                      .dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
   10001                      .dwattr $C$DW$T$4, DW_AT_name("bool")
   10002                      .dwattr $C$DW$T$4, DW_AT_byte_size(0x01)
   10003              
   10004                      .dwendtag $C$DW$TU$4
   10005              
   10006              
   10007              $C$DW$TU$5      .dwtag  DW_TAG_type_unit
   10008                      .dwmtype  $C$DW$T$5
   10009              $C$DW$T$5       .dwtag  DW_TAG_base_type
   10010                      .dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
   10011                      .dwattr $C$DW$T$5, DW_AT_name("signed char")
   10012                      .dwattr $C$DW$T$5, DW_AT_byte_size(0x01)
   10013              
   10014                      .dwendtag $C$DW$TU$5
   10015              
   10016              
   10017              $C$DW$TU$6      .dwtag  DW_TAG_type_unit
   10018                      .dwmtype  $C$DW$T$6
   10019              $C$DW$T$6       .dwtag  DW_TAG_base_type
   10020                      .dwattr $C$DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
   10021                      .dwattr $C$DW$T$6, DW_AT_name("unsigned char")
   10022                      .dwattr $C$DW$T$6, DW_AT_byte_size(0x01)
   10023              
   10024                      .dwendtag $C$DW$TU$6
   10025              
   10026              
   10027              $C$DW$TU$7      .dwtag  DW_TAG_type_unit
   10028                      .dwmtype  $C$DW$T$7
   10029              $C$DW$T$7       .dwtag  DW_TAG_base_type
   10030                      .dwattr $C$DW$T$7, DW_AT_encoding(DW_ATE_signed_char)
   10031                      .dwattr $C$DW$T$7, DW_AT_name("wchar_t")
   10032                      .dwattr $C$DW$T$7, DW_AT_byte_size(0x02)
   10033              
TMS320C2000 Assembler PC v22.6.0 Tue Dec 20 15:55:15 2022

Copyright (c) 1996-2018 Texas Instruments Incorporated
obc_7_4kw_main.asm                                                   PAGE  210

   10034                      .dwendtag $C$DW$TU$7
   10035              
   10036              
   10037              $C$DW$TU$8      .dwtag  DW_TAG_type_unit
   10038                      .dwmtype  $C$DW$T$8
   10039              $C$DW$T$8       .dwtag  DW_TAG_base_type
   10040                      .dwattr $C$DW$T$8, DW_AT_encoding(DW_ATE_signed)
   10041                      .dwattr $C$DW$T$8, DW_AT_name("short")
