;***************************************************************
;* TMS320C2000 G3 C/C++ Codegen                               PC v22.6.0.LTS *
;* Date/Time created: Tue Dec 20 15:55:14 2022                 *
;***************************************************************
	.compiler_opts --abi=eabi --cla_support=cla2 --diag_wrap=off --float_support=fpu64 --hll_source=on --mem_model:code=flat --mem_model:data=large --object_format=elf --quiet --silicon_errata_fpu1_workaround=off --silicon_version=28 --symdebug:dwarf --symdebug:dwarf_version=4 --tmu_support=tmu0 --vcu_support=vcu2 
	.asg	XAR2, FP

$C$DW$CU	.dwtag  DW_TAG_compile_unit
	.dwattr $C$DW$CU, DW_AT_name("../ttplpfc/ttplpfc.c")
	.dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 G3 C/C++ Codegen PC v22.6.0.LTS Copyright (c) 1996-2018 Texas Instruments Incorporated")
	.dwattr $C$DW$CU, DW_AT_TI_version(0x01)
	.dwattr $C$DW$CU, DW_AT_comp_dir("C:\Users\gerar\workspace_v12\7.4kW_OBC_F28003x\RELEASE")

$C$DW$1	.dwtag  DW_TAG_subprogram
	.dwattr $C$DW$1, DW_AT_name("SFRA_F32_reset")
	.dwattr $C$DW$1, DW_AT_linkage_name("SFRA_F32_reset")
	.dwattr $C$DW$1, DW_AT_declaration
	.dwattr $C$DW$1, DW_AT_external
	.dwattr $C$DW$1, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/sfra/sfra_f32.h")
	.dwattr $C$DW$1, DW_AT_decl_line(0x5a)
	.dwattr $C$DW$1, DW_AT_decl_column(0x0d)
$C$DW$2	.dwtag  DW_TAG_formal_parameter
	.dwattr $C$DW$2, DW_AT_type(*$C$DW$T$95)

	.dwendtag $C$DW$1



$C$DW$419	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$419, DW_AT_name("boardStatus_NoGridConnection")
	.dwattr $C$DW$419, DW_AT_const_value(0x09)
	.dwattr $C$DW$419, DW_AT_decl_file("..\ttplpfc\ttplpfc.h")
	.dwattr $C$DW$419, DW_AT_decl_line(0xea)
	.dwattr $C$DW$419, DW_AT_decl_column(0x09)

$C$DW$420	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$420, DW_AT_name("boardStatus_FAULTn")
	.dwattr $C$DW$420, DW_AT_const_value(0x0a)
	.dwattr $C$DW$420, DW_AT_decl_file("..\ttplpfc\ttplpfc.h")
	.dwattr $C$DW$420, DW_AT_decl_line(0xeb)
	.dwattr $C$DW$420, DW_AT_decl_column(0x09)

	.dwattr $C$DW$T$51, DW_AT_decl_file("..\ttplpfc\ttplpfc.h")
	.dwattr $C$DW$T$51, DW_AT_decl_line(0xe0)
	.dwattr $C$DW$T$51, DW_AT_decl_column(0x05)
	.dwendtag $C$DW$T$51

	.dwendtag $C$DW$TU$51


$C$DW$TU$53	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$53

$C$DW$T$53	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$53, DW_AT_byte_size(0x01)
$C$DW$421	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$421, DW_AT_name("pwmSwState_normalOperation")
	.dwattr $C$DW$421, DW_AT_const_value(0x00)
	.dwattr $C$DW$421, DW_AT_decl_file("..\ttplpfc\ttplpfc.h")
	.dwattr $C$DW$421, DW_AT_decl_line(0xf5)
	.dwattr $C$DW$421, DW_AT_decl_column(0x09)

$C$DW$422	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$422, DW_AT_name("pwmSwState_positiveHalf")
	.dwattr $C$DW$422, DW_AT_const_value(0x01)
	.dwattr $C$DW$422, DW_AT_decl_file("..\ttplpfc\ttplpfc.h")
	.dwattr $C$DW$422, DW_AT_decl_line(0xf6)
	.dwattr $C$DW$422, DW_AT_decl_column(0x09)

$C$DW$423	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$423, DW_AT_name("pwmSwState_negativeZeroCrossing1")
	.dwattr $C$DW$423, DW_AT_const_value(0x02)
	.dwattr $C$DW$423, DW_AT_decl_file("..\ttplpfc\ttplpfc.h")
	.dwattr $C$DW$423, DW_AT_decl_line(0xf7)
	.dwattr $C$DW$423, DW_AT_decl_column(0x09)

$C$DW$424	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$424, DW_AT_name("pwmSwState_negativeZeroCrossing2")
	.dwattr $C$DW$424, DW_AT_const_value(0x03)
	.dwattr $C$DW$424, DW_AT_decl_file("..\ttplpfc\ttplpfc.h")
	.dwattr $C$DW$424, DW_AT_decl_line(0xf8)
	.dwattr $C$DW$424, DW_AT_decl_column(0x09)

$C$DW$425	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$425, DW_AT_name("pwmSwState_negativeZeroCrossing3")
	.dwattr $C$DW$425, DW_AT_const_value(0x04)
	.dwattr $C$DW$425, DW_AT_decl_file("..\ttplpfc\ttplpfc.h")
	.dwattr $C$DW$425, DW_AT_decl_line(0xf9)
	.dwattr $C$DW$425, DW_AT_decl_column(0x09)

$C$DW$426	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$426, DW_AT_name("pwmSwState_negativeHalf")
	.dwattr $C$DW$426, DW_AT_const_value(0x05)
	.dwattr $C$DW$426, DW_AT_decl_file("..\ttplpfc\ttplpfc.h")
	.dwattr $C$DW$426, DW_AT_decl_line(0xfa)
	.dwattr $C$DW$426, DW_AT_decl_column(0x09)

$C$DW$427	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$427, DW_AT_name("pwmSwState_positiveZeroCrossing1")
	.dwattr $C$DW$427, DW_AT_const_value(0x06)
	.dwattr $C$DW$427, DW_AT_decl_file("..\ttplpfc\ttplpfc.h")
	.dwattr $C$DW$427, DW_AT_decl_line(0xfb)
	.dwattr $C$DW$427, DW_AT_decl_column(0x09)

$C$DW$428	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$428, DW_AT_name("pwmSwState_positiveZeroCrossing2")
	.dwattr $C$DW$428, DW_AT_const_value(0x07)
	.dwattr $C$DW$428, DW_AT_decl_file("..\ttplpfc\ttplpfc.h")
	.dwattr $C$DW$428, DW_AT_decl_line(0xfc)
	.dwattr $C$DW$428, DW_AT_decl_column(0x09)

$C$DW$429	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$429, DW_AT_name("pwmSwState_positiveZeroCrossing3")
	.dwattr $C$DW$429, DW_AT_const_value(0x08)
	.dwattr $C$DW$429, DW_AT_decl_file("..\ttplpfc\ttplpfc.h")
	.dwattr $C$DW$429, DW_AT_decl_line(0xfd)
	.dwattr $C$DW$429, DW_AT_decl_column(0x09)

$C$DW$430	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$430, DW_AT_name("pwmSwState_defaultState")
	.dwattr $C$DW$430, DW_AT_const_value(0x09)
	.dwattr $C$DW$430, DW_AT_decl_file("..\ttplpfc\ttplpfc.h")
	.dwattr $C$DW$430, DW_AT_decl_line(0xfe)
	.dwattr $C$DW$430, DW_AT_decl_column(0x09)

	.dwattr $C$DW$T$53, DW_AT_decl_file("..\ttplpfc\ttplpfc.h")
	.dwattr $C$DW$T$53, DW_AT_decl_line(0xf4)
	.dwattr $C$DW$T$53, DW_AT_decl_column(0x05)
	.dwendtag $C$DW$T$53

	.dwendtag $C$DW$TU$53


$C$DW$TU$55	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$55

$C$DW$T$55	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$55, DW_AT_byte_size(0x01)
$C$DW$431	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$431, DW_AT_name("interleavingState_1ph")
	.dwattr $C$DW$431, DW_AT_const_value(0x00)
	.dwattr $C$DW$431, DW_AT_decl_file("..\ttplpfc\ttplpfc.h")
	.dwattr $C$DW$431, DW_AT_decl_line(0x108)
	.dwattr $C$DW$431, DW_AT_decl_column(0x09)

$C$DW$432	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$432, DW_AT_name("interleavingState_2ph")
	.dwattr $C$DW$432, DW_AT_const_value(0x01)
	.dwattr $C$DW$432, DW_AT_decl_file("..\ttplpfc\ttplpfc.h")
	.dwattr $C$DW$432, DW_AT_decl_line(0x109)
	.dwattr $C$DW$432, DW_AT_decl_column(0x09)

$C$DW$433	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$433, DW_AT_name("interleavingState_3ph")
	.dwattr $C$DW$433, DW_AT_const_value(0x02)
	.dwattr $C$DW$433, DW_AT_decl_file("..\ttplpfc\ttplpfc.h")
	.dwattr $C$DW$433, DW_AT_decl_line(0x10a)
	.dwattr $C$DW$433, DW_AT_decl_column(0x09)

	.dwattr $C$DW$T$55, DW_AT_decl_file("..\ttplpfc\ttplpfc.h")
	.dwattr $C$DW$T$55, DW_AT_decl_line(0x107)
	.dwattr $C$DW$T$55, DW_AT_decl_column(0x05)
	.dwendtag $C$DW$T$55

	.dwendtag $C$DW$TU$55


$C$DW$TU$23	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$23

$C$DW$T$23	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$23, DW_AT_byte_size(0x1a)
$C$DW$434	.dwtag  DW_TAG_member
	.dwattr $C$DW$434, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$434, DW_AT_name("inputPtr1")
	.dwattr $C$DW$434, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$434, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/utilities/dlog_4ch.h")
	.dwattr $C$DW$434, DW_AT_decl_line(0x42)
	.dwattr $C$DW$434, DW_AT_decl_column(0x0d)

$C$DW$435	.dwtag  DW_TAG_member
	.dwattr $C$DW$435, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$435, DW_AT_name("inputPtr2")
	.dwattr $C$DW$435, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$435, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$435, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/utilities/dlog_4ch.h")
	.dwattr $C$DW$435, DW_AT_decl_line(0x43)
	.dwattr $C$DW$435, DW_AT_decl_column(0x0d)

$C$DW$436	.dwtag  DW_TAG_member
	.dwattr $C$DW$436, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$436, DW_AT_name("inputPtr3")
	.dwattr $C$DW$436, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$436, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$436, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/utilities/dlog_4ch.h")
	.dwattr $C$DW$436, DW_AT_decl_line(0x44)
	.dwattr $C$DW$436, DW_AT_decl_column(0x0d)

$C$DW$437	.dwtag  DW_TAG_member
	.dwattr $C$DW$437, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$437, DW_AT_name("inputPtr4")
	.dwattr $C$DW$437, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr $C$DW$437, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$437, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/utilities/dlog_4ch.h")
	.dwattr $C$DW$437, DW_AT_decl_line(0x45)
	.dwattr $C$DW$437, DW_AT_decl_column(0x0d)

$C$DW$438	.dwtag  DW_TAG_member
	.dwattr $C$DW$438, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$438, DW_AT_name("outputPtr1")
	.dwattr $C$DW$438, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$438, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$438, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/utilities/dlog_4ch.h")
	.dwattr $C$DW$438, DW_AT_decl_line(0x46)
	.dwattr $C$DW$438, DW_AT_decl_column(0x0d)

$C$DW$439	.dwtag  DW_TAG_member
	.dwattr $C$DW$439, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$439, DW_AT_name("outputPtr2")
	.dwattr $C$DW$439, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
	.dwattr $C$DW$439, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$439, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/utilities/dlog_4ch.h")
	.dwattr $C$DW$439, DW_AT_decl_line(0x47)
	.dwattr $C$DW$439, DW_AT_decl_column(0x0d)

$C$DW$440	.dwtag  DW_TAG_member
	.dwattr $C$DW$440, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$440, DW_AT_name("outputPtr3")
	.dwattr $C$DW$440, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$440, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$440, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/utilities/dlog_4ch.h")
	.dwattr $C$DW$440, DW_AT_decl_line(0x48)
	.dwattr $C$DW$440, DW_AT_decl_column(0x0d)

$C$DW$441	.dwtag  DW_TAG_member
	.dwattr $C$DW$441, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$441, DW_AT_name("outputPtr4")
	.dwattr $C$DW$441, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
	.dwattr $C$DW$441, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$441, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/utilities/dlog_4ch.h")
	.dwattr $C$DW$441, DW_AT_decl_line(0x49)
	.dwattr $C$DW$441, DW_AT_decl_column(0x0d)

$C$DW$442	.dwtag  DW_TAG_member
	.dwattr $C$DW$442, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$442, DW_AT_name("prevValue")
	.dwattr $C$DW$442, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$442, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$442, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/utilities/dlog_4ch.h")
	.dwattr $C$DW$442, DW_AT_decl_line(0x4a)
	.dwattr $C$DW$442, DW_AT_decl_column(0x0c)

$C$DW$443	.dwtag  DW_TAG_member
	.dwattr $C$DW$443, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$443, DW_AT_name("trigValue")
	.dwattr $C$DW$443, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
	.dwattr $C$DW$443, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$443, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/utilities/dlog_4ch.h")
	.dwattr $C$DW$443, DW_AT_decl_line(0x4b)
	.dwattr $C$DW$443, DW_AT_decl_column(0x0c)

$C$DW$444	.dwtag  DW_TAG_member
	.dwattr $C$DW$444, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$444, DW_AT_name("status")
	.dwattr $C$DW$444, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr $C$DW$444, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$444, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/utilities/dlog_4ch.h")
	.dwattr $C$DW$444, DW_AT_decl_line(0x4c)
	.dwattr $C$DW$444, DW_AT_decl_column(0x0a)

$C$DW$445	.dwtag  DW_TAG_member
	.dwattr $C$DW$445, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$445, DW_AT_name("preScalar")
	.dwattr $C$DW$445, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
	.dwattr $C$DW$445, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$445, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/utilities/dlog_4ch.h")
	.dwattr $C$DW$445, DW_AT_decl_line(0x4d)
	.dwattr $C$DW$445, DW_AT_decl_column(0x0a)

$C$DW$446	.dwtag  DW_TAG_member
	.dwattr $C$DW$446, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$446, DW_AT_name("skipCount")
	.dwattr $C$DW$446, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
	.dwattr $C$DW$446, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$446, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/utilities/dlog_4ch.h")
	.dwattr $C$DW$446, DW_AT_decl_line(0x4e)
	.dwattr $C$DW$446, DW_AT_decl_column(0x0a)

$C$DW$447	.dwtag  DW_TAG_member
	.dwattr $C$DW$447, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$447, DW_AT_name("size")
	.dwattr $C$DW$447, DW_AT_data_member_location[DW_OP_plus_uconst 0x17]
	.dwattr $C$DW$447, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$447, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/utilities/dlog_4ch.h")
	.dwattr $C$DW$447, DW_AT_decl_line(0x4f)
	.dwattr $C$DW$447, DW_AT_decl_column(0x0a)

$C$DW$448	.dwtag  DW_TAG_member
	.dwattr $C$DW$448, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$448, DW_AT_name("count")
	.dwattr $C$DW$448, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
	.dwattr $C$DW$448, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$448, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/utilities/dlog_4ch.h")
	.dwattr $C$DW$448, DW_AT_decl_line(0x50)
	.dwattr $C$DW$448, DW_AT_decl_column(0x0a)

	.dwattr $C$DW$T$23, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/utilities/dlog_4ch.h")
	.dwattr $C$DW$T$23, DW_AT_decl_line(0x41)
	.dwattr $C$DW$T$23, DW_AT_decl_column(0x18)
	.dwendtag $C$DW$T$23

	.dwendtag $C$DW$TU$23


$C$DW$TU$76	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$76
$C$DW$449	.dwtag  DW_TAG_TI_far_type
	.dwattr $C$DW$449, DW_AT_type(*$C$DW$T$23)

$C$DW$T$76	.dwtag  DW_TAG_volatile_type
	.dwattr $C$DW$T$76, DW_AT_type(*$C$DW$449)

	.dwendtag $C$DW$TU$76


$C$DW$TU$77	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$77
$C$DW$T$77	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$77, DW_AT_name("DLOG_4CH")
	.dwattr $C$DW$T$77, DW_AT_type(*$C$DW$T$76)
	.dwattr $C$DW$T$77, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/utilities/dlog_4ch.h")
	.dwattr $C$DW$T$77, DW_AT_decl_line(0x51)
	.dwattr $C$DW$T$77, DW_AT_decl_column(0x03)

	.dwendtag $C$DW$TU$77


$C$DW$TU$24	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$24

$C$DW$T$24	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$24, DW_AT_byte_size(0x06)
$C$DW$450	.dwtag  DW_TAG_member
	.dwattr $C$DW$450, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$450, DW_AT_name("freq")
	.dwattr $C$DW$450, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$450, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/utilities/rampgen.h")
	.dwattr $C$DW$450, DW_AT_decl_line(0x43)
	.dwattr $C$DW$450, DW_AT_decl_column(0x10)

$C$DW$451	.dwtag  DW_TAG_member
	.dwattr $C$DW$451, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$451, DW_AT_name("stepAngleMax")
	.dwattr $C$DW$451, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$451, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$451, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/utilities/rampgen.h")
	.dwattr $C$DW$451, DW_AT_decl_line(0x44)
	.dwattr $C$DW$451, DW_AT_decl_column(0x10)

$C$DW$452	.dwtag  DW_TAG_member
	.dwattr $C$DW$452, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$452, DW_AT_name("out")
	.dwattr $C$DW$452, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$452, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$452, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/utilities/rampgen.h")
	.dwattr $C$DW$452, DW_AT_decl_line(0x45)
	.dwattr $C$DW$452, DW_AT_decl_column(0x10)

	.dwattr $C$DW$T$24, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/utilities/rampgen.h")
	.dwattr $C$DW$T$24, DW_AT_decl_line(0x42)
	.dwattr $C$DW$T$24, DW_AT_decl_column(0x19)
	.dwendtag $C$DW$T$24

	.dwendtag $C$DW$TU$24


$C$DW$TU$79	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$79
$C$DW$453	.dwtag  DW_TAG_TI_far_type
	.dwattr $C$DW$453, DW_AT_type(*$C$DW$T$24)

$C$DW$T$79	.dwtag  DW_TAG_volatile_type
	.dwattr $C$DW$T$79, DW_AT_type(*$C$DW$453)

	.dwendtag $C$DW$TU$79


$C$DW$TU$80	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$80
$C$DW$T$80	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$80, DW_AT_name("RAMPGEN")
	.dwattr $C$DW$T$80, DW_AT_type(*$C$DW$T$79)
	.dwattr $C$DW$T$80, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/utilities/rampgen.h")
	.dwattr $C$DW$T$80, DW_AT_decl_line(0x46)
	.dwattr $C$DW$T$80, DW_AT_decl_column(0x03)

	.dwendtag $C$DW$TU$80


$C$DW$TU$25	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$25

$C$DW$T$25	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$25, DW_AT_byte_size(0x14)
$C$DW$454	.dwtag  DW_TAG_member
	.dwattr $C$DW$454, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$454, DW_AT_name("osg_k")
	.dwattr $C$DW$454, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$454, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/spll/spll_1ph_sogi.h")
	.dwattr $C$DW$454, DW_AT_decl_line(0x41)
	.dwattr $C$DW$454, DW_AT_decl_column(0x0f)

$C$DW$455	.dwtag  DW_TAG_member
	.dwattr $C$DW$455, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$455, DW_AT_name("osg_x")
	.dwattr $C$DW$455, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$455, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$455, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/spll/spll_1ph_sogi.h")
	.dwattr $C$DW$455, DW_AT_decl_line(0x42)
	.dwattr $C$DW$455, DW_AT_decl_column(0x0f)

$C$DW$456	.dwtag  DW_TAG_member
	.dwattr $C$DW$456, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$456, DW_AT_name("osg_y")
	.dwattr $C$DW$456, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$456, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$456, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/spll/spll_1ph_sogi.h")
	.dwattr $C$DW$456, DW_AT_decl_line(0x43)
	.dwattr $C$DW$456, DW_AT_decl_column(0x0f)

$C$DW$457	.dwtag  DW_TAG_member
	.dwattr $C$DW$457, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$457, DW_AT_name("osg_b0")
	.dwattr $C$DW$457, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr $C$DW$457, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$457, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/spll/spll_1ph_sogi.h")
	.dwattr $C$DW$457, DW_AT_decl_line(0x44)
	.dwattr $C$DW$457, DW_AT_decl_column(0x0f)

$C$DW$458	.dwtag  DW_TAG_member
	.dwattr $C$DW$458, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$458, DW_AT_name("osg_b2")
	.dwattr $C$DW$458, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$458, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$458, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/spll/spll_1ph_sogi.h")
	.dwattr $C$DW$458, DW_AT_decl_line(0x45)
	.dwattr $C$DW$458, DW_AT_decl_column(0x0f)

$C$DW$459	.dwtag  DW_TAG_member
	.dwattr $C$DW$459, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$459, DW_AT_name("osg_a1")
	.dwattr $C$DW$459, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
	.dwattr $C$DW$459, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$459, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/spll/spll_1ph_sogi.h")
	.dwattr $C$DW$459, DW_AT_decl_line(0x46)
	.dwattr $C$DW$459, DW_AT_decl_column(0x0f)

$C$DW$460	.dwtag  DW_TAG_member
	.dwattr $C$DW$460, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$460, DW_AT_name("osg_a2")
	.dwattr $C$DW$460, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$460, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$460, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/spll/spll_1ph_sogi.h")
	.dwattr $C$DW$460, DW_AT_decl_line(0x47)
	.dwattr $C$DW$460, DW_AT_decl_column(0x0f)

$C$DW$461	.dwtag  DW_TAG_member
	.dwattr $C$DW$461, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$461, DW_AT_name("osg_qb0")
	.dwattr $C$DW$461, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
	.dwattr $C$DW$461, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$461, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/spll/spll_1ph_sogi.h")
	.dwattr $C$DW$461, DW_AT_decl_line(0x48)
	.dwattr $C$DW$461, DW_AT_decl_column(0x0f)

$C$DW$462	.dwtag  DW_TAG_member
	.dwattr $C$DW$462, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$462, DW_AT_name("osg_qb1")
	.dwattr $C$DW$462, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$462, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$462, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/spll/spll_1ph_sogi.h")
	.dwattr $C$DW$462, DW_AT_decl_line(0x49)
	.dwattr $C$DW$462, DW_AT_decl_column(0x0f)

$C$DW$463	.dwtag  DW_TAG_member
	.dwattr $C$DW$463, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$463, DW_AT_name("osg_qb2")
	.dwattr $C$DW$463, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
	.dwattr $C$DW$463, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$463, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/spll/spll_1ph_sogi.h")
	.dwattr $C$DW$463, DW_AT_decl_line(0x4a)
	.dwattr $C$DW$463, DW_AT_decl_column(0x0f)

	.dwattr $C$DW$T$25, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/spll/spll_1ph_sogi.h")
	.dwattr $C$DW$T$25, DW_AT_decl_line(0x40)
	.dwattr $C$DW$T$25, DW_AT_decl_column(0x0f)
	.dwendtag $C$DW$T$25

	.dwendtag $C$DW$TU$25


$C$DW$TU$29	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$29
$C$DW$T$29	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$29, DW_AT_name("SPLL_1PH_SOGI_OSG_COEFF")
	.dwattr $C$DW$T$29, DW_AT_type(*$C$DW$T$25)
	.dwattr $C$DW$T$29, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/spll/spll_1ph_sogi.h")
	.dwattr $C$DW$T$29, DW_AT_decl_line(0x4b)
	.dwattr $C$DW$T$29, DW_AT_decl_column(0x03)

	.dwendtag $C$DW$TU$29


$C$DW$TU$26	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$26

$C$DW$T$26	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$26, DW_AT_byte_size(0x04)
$C$DW$464	.dwtag  DW_TAG_member
	.dwattr $C$DW$464, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$464, DW_AT_name("b1")
	.dwattr $C$DW$464, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$464, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/spll/spll_1ph_sogi.h")
	.dwattr $C$DW$464, DW_AT_decl_line(0x50)
	.dwattr $C$DW$464, DW_AT_decl_column(0x0f)

$C$DW$465	.dwtag  DW_TAG_member
	.dwattr $C$DW$465, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$465, DW_AT_name("b0")
	.dwattr $C$DW$465, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$465, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$465, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/spll/spll_1ph_sogi.h")
	.dwattr $C$DW$465, DW_AT_decl_line(0x51)
	.dwattr $C$DW$465, DW_AT_decl_column(0x0f)

	.dwattr $C$DW$T$26, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/spll/spll_1ph_sogi.h")
	.dwattr $C$DW$T$26, DW_AT_decl_line(0x4f)
	.dwattr $C$DW$T$26, DW_AT_decl_column(0x0f)
	.dwendtag $C$DW$T$26

	.dwendtag $C$DW$TU$26


$C$DW$TU$30	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$30
$C$DW$T$30	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$30, DW_AT_name("SPLL_1PH_SOGI_LPF_COEFF")
	.dwattr $C$DW$T$30, DW_AT_type(*$C$DW$T$26)
	.dwattr $C$DW$T$30, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/spll/spll_1ph_sogi.h")
	.dwattr $C$DW$T$30, DW_AT_decl_line(0x52)
	.dwattr $C$DW$T$30, DW_AT_decl_column(0x03)

	.dwendtag $C$DW$TU$30


$C$DW$TU$31	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$31

$C$DW$T$31	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$31, DW_AT_byte_size(0x42)
$C$DW$466	.dwtag  DW_TAG_member
	.dwattr $C$DW$466, DW_AT_type(*$C$DW$T$27)
	.dwattr $C$DW$466, DW_AT_name("u")
	.dwattr $C$DW$466, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$466, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/spll/spll_1ph_sogi.h")
	.dwattr $C$DW$466, DW_AT_decl_line(0x5c)
	.dwattr $C$DW$466, DW_AT_decl_column(0x11)

$C$DW$467	.dwtag  DW_TAG_member
	.dwattr $C$DW$467, DW_AT_type(*$C$DW$T$27)
	.dwattr $C$DW$467, DW_AT_name("osg_u")
	.dwattr $C$DW$467, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr $C$DW$467, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$467, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/spll/spll_1ph_sogi.h")
	.dwattr $C$DW$467, DW_AT_decl_line(0x5d)
	.dwattr $C$DW$467, DW_AT_decl_column(0x11)

$C$DW$468	.dwtag  DW_TAG_member
	.dwattr $C$DW$468, DW_AT_type(*$C$DW$T$27)
	.dwattr $C$DW$468, DW_AT_name("osg_qu")
	.dwattr $C$DW$468, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$468, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$468, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/spll/spll_1ph_sogi.h")
	.dwattr $C$DW$468, DW_AT_decl_line(0x5e)
	.dwattr $C$DW$468, DW_AT_decl_column(0x11)

$C$DW$469	.dwtag  DW_TAG_member
	.dwattr $C$DW$469, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$469, DW_AT_name("u_Q")
	.dwattr $C$DW$469, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
	.dwattr $C$DW$469, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$469, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/spll/spll_1ph_sogi.h")
	.dwattr $C$DW$469, DW_AT_decl_line(0x5f)
	.dwattr $C$DW$469, DW_AT_decl_column(0x11)

$C$DW$470	.dwtag  DW_TAG_member
	.dwattr $C$DW$470, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$470, DW_AT_name("u_D")
	.dwattr $C$DW$470, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
	.dwattr $C$DW$470, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$470, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/spll/spll_1ph_sogi.h")
	.dwattr $C$DW$470, DW_AT_decl_line(0x60)
	.dwattr $C$DW$470, DW_AT_decl_column(0x11)

$C$DW$471	.dwtag  DW_TAG_member
	.dwattr $C$DW$471, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$471, DW_AT_name("ylf")
	.dwattr $C$DW$471, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
	.dwattr $C$DW$471, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$471, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/spll/spll_1ph_sogi.h")
	.dwattr $C$DW$471, DW_AT_decl_line(0x61)
	.dwattr $C$DW$471, DW_AT_decl_column(0x11)

$C$DW$472	.dwtag  DW_TAG_member
	.dwattr $C$DW$472, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$472, DW_AT_name("fo")
	.dwattr $C$DW$472, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
	.dwattr $C$DW$472, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$472, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/spll/spll_1ph_sogi.h")
	.dwattr $C$DW$472, DW_AT_decl_line(0x62)
	.dwattr $C$DW$472, DW_AT_decl_column(0x11)

$C$DW$473	.dwtag  DW_TAG_member
	.dwattr $C$DW$473, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$473, DW_AT_name("fn")
	.dwattr $C$DW$473, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
	.dwattr $C$DW$473, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$473, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/spll/spll_1ph_sogi.h")
	.dwattr $C$DW$473, DW_AT_decl_line(0x63)
	.dwattr $C$DW$473, DW_AT_decl_column(0x11)

$C$DW$474	.dwtag  DW_TAG_member
	.dwattr $C$DW$474, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$474, DW_AT_name("theta")
	.dwattr $C$DW$474, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
	.dwattr $C$DW$474, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$474, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/spll/spll_1ph_sogi.h")
	.dwattr $C$DW$474, DW_AT_decl_line(0x64)
	.dwattr $C$DW$474, DW_AT_decl_column(0x11)

$C$DW$475	.dwtag  DW_TAG_member
	.dwattr $C$DW$475, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$475, DW_AT_name("cosine")
	.dwattr $C$DW$475, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
	.dwattr $C$DW$475, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$475, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/spll/spll_1ph_sogi.h")
	.dwattr $C$DW$475, DW_AT_decl_line(0x65)
	.dwattr $C$DW$475, DW_AT_decl_column(0x11)

$C$DW$476	.dwtag  DW_TAG_member
	.dwattr $C$DW$476, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$476, DW_AT_name("sine")
	.dwattr $C$DW$476, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
	.dwattr $C$DW$476, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$476, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/spll/spll_1ph_sogi.h")
	.dwattr $C$DW$476, DW_AT_decl_line(0x66)
	.dwattr $C$DW$476, DW_AT_decl_column(0x11)

$C$DW$477	.dwtag  DW_TAG_member
	.dwattr $C$DW$477, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$477, DW_AT_name("delta_t")
	.dwattr $C$DW$477, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
	.dwattr $C$DW$477, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$477, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/spll/spll_1ph_sogi.h")
	.dwattr $C$DW$477, DW_AT_decl_line(0x67)
	.dwattr $C$DW$477, DW_AT_decl_column(0x11)

$C$DW$478	.dwtag  DW_TAG_member
	.dwattr $C$DW$478, DW_AT_type(*$C$DW$T$29)
	.dwattr $C$DW$478, DW_AT_name("osg_coeff")
	.dwattr $C$DW$478, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
	.dwattr $C$DW$478, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$478, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/spll/spll_1ph_sogi.h")
	.dwattr $C$DW$478, DW_AT_decl_line(0x68)
	.dwattr $C$DW$478, DW_AT_decl_column(0x1d)

$C$DW$479	.dwtag  DW_TAG_member
	.dwattr $C$DW$479, DW_AT_type(*$C$DW$T$30)
	.dwattr $C$DW$479, DW_AT_name("lpf_coeff")
	.dwattr $C$DW$479, DW_AT_data_member_location[DW_OP_plus_uconst 0x3e]
	.dwattr $C$DW$479, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$479, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/spll/spll_1ph_sogi.h")
	.dwattr $C$DW$479, DW_AT_decl_line(0x69)
	.dwattr $C$DW$479, DW_AT_decl_column(0x1d)

	.dwattr $C$DW$T$31, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/spll/spll_1ph_sogi.h")
	.dwattr $C$DW$T$31, DW_AT_decl_line(0x5b)
	.dwattr $C$DW$T$31, DW_AT_decl_column(0x0f)
	.dwendtag $C$DW$T$31

	.dwendtag $C$DW$TU$31


$C$DW$TU$82	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$82
$C$DW$T$82	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$82, DW_AT_name("SPLL_1PH_SOGI")
	.dwattr $C$DW$T$82, DW_AT_type(*$C$DW$T$31)
	.dwattr $C$DW$T$82, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/spll/spll_1ph_sogi.h")
	.dwattr $C$DW$T$82, DW_AT_decl_line(0x6a)
	.dwattr $C$DW$T$82, DW_AT_decl_column(0x03)

	.dwendtag $C$DW$TU$82


$C$DW$TU$32	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$32

$C$DW$T$32	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$32, DW_AT_byte_size(0x0a)
$C$DW$480	.dwtag  DW_TAG_member
	.dwattr $C$DW$480, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$480, DW_AT_name("b2")
	.dwattr $C$DW$480, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$480, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/spll/spll_1ph_notch.h")
	.dwattr $C$DW$480, DW_AT_decl_line(0x42)
	.dwattr $C$DW$480, DW_AT_decl_column(0x0c)

$C$DW$481	.dwtag  DW_TAG_member
	.dwattr $C$DW$481, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$481, DW_AT_name("b1")
	.dwattr $C$DW$481, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$481, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$481, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/spll/spll_1ph_notch.h")
	.dwattr $C$DW$481, DW_AT_decl_line(0x43)
	.dwattr $C$DW$481, DW_AT_decl_column(0x0c)

$C$DW$482	.dwtag  DW_TAG_member
	.dwattr $C$DW$482, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$482, DW_AT_name("b0")
	.dwattr $C$DW$482, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$482, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$482, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/spll/spll_1ph_notch.h")
	.dwattr $C$DW$482, DW_AT_decl_line(0x44)
	.dwattr $C$DW$482, DW_AT_decl_column(0x0c)

$C$DW$483	.dwtag  DW_TAG_member
	.dwattr $C$DW$483, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$483, DW_AT_name("a2")
	.dwattr $C$DW$483, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr $C$DW$483, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$483, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/spll/spll_1ph_notch.h")
	.dwattr $C$DW$483, DW_AT_decl_line(0x45)
	.dwattr $C$DW$483, DW_AT_decl_column(0x0c)

$C$DW$484	.dwtag  DW_TAG_member
	.dwattr $C$DW$484, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$484, DW_AT_name("a1")
	.dwattr $C$DW$484, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$484, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$484, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/spll/spll_1ph_notch.h")
	.dwattr $C$DW$484, DW_AT_decl_line(0x46)
	.dwattr $C$DW$484, DW_AT_decl_column(0x0c)

	.dwattr $C$DW$T$32, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/spll/spll_1ph_notch.h")
	.dwattr $C$DW$T$32, DW_AT_decl_line(0x41)
	.dwattr $C$DW$T$32, DW_AT_decl_column(0x0f)
	.dwendtag $C$DW$T$32

	.dwendtag $C$DW$TU$32


$C$DW$TU$34	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$34
$C$DW$T$34	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$34, DW_AT_name("SPLL_1PH_NOTCH_COEFF")
	.dwattr $C$DW$T$34, DW_AT_type(*$C$DW$T$32)
	.dwattr $C$DW$T$34, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/spll/spll_1ph_notch.h")
	.dwattr $C$DW$T$34, DW_AT_decl_line(0x47)
	.dwattr $C$DW$T$34, DW_AT_decl_column(0x03)

	.dwendtag $C$DW$TU$34


$C$DW$TU$33	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$33

$C$DW$T$33	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$33, DW_AT_byte_size(0x06)
$C$DW$485	.dwtag  DW_TAG_member
	.dwattr $C$DW$485, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$485, DW_AT_name("b1")
	.dwattr $C$DW$485, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$485, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/spll/spll_1ph_notch.h")
	.dwattr $C$DW$485, DW_AT_decl_line(0x4c)
	.dwattr $C$DW$485, DW_AT_decl_column(0x0f)

$C$DW$486	.dwtag  DW_TAG_member
	.dwattr $C$DW$486, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$486, DW_AT_name("b0")
	.dwattr $C$DW$486, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$486, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$486, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/spll/spll_1ph_notch.h")
	.dwattr $C$DW$486, DW_AT_decl_line(0x4d)
	.dwattr $C$DW$486, DW_AT_decl_column(0x0f)

$C$DW$487	.dwtag  DW_TAG_member
	.dwattr $C$DW$487, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$487, DW_AT_name("a1")
	.dwattr $C$DW$487, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$487, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$487, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/spll/spll_1ph_notch.h")
	.dwattr $C$DW$487, DW_AT_decl_line(0x4e)
	.dwattr $C$DW$487, DW_AT_decl_column(0x0f)

	.dwattr $C$DW$T$33, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/spll/spll_1ph_notch.h")
	.dwattr $C$DW$T$33, DW_AT_decl_line(0x4b)
	.dwattr $C$DW$T$33, DW_AT_decl_column(0x0f)
	.dwendtag $C$DW$T$33

	.dwendtag $C$DW$TU$33


$C$DW$TU$35	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$35
$C$DW$T$35	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$35, DW_AT_name("SPLL_1PH_NOTCH_LPF_COEFF")
	.dwattr $C$DW$T$35, DW_AT_type(*$C$DW$T$33)
	.dwattr $C$DW$T$35, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/spll/spll_1ph_notch.h")
	.dwattr $C$DW$T$35, DW_AT_decl_line(0x4f)
	.dwattr $C$DW$T$35, DW_AT_decl_column(0x03)

	.dwendtag $C$DW$TU$35


$C$DW$TU$36	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$36

$C$DW$T$36	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$36, DW_AT_byte_size(0x32)
$C$DW$488	.dwtag  DW_TAG_member
	.dwattr $C$DW$488, DW_AT_type(*$C$DW$T$27)
	.dwattr $C$DW$488, DW_AT_name("upd")
	.dwattr $C$DW$488, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$488, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/spll/spll_1ph_notch.h")
	.dwattr $C$DW$488, DW_AT_decl_line(0x58)
	.dwattr $C$DW$488, DW_AT_decl_column(0x11)

$C$DW$489	.dwtag  DW_TAG_member
	.dwattr $C$DW$489, DW_AT_type(*$C$DW$T$27)
	.dwattr $C$DW$489, DW_AT_name("y_notch1")
	.dwattr $C$DW$489, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr $C$DW$489, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$489, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/spll/spll_1ph_notch.h")
	.dwattr $C$DW$489, DW_AT_decl_line(0x59)
	.dwattr $C$DW$489, DW_AT_decl_column(0x11)

$C$DW$490	.dwtag  DW_TAG_member
	.dwattr $C$DW$490, DW_AT_type(*$C$DW$T$27)
	.dwattr $C$DW$490, DW_AT_name("y_notch2")
	.dwattr $C$DW$490, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$490, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$490, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/spll/spll_1ph_notch.h")
	.dwattr $C$DW$490, DW_AT_decl_line(0x5a)
	.dwattr $C$DW$490, DW_AT_decl_column(0x11)

$C$DW$491	.dwtag  DW_TAG_member
	.dwattr $C$DW$491, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$491, DW_AT_name("ylf")
	.dwattr $C$DW$491, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
	.dwattr $C$DW$491, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$491, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/spll/spll_1ph_notch.h")
	.dwattr $C$DW$491, DW_AT_decl_line(0x5b)
	.dwattr $C$DW$491, DW_AT_decl_column(0x11)

$C$DW$492	.dwtag  DW_TAG_member
	.dwattr $C$DW$492, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$492, DW_AT_name("fo")
	.dwattr $C$DW$492, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
	.dwattr $C$DW$492, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$492, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/spll/spll_1ph_notch.h")
	.dwattr $C$DW$492, DW_AT_decl_line(0x5c)
	.dwattr $C$DW$492, DW_AT_decl_column(0x11)

$C$DW$493	.dwtag  DW_TAG_member
	.dwattr $C$DW$493, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$493, DW_AT_name("fn")
	.dwattr $C$DW$493, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
	.dwattr $C$DW$493, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$493, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/spll/spll_1ph_notch.h")
	.dwattr $C$DW$493, DW_AT_decl_line(0x5d)
	.dwattr $C$DW$493, DW_AT_decl_column(0x11)

$C$DW$494	.dwtag  DW_TAG_member
	.dwattr $C$DW$494, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$494, DW_AT_name("theta")
	.dwattr $C$DW$494, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
	.dwattr $C$DW$494, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$494, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/spll/spll_1ph_notch.h")
	.dwattr $C$DW$494, DW_AT_decl_line(0x5e)
	.dwattr $C$DW$494, DW_AT_decl_column(0x11)

$C$DW$495	.dwtag  DW_TAG_member
	.dwattr $C$DW$495, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$495, DW_AT_name("cosine")
	.dwattr $C$DW$495, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
	.dwattr $C$DW$495, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$495, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/spll/spll_1ph_notch.h")
	.dwattr $C$DW$495, DW_AT_decl_line(0x5f)
	.dwattr $C$DW$495, DW_AT_decl_column(0x11)

$C$DW$496	.dwtag  DW_TAG_member
	.dwattr $C$DW$496, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$496, DW_AT_name("sine")
	.dwattr $C$DW$496, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
	.dwattr $C$DW$496, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$496, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/spll/spll_1ph_notch.h")
	.dwattr $C$DW$496, DW_AT_decl_line(0x60)
	.dwattr $C$DW$496, DW_AT_decl_column(0x11)

$C$DW$497	.dwtag  DW_TAG_member
	.dwattr $C$DW$497, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$497, DW_AT_name("delta_t")
	.dwattr $C$DW$497, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
	.dwattr $C$DW$497, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$497, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/spll/spll_1ph_notch.h")
	.dwattr $C$DW$497, DW_AT_decl_line(0x61)
	.dwattr $C$DW$497, DW_AT_decl_column(0x11)

$C$DW$498	.dwtag  DW_TAG_member
	.dwattr $C$DW$498, DW_AT_type(*$C$DW$T$34)
	.dwattr $C$DW$498, DW_AT_name("notch_coeff")
	.dwattr $C$DW$498, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
	.dwattr $C$DW$498, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$498, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/spll/spll_1ph_notch.h")
	.dwattr $C$DW$498, DW_AT_decl_line(0x62)
	.dwattr $C$DW$498, DW_AT_decl_column(0x1a)

$C$DW$499	.dwtag  DW_TAG_member
	.dwattr $C$DW$499, DW_AT_type(*$C$DW$T$35)
	.dwattr $C$DW$499, DW_AT_name("lpf_coeff")
	.dwattr $C$DW$499, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
	.dwattr $C$DW$499, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$499, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/spll/spll_1ph_notch.h")
	.dwattr $C$DW$499, DW_AT_decl_line(0x63)
	.dwattr $C$DW$499, DW_AT_decl_column(0x1e)

	.dwattr $C$DW$T$36, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/spll/spll_1ph_notch.h")
	.dwattr $C$DW$T$36, DW_AT_decl_line(0x57)
	.dwattr $C$DW$T$36, DW_AT_decl_column(0x0f)
	.dwendtag $C$DW$T$36

	.dwendtag $C$DW$TU$36


$C$DW$TU$85	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$85
$C$DW$T$85	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$85, DW_AT_name("SPLL_1PH_NOTCH")
	.dwattr $C$DW$T$85, DW_AT_type(*$C$DW$T$36)
	.dwattr $C$DW$T$85, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/spll/spll_1ph_notch.h")
	.dwattr $C$DW$T$85, DW_AT_decl_line(0x64)
	.dwattr $C$DW$T$85, DW_AT_decl_column(0x03)

	.dwendtag $C$DW$TU$85


$C$DW$TU$37	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$37

$C$DW$T$37	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$37, DW_AT_byte_size(0x0e)
$C$DW$500	.dwtag  DW_TAG_member
	.dwattr $C$DW$500, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$500, DW_AT_name("osg_b0")
	.dwattr $C$DW$500, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$500, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/spll/spll_1ph_sogi_fll.h")
	.dwattr $C$DW$500, DW_AT_decl_line(0x41)
	.dwattr $C$DW$500, DW_AT_decl_column(0x0f)

$C$DW$501	.dwtag  DW_TAG_member
	.dwattr $C$DW$501, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$501, DW_AT_name("osg_b2")
	.dwattr $C$DW$501, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$501, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$501, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/spll/spll_1ph_sogi_fll.h")
	.dwattr $C$DW$501, DW_AT_decl_line(0x42)
	.dwattr $C$DW$501, DW_AT_decl_column(0x0f)

$C$DW$502	.dwtag  DW_TAG_member
	.dwattr $C$DW$502, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$502, DW_AT_name("osg_a1")
	.dwattr $C$DW$502, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$502, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$502, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/spll/spll_1ph_sogi_fll.h")
	.dwattr $C$DW$502, DW_AT_decl_line(0x43)
	.dwattr $C$DW$502, DW_AT_decl_column(0x0f)

$C$DW$503	.dwtag  DW_TAG_member
	.dwattr $C$DW$503, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$503, DW_AT_name("osg_a2")
	.dwattr $C$DW$503, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr $C$DW$503, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$503, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/spll/spll_1ph_sogi_fll.h")
	.dwattr $C$DW$503, DW_AT_decl_line(0x44)
	.dwattr $C$DW$503, DW_AT_decl_column(0x0f)

$C$DW$504	.dwtag  DW_TAG_member
	.dwattr $C$DW$504, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$504, DW_AT_name("osg_qb0")
	.dwattr $C$DW$504, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$504, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$504, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/spll/spll_1ph_sogi_fll.h")
	.dwattr $C$DW$504, DW_AT_decl_line(0x45)
	.dwattr $C$DW$504, DW_AT_decl_column(0x0f)

$C$DW$505	.dwtag  DW_TAG_member
	.dwattr $C$DW$505, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$505, DW_AT_name("osg_qb1")
	.dwattr $C$DW$505, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
	.dwattr $C$DW$505, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$505, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/spll/spll_1ph_sogi_fll.h")
	.dwattr $C$DW$505, DW_AT_decl_line(0x46)
	.dwattr $C$DW$505, DW_AT_decl_column(0x0f)

$C$DW$506	.dwtag  DW_TAG_member
	.dwattr $C$DW$506, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$506, DW_AT_name("osg_qb2")
	.dwattr $C$DW$506, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$506, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$506, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/spll/spll_1ph_sogi_fll.h")
	.dwattr $C$DW$506, DW_AT_decl_line(0x47)
	.dwattr $C$DW$506, DW_AT_decl_column(0x0f)

	.dwattr $C$DW$T$37, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/spll/spll_1ph_sogi_fll.h")
	.dwattr $C$DW$T$37, DW_AT_decl_line(0x40)
	.dwattr $C$DW$T$37, DW_AT_decl_column(0x18)
	.dwendtag $C$DW$T$37

	.dwendtag $C$DW$TU$37


$C$DW$TU$39	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$39
$C$DW$507	.dwtag  DW_TAG_TI_far_type
	.dwattr $C$DW$507, DW_AT_type(*$C$DW$T$37)

$C$DW$T$39	.dwtag  DW_TAG_volatile_type
	.dwattr $C$DW$T$39, DW_AT_type(*$C$DW$507)

	.dwendtag $C$DW$TU$39


$C$DW$TU$40	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$40
$C$DW$T$40	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$40, DW_AT_name("SPLL_1PH_SOGI_FLL_OSG_COEFF")
	.dwattr $C$DW$T$40, DW_AT_type(*$C$DW$T$39)
	.dwattr $C$DW$T$40, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/spll/spll_1ph_sogi_fll.h")
	.dwattr $C$DW$T$40, DW_AT_decl_line(0x48)
	.dwattr $C$DW$T$40, DW_AT_decl_column(0x03)

	.dwendtag $C$DW$TU$40


$C$DW$TU$38	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$38

$C$DW$T$38	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$38, DW_AT_byte_size(0x04)
$C$DW$508	.dwtag  DW_TAG_member
	.dwattr $C$DW$508, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$508, DW_AT_name("b1")
	.dwattr $C$DW$508, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$508, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/spll/spll_1ph_sogi_fll.h")
	.dwattr $C$DW$508, DW_AT_decl_line(0x4d)
	.dwattr $C$DW$508, DW_AT_decl_column(0x0f)

$C$DW$509	.dwtag  DW_TAG_member
	.dwattr $C$DW$509, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$509, DW_AT_name("b0")
	.dwattr $C$DW$509, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$509, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$509, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/spll/spll_1ph_sogi_fll.h")
	.dwattr $C$DW$509, DW_AT_decl_line(0x4e)
	.dwattr $C$DW$509, DW_AT_decl_column(0x0f)

	.dwattr $C$DW$T$38, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/spll/spll_1ph_sogi_fll.h")
	.dwattr $C$DW$T$38, DW_AT_decl_line(0x4c)
	.dwattr $C$DW$T$38, DW_AT_decl_column(0x0f)
	.dwendtag $C$DW$T$38

	.dwendtag $C$DW$TU$38


$C$DW$TU$41	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$41
$C$DW$T$41	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$41, DW_AT_name("SPLL_1PH_SOGI_FLL_LPF_COEFF")
	.dwattr $C$DW$T$41, DW_AT_type(*$C$DW$T$38)
	.dwattr $C$DW$T$41, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/spll/spll_1ph_sogi_fll.h")
	.dwattr $C$DW$T$41, DW_AT_decl_line(0x4f)
	.dwattr $C$DW$T$41, DW_AT_decl_column(0x03)

	.dwendtag $C$DW$TU$41


$C$DW$TU$42	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$42

$C$DW$T$42	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$42, DW_AT_byte_size(0x4a)
$C$DW$510	.dwtag  DW_TAG_member
	.dwattr $C$DW$510, DW_AT_type(*$C$DW$T$27)
	.dwattr $C$DW$510, DW_AT_name("u")
	.dwattr $C$DW$510, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$510, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/spll/spll_1ph_sogi_fll.h")
	.dwattr $C$DW$510, DW_AT_decl_line(0x5b)
	.dwattr $C$DW$510, DW_AT_decl_column(0x11)

$C$DW$511	.dwtag  DW_TAG_member
	.dwattr $C$DW$511, DW_AT_type(*$C$DW$T$27)
	.dwattr $C$DW$511, DW_AT_name("osg_u")
	.dwattr $C$DW$511, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr $C$DW$511, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$511, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/spll/spll_1ph_sogi_fll.h")
	.dwattr $C$DW$511, DW_AT_decl_line(0x5c)
	.dwattr $C$DW$511, DW_AT_decl_column(0x11)

$C$DW$512	.dwtag  DW_TAG_member
	.dwattr $C$DW$512, DW_AT_type(*$C$DW$T$27)
	.dwattr $C$DW$512, DW_AT_name("osg_qu")
	.dwattr $C$DW$512, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$512, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$512, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/spll/spll_1ph_sogi_fll.h")
	.dwattr $C$DW$512, DW_AT_decl_line(0x5d)
	.dwattr $C$DW$512, DW_AT_decl_column(0x11)

$C$DW$513	.dwtag  DW_TAG_member
	.dwattr $C$DW$513, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$513, DW_AT_name("u_Q")
	.dwattr $C$DW$513, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
	.dwattr $C$DW$513, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$513, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/spll/spll_1ph_sogi_fll.h")
	.dwattr $C$DW$513, DW_AT_decl_line(0x5e)
	.dwattr $C$DW$513, DW_AT_decl_column(0x11)

$C$DW$514	.dwtag  DW_TAG_member
	.dwattr $C$DW$514, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$514, DW_AT_name("u_D")
	.dwattr $C$DW$514, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
	.dwattr $C$DW$514, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$514, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/spll/spll_1ph_sogi_fll.h")
	.dwattr $C$DW$514, DW_AT_decl_line(0x5f)
	.dwattr $C$DW$514, DW_AT_decl_column(0x11)

$C$DW$515	.dwtag  DW_TAG_member
	.dwattr $C$DW$515, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$515, DW_AT_name("ylf")
	.dwattr $C$DW$515, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
	.dwattr $C$DW$515, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$515, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/spll/spll_1ph_sogi_fll.h")
	.dwattr $C$DW$515, DW_AT_decl_line(0x60)
	.dwattr $C$DW$515, DW_AT_decl_column(0x11)

$C$DW$516	.dwtag  DW_TAG_member
	.dwattr $C$DW$516, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$516, DW_AT_name("fo")
	.dwattr $C$DW$516, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
	.dwattr $C$DW$516, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$516, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/spll/spll_1ph_sogi_fll.h")
	.dwattr $C$DW$516, DW_AT_decl_line(0x61)
	.dwattr $C$DW$516, DW_AT_decl_column(0x11)

$C$DW$517	.dwtag  DW_TAG_member
	.dwattr $C$DW$517, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$517, DW_AT_name("fn")
	.dwattr $C$DW$517, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
	.dwattr $C$DW$517, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$517, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/spll/spll_1ph_sogi_fll.h")
	.dwattr $C$DW$517, DW_AT_decl_line(0x62)
	.dwattr $C$DW$517, DW_AT_decl_column(0x11)

$C$DW$518	.dwtag  DW_TAG_member
	.dwattr $C$DW$518, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$518, DW_AT_name("wc")
	.dwattr $C$DW$518, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
	.dwattr $C$DW$518, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$518, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/spll/spll_1ph_sogi_fll.h")
	.dwattr $C$DW$518, DW_AT_decl_line(0x63)
	.dwattr $C$DW$518, DW_AT_decl_column(0x11)

$C$DW$519	.dwtag  DW_TAG_member
	.dwattr $C$DW$519, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$519, DW_AT_name("theta")
	.dwattr $C$DW$519, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
	.dwattr $C$DW$519, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$519, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/spll/spll_1ph_sogi_fll.h")
	.dwattr $C$DW$519, DW_AT_decl_line(0x64)
	.dwattr $C$DW$519, DW_AT_decl_column(0x11)

$C$DW$520	.dwtag  DW_TAG_member
	.dwattr $C$DW$520, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$520, DW_AT_name("cosine")
	.dwattr $C$DW$520, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
	.dwattr $C$DW$520, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$520, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/spll/spll_1ph_sogi_fll.h")
	.dwattr $C$DW$520, DW_AT_decl_line(0x65)
	.dwattr $C$DW$520, DW_AT_decl_column(0x11)

$C$DW$521	.dwtag  DW_TAG_member
	.dwattr $C$DW$521, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$521, DW_AT_name("sine")
	.dwattr $C$DW$521, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
	.dwattr $C$DW$521, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$521, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/spll/spll_1ph_sogi_fll.h")
	.dwattr $C$DW$521, DW_AT_decl_line(0x66)
	.dwattr $C$DW$521, DW_AT_decl_column(0x11)

$C$DW$522	.dwtag  DW_TAG_member
	.dwattr $C$DW$522, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$522, DW_AT_name("delta_t")
	.dwattr $C$DW$522, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
	.dwattr $C$DW$522, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$522, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/spll/spll_1ph_sogi_fll.h")
	.dwattr $C$DW$522, DW_AT_decl_line(0x67)
	.dwattr $C$DW$522, DW_AT_decl_column(0x11)

$C$DW$523	.dwtag  DW_TAG_member
	.dwattr $C$DW$523, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$523, DW_AT_name("ef2")
	.dwattr $C$DW$523, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
	.dwattr $C$DW$523, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$523, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/spll/spll_1ph_sogi_fll.h")
	.dwattr $C$DW$523, DW_AT_decl_line(0x68)
	.dwattr $C$DW$523, DW_AT_decl_column(0x11)

$C$DW$524	.dwtag  DW_TAG_member
	.dwattr $C$DW$524, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$524, DW_AT_name("x3")
	.dwattr $C$DW$524, DW_AT_data_member_location[DW_OP_plus_uconst 0x2e]
	.dwattr $C$DW$524, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$524, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/spll/spll_1ph_sogi_fll.h")
	.dwattr $C$DW$524, DW_AT_decl_line(0x69)
	.dwattr $C$DW$524, DW_AT_decl_column(0x11)

$C$DW$525	.dwtag  DW_TAG_member
	.dwattr $C$DW$525, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$525, DW_AT_name("w_dash")
	.dwattr $C$DW$525, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
	.dwattr $C$DW$525, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$525, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/spll/spll_1ph_sogi_fll.h")
	.dwattr $C$DW$525, DW_AT_decl_line(0x6a)
	.dwattr $C$DW$525, DW_AT_decl_column(0x11)

$C$DW$526	.dwtag  DW_TAG_member
	.dwattr $C$DW$526, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$526, DW_AT_name("gamma")
	.dwattr $C$DW$526, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
	.dwattr $C$DW$526, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$526, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/spll/spll_1ph_sogi_fll.h")
	.dwattr $C$DW$526, DW_AT_decl_line(0x6b)
	.dwattr $C$DW$526, DW_AT_decl_column(0x11)

$C$DW$527	.dwtag  DW_TAG_member
	.dwattr $C$DW$527, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$527, DW_AT_name("k")
	.dwattr $C$DW$527, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
	.dwattr $C$DW$527, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$527, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/spll/spll_1ph_sogi_fll.h")
	.dwattr $C$DW$527, DW_AT_decl_line(0x6c)
	.dwattr $C$DW$527, DW_AT_decl_column(0x11)

$C$DW$528	.dwtag  DW_TAG_member
	.dwattr $C$DW$528, DW_AT_type(*$C$DW$T$40)
	.dwattr $C$DW$528, DW_AT_name("osg_coeff")
	.dwattr $C$DW$528, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
	.dwattr $C$DW$528, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$528, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/spll/spll_1ph_sogi_fll.h")
	.dwattr $C$DW$528, DW_AT_decl_line(0x6d)
	.dwattr $C$DW$528, DW_AT_decl_column(0x21)

$C$DW$529	.dwtag  DW_TAG_member
	.dwattr $C$DW$529, DW_AT_type(*$C$DW$T$41)
	.dwattr $C$DW$529, DW_AT_name("lpf_coeff")
	.dwattr $C$DW$529, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
	.dwattr $C$DW$529, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$529, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/spll/spll_1ph_sogi_fll.h")
	.dwattr $C$DW$529, DW_AT_decl_line(0x6e)
	.dwattr $C$DW$529, DW_AT_decl_column(0x21)

	.dwattr $C$DW$T$42, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/spll/spll_1ph_sogi_fll.h")
	.dwattr $C$DW$T$42, DW_AT_decl_line(0x5a)
	.dwattr $C$DW$T$42, DW_AT_decl_column(0x0f)
	.dwendtag $C$DW$T$42

	.dwendtag $C$DW$TU$42


$C$DW$TU$88	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$88
$C$DW$T$88	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$88, DW_AT_name("SPLL_1PH_SOGI_FLL")
	.dwattr $C$DW$T$88, DW_AT_type(*$C$DW$T$42)
	.dwattr $C$DW$T$88, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/spll/spll_1ph_sogi_fll.h")
	.dwattr $C$DW$T$88, DW_AT_decl_line(0x6f)
	.dwattr $C$DW$T$88, DW_AT_decl_column(0x03)

	.dwendtag $C$DW$TU$88


$C$DW$TU$45	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$45

$C$DW$T$45	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$45, DW_AT_byte_size(0x40)
$C$DW$530	.dwtag  DW_TAG_member
	.dwattr $C$DW$530, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$530, DW_AT_name("v")
	.dwattr $C$DW$530, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$530, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/power_measurement/power_meas_sine_analyzer.h")
	.dwattr $C$DW$530, DW_AT_decl_line(0x42)
	.dwattr $C$DW$530, DW_AT_decl_column(0x0f)

$C$DW$531	.dwtag  DW_TAG_member
	.dwattr $C$DW$531, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$531, DW_AT_name("i")
	.dwattr $C$DW$531, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$531, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$531, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/power_measurement/power_meas_sine_analyzer.h")
	.dwattr $C$DW$531, DW_AT_decl_line(0x43)
	.dwattr $C$DW$531, DW_AT_decl_column(0x0f)

$C$DW$532	.dwtag  DW_TAG_member
	.dwattr $C$DW$532, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$532, DW_AT_name("sampleFreq")
	.dwattr $C$DW$532, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$532, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$532, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/power_measurement/power_meas_sine_analyzer.h")
	.dwattr $C$DW$532, DW_AT_decl_line(0x44)
	.dwattr $C$DW$532, DW_AT_decl_column(0x0f)

$C$DW$533	.dwtag  DW_TAG_member
	.dwattr $C$DW$533, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$533, DW_AT_name("threshold")
	.dwattr $C$DW$533, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr $C$DW$533, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$533, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/power_measurement/power_meas_sine_analyzer.h")
	.dwattr $C$DW$533, DW_AT_decl_line(0x45)
	.dwattr $C$DW$533, DW_AT_decl_column(0x0f)

$C$DW$534	.dwtag  DW_TAG_member
	.dwattr $C$DW$534, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$534, DW_AT_name("vRms")
	.dwattr $C$DW$534, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$534, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$534, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/power_measurement/power_meas_sine_analyzer.h")
	.dwattr $C$DW$534, DW_AT_decl_line(0x46)
	.dwattr $C$DW$534, DW_AT_decl_column(0x0f)

$C$DW$535	.dwtag  DW_TAG_member
	.dwattr $C$DW$535, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$535, DW_AT_name("vAvg")
	.dwattr $C$DW$535, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
	.dwattr $C$DW$535, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$535, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/power_measurement/power_meas_sine_analyzer.h")
	.dwattr $C$DW$535, DW_AT_decl_line(0x47)
	.dwattr $C$DW$535, DW_AT_decl_column(0x0f)

$C$DW$536	.dwtag  DW_TAG_member
	.dwattr $C$DW$536, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$536, DW_AT_name("vEma")
	.dwattr $C$DW$536, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$536, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$536, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/power_measurement/power_meas_sine_analyzer.h")
	.dwattr $C$DW$536, DW_AT_decl_line(0x48)
	.dwattr $C$DW$536, DW_AT_decl_column(0x0f)

$C$DW$537	.dwtag  DW_TAG_member
	.dwattr $C$DW$537, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$537, DW_AT_name("acFreq")
	.dwattr $C$DW$537, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
	.dwattr $C$DW$537, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$537, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/power_measurement/power_meas_sine_analyzer.h")
	.dwattr $C$DW$537, DW_AT_decl_line(0x49)
	.dwattr $C$DW$537, DW_AT_decl_column(0x0f)

$C$DW$538	.dwtag  DW_TAG_member
	.dwattr $C$DW$538, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$538, DW_AT_name("acFreqAvg")
	.dwattr $C$DW$538, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$538, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$538, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/power_measurement/power_meas_sine_analyzer.h")
	.dwattr $C$DW$538, DW_AT_decl_line(0x4a)
	.dwattr $C$DW$538, DW_AT_decl_column(0x0f)

$C$DW$539	.dwtag  DW_TAG_member
	.dwattr $C$DW$539, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$539, DW_AT_name("iRms")
	.dwattr $C$DW$539, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
	.dwattr $C$DW$539, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$539, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/power_measurement/power_meas_sine_analyzer.h")
	.dwattr $C$DW$539, DW_AT_decl_line(0x4b)
	.dwattr $C$DW$539, DW_AT_decl_column(0x0f)

$C$DW$540	.dwtag  DW_TAG_member
	.dwattr $C$DW$540, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$540, DW_AT_name("pRms")
	.dwattr $C$DW$540, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr $C$DW$540, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$540, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/power_measurement/power_meas_sine_analyzer.h")
	.dwattr $C$DW$540, DW_AT_decl_line(0x4c)
	.dwattr $C$DW$540, DW_AT_decl_column(0x0f)

$C$DW$541	.dwtag  DW_TAG_member
	.dwattr $C$DW$541, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$541, DW_AT_name("vaRms")
	.dwattr $C$DW$541, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
	.dwattr $C$DW$541, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$541, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/power_measurement/power_meas_sine_analyzer.h")
	.dwattr $C$DW$541, DW_AT_decl_line(0x4d)
	.dwattr $C$DW$541, DW_AT_decl_column(0x0f)

$C$DW$542	.dwtag  DW_TAG_member
	.dwattr $C$DW$542, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$542, DW_AT_name("powerFactor")
	.dwattr $C$DW$542, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
	.dwattr $C$DW$542, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$542, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/power_measurement/power_meas_sine_analyzer.h")
	.dwattr $C$DW$542, DW_AT_decl_line(0x4e)
	.dwattr $C$DW$542, DW_AT_decl_column(0x0f)

$C$DW$543	.dwtag  DW_TAG_member
	.dwattr $C$DW$543, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$543, DW_AT_name("zcd")
	.dwattr $C$DW$543, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
	.dwattr $C$DW$543, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$543, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/power_measurement/power_meas_sine_analyzer.h")
	.dwattr $C$DW$543, DW_AT_decl_line(0x4f)
	.dwattr $C$DW$543, DW_AT_decl_column(0x0e)

$C$DW$544	.dwtag  DW_TAG_member
	.dwattr $C$DW$544, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$544, DW_AT_name("vSum")
	.dwattr $C$DW$544, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
	.dwattr $C$DW$544, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$544, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/power_measurement/power_meas_sine_analyzer.h")
	.dwattr $C$DW$544, DW_AT_decl_line(0x51)
	.dwattr $C$DW$544, DW_AT_decl_column(0x0f)

$C$DW$545	.dwtag  DW_TAG_member
	.dwattr $C$DW$545, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$545, DW_AT_name("vSqrSum")
	.dwattr $C$DW$545, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
	.dwattr $C$DW$545, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$545, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/power_measurement/power_meas_sine_analyzer.h")
	.dwattr $C$DW$545, DW_AT_decl_line(0x52)
	.dwattr $C$DW$545, DW_AT_decl_column(0x0f)

$C$DW$546	.dwtag  DW_TAG_member
	.dwattr $C$DW$546, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$546, DW_AT_name("iSqrSum")
	.dwattr $C$DW$546, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
	.dwattr $C$DW$546, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$546, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/power_measurement/power_meas_sine_analyzer.h")
	.dwattr $C$DW$546, DW_AT_decl_line(0x53)
	.dwattr $C$DW$546, DW_AT_decl_column(0x0f)

$C$DW$547	.dwtag  DW_TAG_member
	.dwattr $C$DW$547, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$547, DW_AT_name("acFreqSum")
	.dwattr $C$DW$547, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
	.dwattr $C$DW$547, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$547, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/power_measurement/power_meas_sine_analyzer.h")
	.dwattr $C$DW$547, DW_AT_decl_line(0x54)
	.dwattr $C$DW$547, DW_AT_decl_column(0x0f)

$C$DW$548	.dwtag  DW_TAG_member
	.dwattr $C$DW$548, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$548, DW_AT_name("pSum")
	.dwattr $C$DW$548, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
	.dwattr $C$DW$548, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$548, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/power_measurement/power_meas_sine_analyzer.h")
	.dwattr $C$DW$548, DW_AT_decl_line(0x55)
	.dwattr $C$DW$548, DW_AT_decl_column(0x0f)

$C$DW$549	.dwtag  DW_TAG_member
	.dwattr $C$DW$549, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$549, DW_AT_name("vaSumMul")
	.dwattr $C$DW$549, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
	.dwattr $C$DW$549, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$549, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/power_measurement/power_meas_sine_analyzer.h")
	.dwattr $C$DW$549, DW_AT_decl_line(0x56)
	.dwattr $C$DW$549, DW_AT_decl_column(0x0f)

$C$DW$550	.dwtag  DW_TAG_member
	.dwattr $C$DW$550, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$550, DW_AT_name("vNorm")
	.dwattr $C$DW$550, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
	.dwattr $C$DW$550, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$550, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/power_measurement/power_meas_sine_analyzer.h")
	.dwattr $C$DW$550, DW_AT_decl_line(0x57)
	.dwattr $C$DW$550, DW_AT_decl_column(0x0f)

$C$DW$551	.dwtag  DW_TAG_member
	.dwattr $C$DW$551, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$551, DW_AT_name("iNorm")
	.dwattr $C$DW$551, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
	.dwattr $C$DW$551, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$551, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/power_measurement/power_meas_sine_analyzer.h")
	.dwattr $C$DW$551, DW_AT_decl_line(0x58)
	.dwattr $C$DW$551, DW_AT_decl_column(0x0f)

$C$DW$552	.dwtag  DW_TAG_member
	.dwattr $C$DW$552, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$552, DW_AT_name("prevSign")
	.dwattr $C$DW$552, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
	.dwattr $C$DW$552, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$552, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/power_measurement/power_meas_sine_analyzer.h")
	.dwattr $C$DW$552, DW_AT_decl_line(0x59)
	.dwattr $C$DW$552, DW_AT_decl_column(0x0e)

$C$DW$553	.dwtag  DW_TAG_member
	.dwattr $C$DW$553, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$553, DW_AT_name("currSign")
	.dwattr $C$DW$553, DW_AT_data_member_location[DW_OP_plus_uconst 0x2d]
	.dwattr $C$DW$553, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$553, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/power_measurement/power_meas_sine_analyzer.h")
	.dwattr $C$DW$553, DW_AT_decl_line(0x5a)
	.dwattr $C$DW$553, DW_AT_decl_column(0x0e)

$C$DW$554	.dwtag  DW_TAG_member
	.dwattr $C$DW$554, DW_AT_type(*$C$DW$T$44)
	.dwattr $C$DW$554, DW_AT_name("nSamples")
	.dwattr $C$DW$554, DW_AT_data_member_location[DW_OP_plus_uconst 0x2e]
	.dwattr $C$DW$554, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$554, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/power_measurement/power_meas_sine_analyzer.h")
	.dwattr $C$DW$554, DW_AT_decl_line(0x5b)
	.dwattr $C$DW$554, DW_AT_decl_column(0x0e)

$C$DW$555	.dwtag  DW_TAG_member
	.dwattr $C$DW$555, DW_AT_type(*$C$DW$T$44)
	.dwattr $C$DW$555, DW_AT_name("nSamplesMin")
	.dwattr $C$DW$555, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
	.dwattr $C$DW$555, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$555, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/power_measurement/power_meas_sine_analyzer.h")
	.dwattr $C$DW$555, DW_AT_decl_line(0x5c)
	.dwattr $C$DW$555, DW_AT_decl_column(0x0e)

$C$DW$556	.dwtag  DW_TAG_member
	.dwattr $C$DW$556, DW_AT_type(*$C$DW$T$44)
	.dwattr $C$DW$556, DW_AT_name("nSamplesMax")
	.dwattr $C$DW$556, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
	.dwattr $C$DW$556, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$556, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/power_measurement/power_meas_sine_analyzer.h")
	.dwattr $C$DW$556, DW_AT_decl_line(0x5d)
	.dwattr $C$DW$556, DW_AT_decl_column(0x0e)

$C$DW$557	.dwtag  DW_TAG_member
	.dwattr $C$DW$557, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$557, DW_AT_name("inverse_nSamples")
	.dwattr $C$DW$557, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
	.dwattr $C$DW$557, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$557, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/power_measurement/power_meas_sine_analyzer.h")
	.dwattr $C$DW$557, DW_AT_decl_line(0x5e)
	.dwattr $C$DW$557, DW_AT_decl_column(0x0f)

$C$DW$558	.dwtag  DW_TAG_member
	.dwattr $C$DW$558, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$558, DW_AT_name("sqrt_inverse_nSamples")
	.dwattr $C$DW$558, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
	.dwattr $C$DW$558, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$558, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/power_measurement/power_meas_sine_analyzer.h")
	.dwattr $C$DW$558, DW_AT_decl_line(0x5f)
	.dwattr $C$DW$558, DW_AT_decl_column(0x0f)

$C$DW$559	.dwtag  DW_TAG_member
	.dwattr $C$DW$559, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$559, DW_AT_name("slewPowerUpdate")
	.dwattr $C$DW$559, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
	.dwattr $C$DW$559, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$559, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/power_measurement/power_meas_sine_analyzer.h")
	.dwattr $C$DW$559, DW_AT_decl_line(0x60)
	.dwattr $C$DW$559, DW_AT_decl_column(0x0e)

$C$DW$560	.dwtag  DW_TAG_member
	.dwattr $C$DW$560, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$560, DW_AT_name("pRmsSumMul")
	.dwattr $C$DW$560, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a]
	.dwattr $C$DW$560, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$560, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/power_measurement/power_meas_sine_analyzer.h")
	.dwattr $C$DW$560, DW_AT_decl_line(0x61)
	.dwattr $C$DW$560, DW_AT_decl_column(0x0f)

$C$DW$561	.dwtag  DW_TAG_member
	.dwattr $C$DW$561, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$561, DW_AT_name("jitterCount")
	.dwattr $C$DW$561, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
	.dwattr $C$DW$561, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$561, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/power_measurement/power_meas_sine_analyzer.h")
	.dwattr $C$DW$561, DW_AT_decl_line(0x62)
	.dwattr $C$DW$561, DW_AT_decl_column(0x0d)

$C$DW$562	.dwtag  DW_TAG_member
	.dwattr $C$DW$562, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$562, DW_AT_name("emaFilterMultiplier")
	.dwattr $C$DW$562, DW_AT_data_member_location[DW_OP_plus_uconst 0x3e]
	.dwattr $C$DW$562, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$562, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/power_measurement/power_meas_sine_analyzer.h")
	.dwattr $C$DW$562, DW_AT_decl_line(0x63)
	.dwattr $C$DW$562, DW_AT_decl_column(0x0f)

	.dwattr $C$DW$T$45, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/power_measurement/power_meas_sine_analyzer.h")
	.dwattr $C$DW$T$45, DW_AT_decl_line(0x41)
	.dwattr $C$DW$T$45, DW_AT_decl_column(0x19)
	.dwendtag $C$DW$T$45

	.dwendtag $C$DW$TU$45


$C$DW$TU$91	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$91
$C$DW$563	.dwtag  DW_TAG_TI_far_type
	.dwattr $C$DW$563, DW_AT_type(*$C$DW$T$45)

$C$DW$T$91	.dwtag  DW_TAG_volatile_type
	.dwattr $C$DW$T$91, DW_AT_type(*$C$DW$563)

	.dwendtag $C$DW$TU$91


$C$DW$TU$92	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$92
$C$DW$T$92	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$92, DW_AT_name("POWER_MEAS_SINE_ANALYZER")
	.dwattr $C$DW$T$92, DW_AT_type(*$C$DW$T$91)
	.dwattr $C$DW$T$92, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/power_measurement/power_meas_sine_analyzer.h")
	.dwattr $C$DW$T$92, DW_AT_decl_line(0x64)
	.dwattr $C$DW$T$92, DW_AT_decl_column(0x03)

	.dwendtag $C$DW$TU$92


$C$DW$TU$46	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$46

$C$DW$T$46	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$46, DW_AT_byte_size(0x20)
$C$DW$564	.dwtag  DW_TAG_member
	.dwattr $C$DW$564, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$564, DW_AT_name("h_magVect")
	.dwattr $C$DW$564, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$564, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/sfra/sfra_f32.h")
	.dwattr $C$DW$564, DW_AT_decl_line(0x40)
	.dwattr $C$DW$564, DW_AT_decl_column(0x10)

$C$DW$565	.dwtag  DW_TAG_member
	.dwattr $C$DW$565, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$565, DW_AT_name("h_phaseVect")
	.dwattr $C$DW$565, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$565, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$565, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/sfra/sfra_f32.h")
	.dwattr $C$DW$565, DW_AT_decl_line(0x41)
	.dwattr $C$DW$565, DW_AT_decl_column(0x10)

$C$DW$566	.dwtag  DW_TAG_member
	.dwattr $C$DW$566, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$566, DW_AT_name("gh_magVect")
	.dwattr $C$DW$566, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$566, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$566, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/sfra/sfra_f32.h")
	.dwattr $C$DW$566, DW_AT_decl_line(0x42)
	.dwattr $C$DW$566, DW_AT_decl_column(0x10)

$C$DW$567	.dwtag  DW_TAG_member
	.dwattr $C$DW$567, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$567, DW_AT_name("gh_phaseVect")
	.dwattr $C$DW$567, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr $C$DW$567, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$567, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/sfra/sfra_f32.h")
	.dwattr $C$DW$567, DW_AT_decl_line(0x43)
	.dwattr $C$DW$567, DW_AT_decl_column(0x10)

$C$DW$568	.dwtag  DW_TAG_member
	.dwattr $C$DW$568, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$568, DW_AT_name("cl_magVect")
	.dwattr $C$DW$568, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$568, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$568, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/sfra/sfra_f32.h")
	.dwattr $C$DW$568, DW_AT_decl_line(0x44)
	.dwattr $C$DW$568, DW_AT_decl_column(0x10)

$C$DW$569	.dwtag  DW_TAG_member
	.dwattr $C$DW$569, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$569, DW_AT_name("cl_phaseVect")
	.dwattr $C$DW$569, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
	.dwattr $C$DW$569, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$569, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/sfra/sfra_f32.h")
	.dwattr $C$DW$569, DW_AT_decl_line(0x45)
	.dwattr $C$DW$569, DW_AT_decl_column(0x10)

$C$DW$570	.dwtag  DW_TAG_member
	.dwattr $C$DW$570, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$570, DW_AT_name("freqVect")
	.dwattr $C$DW$570, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$570, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$570, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/sfra/sfra_f32.h")
	.dwattr $C$DW$570, DW_AT_decl_line(0x46)
	.dwattr $C$DW$570, DW_AT_decl_column(0x10)

$C$DW$571	.dwtag  DW_TAG_member
	.dwattr $C$DW$571, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$571, DW_AT_name("amplitude")
	.dwattr $C$DW$571, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
	.dwattr $C$DW$571, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$571, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/sfra/sfra_f32.h")
	.dwattr $C$DW$571, DW_AT_decl_line(0x47)
	.dwattr $C$DW$571, DW_AT_decl_column(0x0f)

$C$DW$572	.dwtag  DW_TAG_member
	.dwattr $C$DW$572, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$572, DW_AT_name("isrFreq")
	.dwattr $C$DW$572, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$572, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$572, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/sfra/sfra_f32.h")
	.dwattr $C$DW$572, DW_AT_decl_line(0x48)
	.dwattr $C$DW$572, DW_AT_decl_column(0x0f)

$C$DW$573	.dwtag  DW_TAG_member
	.dwattr $C$DW$573, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$573, DW_AT_name("freqStart")
	.dwattr $C$DW$573, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
	.dwattr $C$DW$573, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$573, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/sfra/sfra_f32.h")
	.dwattr $C$DW$573, DW_AT_decl_line(0x49)
	.dwattr $C$DW$573, DW_AT_decl_column(0x0f)

$C$DW$574	.dwtag  DW_TAG_member
	.dwattr $C$DW$574, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$574, DW_AT_name("freqStep")
	.dwattr $C$DW$574, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr $C$DW$574, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$574, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/sfra/sfra_f32.h")
	.dwattr $C$DW$574, DW_AT_decl_line(0x4a)
	.dwattr $C$DW$574, DW_AT_decl_column(0x0f)

$C$DW$575	.dwtag  DW_TAG_member
	.dwattr $C$DW$575, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$575, DW_AT_name("start")
	.dwattr $C$DW$575, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
	.dwattr $C$DW$575, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$575, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/sfra/sfra_f32.h")
	.dwattr $C$DW$575, DW_AT_decl_line(0x4b)
	.dwattr $C$DW$575, DW_AT_decl_column(0x0d)

$C$DW$576	.dwtag  DW_TAG_member
	.dwattr $C$DW$576, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$576, DW_AT_name("state")
	.dwattr $C$DW$576, DW_AT_data_member_location[DW_OP_plus_uconst 0x17]
	.dwattr $C$DW$576, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$576, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/sfra/sfra_f32.h")
	.dwattr $C$DW$576, DW_AT_decl_line(0x4c)
	.dwattr $C$DW$576, DW_AT_decl_column(0x0d)

$C$DW$577	.dwtag  DW_TAG_member
	.dwattr $C$DW$577, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$577, DW_AT_name("status")
	.dwattr $C$DW$577, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
	.dwattr $C$DW$577, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$577, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/sfra/sfra_f32.h")
	.dwattr $C$DW$577, DW_AT_decl_line(0x4d)
	.dwattr $C$DW$577, DW_AT_decl_column(0x0d)

$C$DW$578	.dwtag  DW_TAG_member
	.dwattr $C$DW$578, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$578, DW_AT_name("vecLength")
	.dwattr $C$DW$578, DW_AT_data_member_location[DW_OP_plus_uconst 0x19]
	.dwattr $C$DW$578, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$578, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/sfra/sfra_f32.h")
	.dwattr $C$DW$578, DW_AT_decl_line(0x4e)
	.dwattr $C$DW$578, DW_AT_decl_column(0x0d)

$C$DW$579	.dwtag  DW_TAG_member
	.dwattr $C$DW$579, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$579, DW_AT_name("freqIndex")
	.dwattr $C$DW$579, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
	.dwattr $C$DW$579, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$579, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/sfra/sfra_f32.h")
	.dwattr $C$DW$579, DW_AT_decl_line(0x4f)
	.dwattr $C$DW$579, DW_AT_decl_column(0x0d)

$C$DW$580	.dwtag  DW_TAG_member
	.dwattr $C$DW$580, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$580, DW_AT_name("storeH")
	.dwattr $C$DW$580, DW_AT_data_member_location[DW_OP_plus_uconst 0x1b]
	.dwattr $C$DW$580, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$580, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/sfra/sfra_f32.h")
	.dwattr $C$DW$580, DW_AT_decl_line(0x50)
	.dwattr $C$DW$580, DW_AT_decl_column(0x0d)

$C$DW$581	.dwtag  DW_TAG_member
	.dwattr $C$DW$581, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$581, DW_AT_name("storeGH")
	.dwattr $C$DW$581, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
	.dwattr $C$DW$581, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$581, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/sfra/sfra_f32.h")
	.dwattr $C$DW$581, DW_AT_decl_line(0x51)
	.dwattr $C$DW$581, DW_AT_decl_column(0x0d)

$C$DW$582	.dwtag  DW_TAG_member
	.dwattr $C$DW$582, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$582, DW_AT_name("storeCL")
	.dwattr $C$DW$582, DW_AT_data_member_location[DW_OP_plus_uconst 0x1d]
	.dwattr $C$DW$582, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$582, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/sfra/sfra_f32.h")
	.dwattr $C$DW$582, DW_AT_decl_line(0x52)
	.dwattr $C$DW$582, DW_AT_decl_column(0x0d)

$C$DW$583	.dwtag  DW_TAG_member
	.dwattr $C$DW$583, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$583, DW_AT_name("speed")
	.dwattr $C$DW$583, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
	.dwattr $C$DW$583, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$583, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/sfra/sfra_f32.h")
	.dwattr $C$DW$583, DW_AT_decl_line(0x53)
	.dwattr $C$DW$583, DW_AT_decl_column(0x0d)

	.dwattr $C$DW$T$46, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/sfra/sfra_f32.h")
	.dwattr $C$DW$T$46, DW_AT_decl_line(0x3f)
	.dwattr $C$DW$T$46, DW_AT_decl_column(0x0f)
	.dwendtag $C$DW$T$46

	.dwendtag $C$DW$TU$46


$C$DW$TU$94	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$94
$C$DW$T$94	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$94, DW_AT_name("SFRA_F32")
	.dwattr $C$DW$T$94, DW_AT_type(*$C$DW$T$46)
	.dwattr $C$DW$T$94, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/sfra/sfra_f32.h")
	.dwattr $C$DW$T$94, DW_AT_decl_line(0x54)
	.dwattr $C$DW$T$94, DW_AT_decl_column(0x02)

	.dwendtag $C$DW$TU$94


$C$DW$TU$95	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$95
$C$DW$T$95	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$95, DW_AT_type(*$C$DW$T$94)
	.dwattr $C$DW$T$95, DW_AT_address_class(0x20)

	.dwendtag $C$DW$TU$95


$C$DW$TU$48	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$48

$C$DW$T$48	.dwtag  DW_TAG_union_type
	.dwattr $C$DW$T$48, DW_AT_byte_size(0x02)
$C$DW$584	.dwtag  DW_TAG_member
	.dwattr $C$DW$584, DW_AT_type(*$C$DW$T$47)
	.dwattr $C$DW$584, DW_AT_name("enum_lab")
	.dwattr $C$DW$584, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$584, DW_AT_decl_file("..\ttplpfc\ttplpfc.h")
	.dwattr $C$DW$584, DW_AT_decl_line(0xca)
	.dwattr $C$DW$584, DW_AT_decl_column(0x06)

$C$DW$585	.dwtag  DW_TAG_member
	.dwattr $C$DW$585, DW_AT_type(*$C$DW$T$44)
	.dwattr $C$DW$585, DW_AT_name("pad")
	.dwattr $C$DW$585, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$585, DW_AT_decl_file("..\ttplpfc\ttplpfc.h")
	.dwattr $C$DW$585, DW_AT_decl_line(0xcb)
	.dwattr $C$DW$585, DW_AT_decl_column(0x0d)

	.dwattr $C$DW$T$48, DW_AT_decl_file("..\ttplpfc\ttplpfc.h")
	.dwattr $C$DW$T$48, DW_AT_decl_line(0xb5)
	.dwattr $C$DW$T$48, DW_AT_decl_column(0x0e)
	.dwendtag $C$DW$T$48

	.dwendtag $C$DW$TU$48


$C$DW$TU$97	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$97
$C$DW$T$97	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$97, DW_AT_name("TTPLPFC_Lab_EnumType")
	.dwattr $C$DW$T$97, DW_AT_type(*$C$DW$T$48)
	.dwattr $C$DW$T$97, DW_AT_decl_file("..\ttplpfc\ttplpfc.h")
	.dwattr $C$DW$T$97, DW_AT_decl_line(0xcc)
	.dwattr $C$DW$T$97, DW_AT_decl_column(0x02)

	.dwendtag $C$DW$TU$97


$C$DW$TU$50	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$50

$C$DW$T$50	.dwtag  DW_TAG_union_type
	.dwattr $C$DW$T$50, DW_AT_byte_size(0x02)
$C$DW$586	.dwtag  DW_TAG_member
	.dwattr $C$DW$586, DW_AT_type(*$C$DW$T$49)
	.dwattr $C$DW$586, DW_AT_name("enum_boardState")
	.dwattr $C$DW$586, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$586, DW_AT_decl_file("..\ttplpfc\ttplpfc.h")
	.dwattr $C$DW$586, DW_AT_decl_line(0xd8)
	.dwattr $C$DW$586, DW_AT_decl_column(0x06)

$C$DW$587	.dwtag  DW_TAG_member
	.dwattr $C$DW$587, DW_AT_type(*$C$DW$T$44)
	.dwattr $C$DW$587, DW_AT_name("pad")
	.dwattr $C$DW$587, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$587, DW_AT_decl_file("..\ttplpfc\ttplpfc.h")
	.dwattr $C$DW$587, DW_AT_decl_line(0xd9)
	.dwattr $C$DW$587, DW_AT_decl_column(0x0d)

	.dwattr $C$DW$T$50, DW_AT_decl_file("..\ttplpfc\ttplpfc.h")
	.dwattr $C$DW$T$50, DW_AT_decl_line(0xd0)
	.dwattr $C$DW$T$50, DW_AT_decl_column(0x0e)
	.dwendtag $C$DW$T$50

	.dwendtag $C$DW$TU$50


$C$DW$TU$98	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$98
$C$DW$T$98	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$98, DW_AT_name("TTPLPFC_boardState")
	.dwattr $C$DW$T$98, DW_AT_type(*$C$DW$T$50)
	.dwattr $C$DW$T$98, DW_AT_decl_file("..\ttplpfc\ttplpfc.h")
	.dwattr $C$DW$T$98, DW_AT_decl_line(0xda)
	.dwattr $C$DW$T$98, DW_AT_decl_column(0x02)

	.dwendtag $C$DW$TU$98


$C$DW$TU$52	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$52

$C$DW$T$52	.dwtag  DW_TAG_union_type
	.dwattr $C$DW$T$52, DW_AT_byte_size(0x02)
$C$DW$588	.dwtag  DW_TAG_member
	.dwattr $C$DW$588, DW_AT_type(*$C$DW$T$51)
	.dwattr $C$DW$588, DW_AT_name("enum_boardStatus")
	.dwattr $C$DW$588, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$588, DW_AT_decl_file("..\ttplpfc\ttplpfc.h")
	.dwattr $C$DW$588, DW_AT_decl_line(0xec)
	.dwattr $C$DW$588, DW_AT_decl_column(0x06)

$C$DW$589	.dwtag  DW_TAG_member
	.dwattr $C$DW$589, DW_AT_type(*$C$DW$T$44)
	.dwattr $C$DW$589, DW_AT_name("pad")
	.dwattr $C$DW$589, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$589, DW_AT_decl_file("..\ttplpfc\ttplpfc.h")
	.dwattr $C$DW$589, DW_AT_decl_line(0xed)
	.dwattr $C$DW$589, DW_AT_decl_column(0x0d)

	.dwattr $C$DW$T$52, DW_AT_decl_file("..\ttplpfc\ttplpfc.h")
	.dwattr $C$DW$T$52, DW_AT_decl_line(0xde)
	.dwattr $C$DW$T$52, DW_AT_decl_column(0x0e)
	.dwendtag $C$DW$T$52

	.dwendtag $C$DW$TU$52


$C$DW$TU$99	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$99
$C$DW$T$99	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$99, DW_AT_name("TTPLPFC_boardStatus")
	.dwattr $C$DW$T$99, DW_AT_type(*$C$DW$T$52)
	.dwattr $C$DW$T$99, DW_AT_decl_file("..\ttplpfc\ttplpfc.h")
	.dwattr $C$DW$T$99, DW_AT_decl_line(0xee)
	.dwattr $C$DW$T$99, DW_AT_decl_column(0x02)

	.dwendtag $C$DW$TU$99


$C$DW$TU$54	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$54

$C$DW$T$54	.dwtag  DW_TAG_union_type
	.dwattr $C$DW$T$54, DW_AT_byte_size(0x02)
$C$DW$590	.dwtag  DW_TAG_member
	.dwattr $C$DW$590, DW_AT_type(*$C$DW$T$53)
	.dwattr $C$DW$590, DW_AT_name("enum_pwmSwState")
	.dwattr $C$DW$590, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$590, DW_AT_decl_file("..\ttplpfc\ttplpfc.h")
	.dwattr $C$DW$590, DW_AT_decl_line(0xff)
	.dwattr $C$DW$590, DW_AT_decl_column(0x06)

$C$DW$591	.dwtag  DW_TAG_member
	.dwattr $C$DW$591, DW_AT_type(*$C$DW$T$44)
	.dwattr $C$DW$591, DW_AT_name("pad")
	.dwattr $C$DW$591, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$591, DW_AT_decl_file("..\ttplpfc\ttplpfc.h")
	.dwattr $C$DW$591, DW_AT_decl_line(0x100)
	.dwattr $C$DW$591, DW_AT_decl_column(0x0d)

	.dwattr $C$DW$T$54, DW_AT_decl_file("..\ttplpfc\ttplpfc.h")
	.dwattr $C$DW$T$54, DW_AT_decl_line(0xf2)
	.dwattr $C$DW$T$54, DW_AT_decl_column(0x0e)
	.dwendtag $C$DW$T$54

	.dwendtag $C$DW$TU$54


$C$DW$TU$100	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$100
$C$DW$T$100	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$100, DW_AT_name("TTPLPFC_pwmSwState")
	.dwattr $C$DW$T$100, DW_AT_type(*$C$DW$T$54)
	.dwattr $C$DW$T$100, DW_AT_decl_file("..\ttplpfc\ttplpfc.h")
	.dwattr $C$DW$T$100, DW_AT_decl_line(0x101)
	.dwattr $C$DW$T$100, DW_AT_decl_column(0x02)

	.dwendtag $C$DW$TU$100


$C$DW$TU$56	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$56

$C$DW$T$56	.dwtag  DW_TAG_union_type
	.dwattr $C$DW$T$56, DW_AT_byte_size(0x02)
$C$DW$592	.dwtag  DW_TAG_member
	.dwattr $C$DW$592, DW_AT_type(*$C$DW$T$55)
	.dwattr $C$DW$592, DW_AT_name("enum_interleavingState")
	.dwattr $C$DW$592, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$592, DW_AT_decl_file("..\ttplpfc\ttplpfc.h")
	.dwattr $C$DW$592, DW_AT_decl_line(0x10b)
	.dwattr $C$DW$592, DW_AT_decl_column(0x06)

$C$DW$593	.dwtag  DW_TAG_member
	.dwattr $C$DW$593, DW_AT_type(*$C$DW$T$44)
	.dwattr $C$DW$593, DW_AT_name("pad")
	.dwattr $C$DW$593, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$593, DW_AT_decl_file("..\ttplpfc\ttplpfc.h")
	.dwattr $C$DW$593, DW_AT_decl_line(0x10c)
	.dwattr $C$DW$593, DW_AT_decl_column(0x0d)

	.dwattr $C$DW$T$56, DW_AT_decl_file("..\ttplpfc\ttplpfc.h")
	.dwattr $C$DW$T$56, DW_AT_decl_line(0x105)
	.dwattr $C$DW$T$56, DW_AT_decl_column(0x0e)
	.dwendtag $C$DW$T$56

	.dwendtag $C$DW$TU$56


$C$DW$TU$101	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$101
$C$DW$T$101	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$101, DW_AT_name("TTPLPFC_interleavingState")
	.dwattr $C$DW$T$101, DW_AT_type(*$C$DW$T$56)
	.dwattr $C$DW$T$101, DW_AT_decl_file("..\ttplpfc\ttplpfc.h")
	.dwattr $C$DW$T$101, DW_AT_decl_line(0x10d)
	.dwattr $C$DW$T$101, DW_AT_decl_column(0x02)

	.dwendtag $C$DW$TU$101


$C$DW$TU$58	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$58

$C$DW$T$58	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$58, DW_AT_name("_Complex_double")
	.dwattr $C$DW$T$58, DW_AT_byte_size(0x08)
$C$DW$594	.dwtag  DW_TAG_member
	.dwattr $C$DW$594, DW_AT_type(*$C$DW$T$57)
	.dwattr $C$DW$594, DW_AT_name("_Vals")
	.dwattr $C$DW$594, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$594, DW_AT_decl_file("..\ttplpfc\ttplpfc_hal.h")
	.dwattr $C$DW$594, DW_AT_decl_line(0x192)
	.dwattr $C$DW$594, DW_AT_decl_column(0x14)

	.dwendtag $C$DW$T$58

	.dwendtag $C$DW$TU$58


$C$DW$TU$102	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$102
$C$DW$T$102	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$102, DW_AT_name("_Complex_double")
	.dwattr $C$DW$T$102, DW_AT_type(*$C$DW$T$58)
	.dwattr $C$DW$T$102, DW_AT_decl_file("..\ttplpfc\ttplpfc_hal.h")
	.dwattr $C$DW$T$102, DW_AT_decl_line(0x192)
	.dwattr $C$DW$T$102, DW_AT_decl_column(0x14)

	.dwendtag $C$DW$TU$102


$C$DW$TU$60	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$60

$C$DW$T$60	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$60, DW_AT_name("_Complex_float")
	.dwattr $C$DW$T$60, DW_AT_byte_size(0x04)
$C$DW$595	.dwtag  DW_TAG_member
	.dwattr $C$DW$595, DW_AT_type(*$C$DW$T$59)
	.dwattr $C$DW$595, DW_AT_name("_Vals")
	.dwattr $C$DW$595, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$595, DW_AT_decl_file("..\ttplpfc\ttplpfc_hal.h")
	.dwattr $C$DW$595, DW_AT_decl_line(0x192)
	.dwattr $C$DW$595, DW_AT_decl_column(0x14)

	.dwendtag $C$DW$T$60

	.dwendtag $C$DW$TU$60


$C$DW$TU$103	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$103
$C$DW$T$103	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$103, DW_AT_name("_Complex_float")
	.dwattr $C$DW$T$103, DW_AT_type(*$C$DW$T$60)
	.dwattr $C$DW$T$103, DW_AT_decl_file("..\ttplpfc\ttplpfc_hal.h")
	.dwattr $C$DW$T$103, DW_AT_decl_line(0x192)
	.dwattr $C$DW$T$103, DW_AT_decl_column(0x14)

	.dwendtag $C$DW$TU$103


$C$DW$TU$62	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$62

$C$DW$T$62	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$62, DW_AT_name("_Complex_long_double")
	.dwattr $C$DW$T$62, DW_AT_byte_size(0x08)
$C$DW$596	.dwtag  DW_TAG_member
	.dwattr $C$DW$596, DW_AT_type(*$C$DW$T$61)
	.dwattr $C$DW$596, DW_AT_name("_Vals")
	.dwattr $C$DW$596, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$596, DW_AT_decl_file("..\ttplpfc\ttplpfc_hal.h")
	.dwattr $C$DW$596, DW_AT_decl_line(0x192)
	.dwattr $C$DW$596, DW_AT_decl_column(0x14)

	.dwendtag $C$DW$T$62

	.dwendtag $C$DW$TU$62


$C$DW$TU$105	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$105
$C$DW$T$105	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$105, DW_AT_name("_Complex_long_double")
	.dwattr $C$DW$T$105, DW_AT_type(*$C$DW$T$62)
	.dwattr $C$DW$T$105, DW_AT_decl_file("..\ttplpfc\ttplpfc_hal.h")
	.dwattr $C$DW$T$105, DW_AT_decl_line(0x192)
	.dwattr $C$DW$T$105, DW_AT_decl_column(0x14)

	.dwendtag $C$DW$TU$105


$C$DW$TU$2	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$2
$C$DW$T$2	.dwtag  DW_TAG_unspecified_type
	.dwattr $C$DW$T$2, DW_AT_name("void")

	.dwendtag $C$DW$TU$2


$C$DW$TU$4	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$4
$C$DW$T$4	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
	.dwattr $C$DW$T$4, DW_AT_name("bool")
	.dwattr $C$DW$T$4, DW_AT_byte_size(0x01)

	.dwendtag $C$DW$TU$4


$C$DW$TU$5	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$5
$C$DW$T$5	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
	.dwattr $C$DW$T$5, DW_AT_name("signed char")
	.dwattr $C$DW$T$5, DW_AT_byte_size(0x01)

	.dwendtag $C$DW$TU$5


$C$DW$TU$6	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$6
$C$DW$T$6	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
	.dwattr $C$DW$T$6, DW_AT_name("unsigned char")
	.dwattr $C$DW$T$6, DW_AT_byte_size(0x01)

	.dwendtag $C$DW$TU$6


$C$DW$TU$7	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$7
$C$DW$T$7	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$7, DW_AT_encoding(DW_ATE_signed_char)
	.dwattr $C$DW$T$7, DW_AT_name("wchar_t")
	.dwattr $C$DW$T$7, DW_AT_byte_size(0x02)

	.dwendtag $C$DW$TU$7


$C$DW$TU$8	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$8
$C$DW$T$8	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$8, DW_AT_encoding(DW_ATE_signed)
	.dwattr $C$DW$T$8, DW_AT_name("short")
	.dwattr $C$DW$T$8, DW_AT_byte_size(0x01)

	.dwendtag $C$DW$TU$8


$C$DW$TU$9	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$9
$C$DW$T$9	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$9, DW_AT_encoding(DW_ATE_unsigned)
	.dwattr $C$DW$T$9, DW_AT_name("unsigned short")
	.dwattr $C$DW$T$9, DW_AT_byte_size(0x01)

	.dwendtag $C$DW$TU$9


$C$DW$TU$10	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$10
$C$DW$T$10	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$10, DW_AT_encoding(DW_ATE_signed)
	.dwattr $C$DW$T$10, DW_AT_name("int")
	.dwattr $C$DW$T$10, DW_AT_byte_size(0x01)

	.dwendtag $C$DW$TU$10


$C$DW$TU$21	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$21
$C$DW$T$21	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$21, DW_AT_name("__int16_t")
	.dwattr $C$DW$T$21, DW_AT_type(*$C$DW$T$10)
	.dwattr $C$DW$T$21, DW_AT_decl_file("C:/ti/ccs1210/ccs/tools/compiler/ti-cgt-c2000_22.6.0.LTS/include/machine/_types.h")
	.dwattr $C$DW$T$21, DW_AT_decl_line(0x40)
	.dwattr $C$DW$T$21, DW_AT_decl_column(0x1d)

	.dwendtag $C$DW$TU$21


$C$DW$TU$22	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$22
$C$DW$T$22	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$22, DW_AT_name("int16_t")
	.dwattr $C$DW$T$22, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$T$22, DW_AT_decl_file("C:/ti/ccs1210/ccs/tools/compiler/ti-cgt-c2000_22.6.0.LTS/include/sys/_stdint.h")
	.dwattr $C$DW$T$22, DW_AT_decl_line(0x2b)
	.dwattr $C$DW$T$22, DW_AT_decl_column(0x14)

	.dwendtag $C$DW$TU$22


$C$DW$TU$11	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$11
$C$DW$T$11	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$11, DW_AT_encoding(DW_ATE_unsigned)
	.dwattr $C$DW$T$11, DW_AT_name("unsigned int")
	.dwattr $C$DW$T$11, DW_AT_byte_size(0x01)

	.dwendtag $C$DW$TU$11


$C$DW$TU$107	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$107
$C$DW$T$107	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$107, DW_AT_name("__uint16_t")
	.dwattr $C$DW$T$107, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$T$107, DW_AT_decl_file("C:/ti/ccs1210/ccs/tools/compiler/ti-cgt-c2000_22.6.0.LTS/include/machine/_types.h")
	.dwattr $C$DW$T$107, DW_AT_decl_line(0x41)
	.dwattr $C$DW$T$107, DW_AT_decl_column(0x1c)

	.dwendtag $C$DW$TU$107


$C$DW$TU$108	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$108
$C$DW$T$108	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$108, DW_AT_name("uint16_t")
	.dwattr $C$DW$T$108, DW_AT_type(*$C$DW$T$107)
	.dwattr $C$DW$T$108, DW_AT_decl_file("C:/ti/ccs1210/ccs/tools/compiler/ti-cgt-c2000_22.6.0.LTS/include/sys/_stdint.h")
