;***************************************************************
;* TMS320C2000 G3 C/C++ Codegen                               PC v22.6.0.LTS *
;* Date/Time created: Tue Dec 20 15:55:15 2022                 *
;***************************************************************
	.compiler_opts --abi=eabi --cla_support=cla2 --diag_wrap=off --float_support=fpu64 --hll_source=on --mem_model:code=flat --mem_model:data=large --object_format=elf --quiet --silicon_errata_fpu1_workaround=off --silicon_version=28 --symdebug:dwarf --symdebug:dwarf_version=4 --tmu_support=tmu0 --vcu_support=vcu2 
	.asg	XAR2, FP

$C$DW$CU	.dwtag  DW_TAG_compile_unit
	.dwattr $C$DW$CU, DW_AT_name("../ttplpfc/ttplpfc_hal.c")
	.dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 G3 C/C++ Codegen PC v22.6.0.LTS Copyright (c) 1996-2018 Texas Instruments Incorporated")
	.dwattr $C$DW$CU, DW_AT_TI_version(0x01)
	.dwattr $C$DW$CU, DW_AT_comp_dir("C:\Users\gerar\workspace_v12\7.4kW_OBC_F28003x\RELEASE")

$C$DW$1	.dwtag  DW_TAG_subprogram
	.dwattr $C$DW$1, DW_AT_name("Device_init")
	.dwattr $C$DW$1, DW_AT_linkage_name("Device_init")
	.dwattr $C$DW$1, DW_AT_declaration
	.dwattr $C$DW$1, DW_AT_external
	.dwattr $C$DW$1, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/device/device.h")
	.dwattr $C$DW$1, DW_AT_decl_line(0x17c)
	.dwattr $C$DW$1, DW_AT_decl_column(0x0d)
	.dwendtag $C$DW$1


$C$DW$2	.dwtag  DW_TAG_subprogram
	.dwattr $C$DW$2, DW_AT_name("Device_initGPIO")

	.dwattr $C$DW$828, DW_AT_decl_file("C:\Users\gerar\workspace_v12\7.4kW_OBC_F28003x\device\driverlib\xbar.h")
	.dwattr $C$DW$828, DW_AT_decl_line(0x2a5)
	.dwattr $C$DW$828, DW_AT_decl_column(0x05)

$C$DW$829	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$829, DW_AT_name("XBAR_INPUT_FLG_ERRORSTS_ERROR")
	.dwattr $C$DW$829, DW_AT_const_value(0x31c)
	.dwattr $C$DW$829, DW_AT_decl_file("C:\Users\gerar\workspace_v12\7.4kW_OBC_F28003x\device\driverlib\xbar.h")
	.dwattr $C$DW$829, DW_AT_decl_line(0x2a6)
	.dwattr $C$DW$829, DW_AT_decl_column(0x05)

$C$DW$830	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$830, DW_AT_name("XBAR_INPUT_FLG_CLAHALT")
	.dwattr $C$DW$830, DW_AT_const_value(0x31f)
	.dwattr $C$DW$830, DW_AT_decl_file("C:\Users\gerar\workspace_v12\7.4kW_OBC_F28003x\device\driverlib\xbar.h")
	.dwattr $C$DW$830, DW_AT_decl_line(0x2a7)
	.dwattr $C$DW$830, DW_AT_decl_column(0x05)

	.dwattr $C$DW$T$123, DW_AT_decl_file("C:\Users\gerar\workspace_v12\7.4kW_OBC_F28003x\device\driverlib\xbar.h")
	.dwattr $C$DW$T$123, DW_AT_decl_line(0x241)
	.dwattr $C$DW$T$123, DW_AT_decl_column(0x01)
	.dwendtag $C$DW$T$123

	.dwendtag $C$DW$TU$123


$C$DW$TU$124	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$124
$C$DW$T$124	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$124, DW_AT_name("XBAR_InputFlag")
	.dwattr $C$DW$T$124, DW_AT_type(*$C$DW$T$123)
	.dwattr $C$DW$T$124, DW_AT_decl_file("C:\Users\gerar\workspace_v12\7.4kW_OBC_F28003x\device\driverlib\xbar.h")
	.dwattr $C$DW$T$124, DW_AT_decl_line(0x2a8)
	.dwattr $C$DW$T$124, DW_AT_decl_column(0x03)

	.dwendtag $C$DW$TU$124


$C$DW$TU$125	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$125

$C$DW$T$125	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$125, DW_AT_byte_size(0x01)
$C$DW$831	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$831, DW_AT_name("GPIO_DIR_MODE_IN")
	.dwattr $C$DW$831, DW_AT_const_value(0x00)
	.dwattr $C$DW$831, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/device/driverlib/gpio.h")
	.dwattr $C$DW$831, DW_AT_decl_line(0x7f)
	.dwattr $C$DW$831, DW_AT_decl_column(0x05)

$C$DW$832	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$832, DW_AT_name("GPIO_DIR_MODE_OUT")
	.dwattr $C$DW$832, DW_AT_const_value(0x01)
	.dwattr $C$DW$832, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/device/driverlib/gpio.h")
	.dwattr $C$DW$832, DW_AT_decl_line(0x80)
	.dwattr $C$DW$832, DW_AT_decl_column(0x05)

	.dwattr $C$DW$T$125, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/device/driverlib/gpio.h")
	.dwattr $C$DW$T$125, DW_AT_decl_line(0x7e)
	.dwattr $C$DW$T$125, DW_AT_decl_column(0x01)
	.dwendtag $C$DW$T$125

	.dwendtag $C$DW$TU$125


$C$DW$TU$126	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$126
$C$DW$T$126	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$126, DW_AT_name("GPIO_Direction")
	.dwattr $C$DW$T$126, DW_AT_type(*$C$DW$T$125)
	.dwattr $C$DW$T$126, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/device/driverlib/gpio.h")
	.dwattr $C$DW$T$126, DW_AT_decl_line(0x81)
	.dwattr $C$DW$T$126, DW_AT_decl_column(0x03)

	.dwendtag $C$DW$TU$126


$C$DW$TU$127	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$127

$C$DW$T$127	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$127, DW_AT_byte_size(0x01)
$C$DW$833	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$833, DW_AT_name("GPIO_QUAL_SYNC")
	.dwattr $C$DW$833, DW_AT_const_value(0x00)
	.dwattr $C$DW$833, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/device/driverlib/gpio.h")
	.dwattr $C$DW$833, DW_AT_decl_line(0x98)
	.dwattr $C$DW$833, DW_AT_decl_column(0x05)

$C$DW$834	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$834, DW_AT_name("GPIO_QUAL_3SAMPLE")
	.dwattr $C$DW$834, DW_AT_const_value(0x01)
	.dwattr $C$DW$834, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/device/driverlib/gpio.h")
	.dwattr $C$DW$834, DW_AT_decl_line(0x99)
	.dwattr $C$DW$834, DW_AT_decl_column(0x05)

$C$DW$835	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$835, DW_AT_name("GPIO_QUAL_6SAMPLE")
	.dwattr $C$DW$835, DW_AT_const_value(0x02)
	.dwattr $C$DW$835, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/device/driverlib/gpio.h")
	.dwattr $C$DW$835, DW_AT_decl_line(0x9a)
	.dwattr $C$DW$835, DW_AT_decl_column(0x05)

$C$DW$836	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$836, DW_AT_name("GPIO_QUAL_ASYNC")
	.dwattr $C$DW$836, DW_AT_const_value(0x03)
	.dwattr $C$DW$836, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/device/driverlib/gpio.h")
	.dwattr $C$DW$836, DW_AT_decl_line(0x9b)
	.dwattr $C$DW$836, DW_AT_decl_column(0x05)

	.dwattr $C$DW$T$127, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/device/driverlib/gpio.h")
	.dwattr $C$DW$T$127, DW_AT_decl_line(0x97)
	.dwattr $C$DW$T$127, DW_AT_decl_column(0x01)
	.dwendtag $C$DW$T$127

	.dwendtag $C$DW$TU$127


$C$DW$TU$128	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$128
$C$DW$T$128	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$128, DW_AT_name("GPIO_QualificationMode")
	.dwattr $C$DW$T$128, DW_AT_type(*$C$DW$T$127)
	.dwattr $C$DW$T$128, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/device/driverlib/gpio.h")
	.dwattr $C$DW$T$128, DW_AT_decl_line(0x9c)
	.dwattr $C$DW$T$128, DW_AT_decl_column(0x03)

	.dwendtag $C$DW$TU$128


$C$DW$TU$20	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$20

$C$DW$T$20	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$20, DW_AT_byte_size(0x18)
$C$DW$837	.dwtag  DW_TAG_member
	.dwattr $C$DW$837, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$837, DW_AT_name("TTPLPFC_PH1_H_TEMP")
	.dwattr $C$DW$837, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$837, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/ttplpfc/ttplpfc_hal.h")
	.dwattr $C$DW$837, DW_AT_decl_line(0x2d)
	.dwattr $C$DW$837, DW_AT_decl_column(0x13)

$C$DW$838	.dwtag  DW_TAG_member
	.dwattr $C$DW$838, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$838, DW_AT_name("TTPLPFC_PH1_L_TEMP")
	.dwattr $C$DW$838, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$838, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$838, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/ttplpfc/ttplpfc_hal.h")
	.dwattr $C$DW$838, DW_AT_decl_line(0x2e)
	.dwattr $C$DW$838, DW_AT_decl_column(0x13)

$C$DW$839	.dwtag  DW_TAG_member
	.dwattr $C$DW$839, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$839, DW_AT_name("TTPLPFC_PH2_L_TEMP")
	.dwattr $C$DW$839, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$839, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$839, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/ttplpfc/ttplpfc_hal.h")
	.dwattr $C$DW$839, DW_AT_decl_line(0x2f)
	.dwattr $C$DW$839, DW_AT_decl_column(0x13)

$C$DW$840	.dwtag  DW_TAG_member
	.dwattr $C$DW$840, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$840, DW_AT_name("TTPLPFC_PH2_H_TEMP")
	.dwattr $C$DW$840, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr $C$DW$840, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$840, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/ttplpfc/ttplpfc_hal.h")
	.dwattr $C$DW$840, DW_AT_decl_line(0x30)
	.dwattr $C$DW$840, DW_AT_decl_column(0x13)

$C$DW$841	.dwtag  DW_TAG_member
	.dwattr $C$DW$841, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$841, DW_AT_name("CLLLC_PRIM_LEG1_H_TEMP")
	.dwattr $C$DW$841, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$841, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$841, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/ttplpfc/ttplpfc_hal.h")
	.dwattr $C$DW$841, DW_AT_decl_line(0x31)
	.dwattr $C$DW$841, DW_AT_decl_column(0x13)

$C$DW$842	.dwtag  DW_TAG_member
	.dwattr $C$DW$842, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$842, DW_AT_name("CLLLC_PRIM_LEG1_L_TEMP")
	.dwattr $C$DW$842, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
	.dwattr $C$DW$842, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$842, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/ttplpfc/ttplpfc_hal.h")
	.dwattr $C$DW$842, DW_AT_decl_line(0x32)
	.dwattr $C$DW$842, DW_AT_decl_column(0x13)

$C$DW$843	.dwtag  DW_TAG_member
	.dwattr $C$DW$843, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$843, DW_AT_name("CLLLC_PRIM_LEG2_L_TEMP")
	.dwattr $C$DW$843, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$843, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$843, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/ttplpfc/ttplpfc_hal.h")
	.dwattr $C$DW$843, DW_AT_decl_line(0x33)
	.dwattr $C$DW$843, DW_AT_decl_column(0x13)

$C$DW$844	.dwtag  DW_TAG_member
	.dwattr $C$DW$844, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$844, DW_AT_name("CLLLC_PRIM_LEG2_H_TEMP")
	.dwattr $C$DW$844, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
	.dwattr $C$DW$844, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$844, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/ttplpfc/ttplpfc_hal.h")
	.dwattr $C$DW$844, DW_AT_decl_line(0x34)
	.dwattr $C$DW$844, DW_AT_decl_column(0x13)

$C$DW$845	.dwtag  DW_TAG_member
	.dwattr $C$DW$845, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$845, DW_AT_name("CLLLC_SEC_LEG1_H_TEMP")
	.dwattr $C$DW$845, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$845, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$845, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/ttplpfc/ttplpfc_hal.h")
	.dwattr $C$DW$845, DW_AT_decl_line(0x35)
	.dwattr $C$DW$845, DW_AT_decl_column(0x13)

$C$DW$846	.dwtag  DW_TAG_member
	.dwattr $C$DW$846, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$846, DW_AT_name("CLLLC_SEC_LEG1_L_TEMP")
	.dwattr $C$DW$846, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
	.dwattr $C$DW$846, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$846, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/ttplpfc/ttplpfc_hal.h")
	.dwattr $C$DW$846, DW_AT_decl_line(0x36)
	.dwattr $C$DW$846, DW_AT_decl_column(0x13)

$C$DW$847	.dwtag  DW_TAG_member
	.dwattr $C$DW$847, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$847, DW_AT_name("CLLLC_SEC_LEG2_L_TEMP")
	.dwattr $C$DW$847, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr $C$DW$847, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$847, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/ttplpfc/ttplpfc_hal.h")
	.dwattr $C$DW$847, DW_AT_decl_line(0x37)
	.dwattr $C$DW$847, DW_AT_decl_column(0x13)

$C$DW$848	.dwtag  DW_TAG_member
	.dwattr $C$DW$848, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$848, DW_AT_name("CLLLC_SEC_LEG2_H_TEMP")
	.dwattr $C$DW$848, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
	.dwattr $C$DW$848, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$848, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/ttplpfc/ttplpfc_hal.h")
	.dwattr $C$DW$848, DW_AT_decl_line(0x38)
	.dwattr $C$DW$848, DW_AT_decl_column(0x13)

	.dwattr $C$DW$T$20, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/ttplpfc/ttplpfc_hal.h")
	.dwattr $C$DW$T$20, DW_AT_decl_line(0x2c)
	.dwattr $C$DW$T$20, DW_AT_decl_column(0x0c)
	.dwendtag $C$DW$T$20

	.dwendtag $C$DW$TU$20


$C$DW$TU$22	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$22

$C$DW$T$22	.dwtag  DW_TAG_union_type
	.dwattr $C$DW$T$22, DW_AT_byte_size(0x18)
$C$DW$849	.dwtag  DW_TAG_member
	.dwattr $C$DW$849, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$849, DW_AT_name("device")
	.dwattr $C$DW$849, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$849, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/ttplpfc/ttplpfc_hal.h")
	.dwattr $C$DW$849, DW_AT_decl_line(0x39)
	.dwattr $C$DW$849, DW_AT_decl_column(0x07)

$C$DW$850	.dwtag  DW_TAG_member
	.dwattr $C$DW$850, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$850, DW_AT_name("array")
	.dwattr $C$DW$850, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$850, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/ttplpfc/ttplpfc_hal.h")
	.dwattr $C$DW$850, DW_AT_decl_line(0x3a)
	.dwattr $C$DW$850, DW_AT_decl_column(0x0f)

	.dwattr $C$DW$T$22, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/ttplpfc/ttplpfc_hal.h")
	.dwattr $C$DW$T$22, DW_AT_decl_line(0x2b)
	.dwattr $C$DW$T$22, DW_AT_decl_column(0x0f)
	.dwendtag $C$DW$T$22

	.dwendtag $C$DW$TU$22


$C$DW$TU$129	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$129
$C$DW$T$129	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$129, DW_AT_name("TTPLPFC_HAL_GaNTemp_Struct")
	.dwattr $C$DW$T$129, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$T$129, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/ttplpfc/ttplpfc_hal.h")
	.dwattr $C$DW$T$129, DW_AT_decl_line(0x3b)
	.dwattr $C$DW$T$129, DW_AT_decl_column(0x03)

	.dwendtag $C$DW$TU$129


$C$DW$TU$2	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$2
$C$DW$T$2	.dwtag  DW_TAG_unspecified_type
	.dwattr $C$DW$T$2, DW_AT_name("void")

	.dwendtag $C$DW$TU$2


$C$DW$TU$4	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$4
$C$DW$T$4	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
	.dwattr $C$DW$T$4, DW_AT_name("bool")
	.dwattr $C$DW$T$4, DW_AT_byte_size(0x01)

	.dwendtag $C$DW$TU$4


$C$DW$TU$5	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$5
$C$DW$T$5	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
	.dwattr $C$DW$T$5, DW_AT_name("signed char")
	.dwattr $C$DW$T$5, DW_AT_byte_size(0x01)

	.dwendtag $C$DW$TU$5


$C$DW$TU$6	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$6
$C$DW$T$6	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
	.dwattr $C$DW$T$6, DW_AT_name("unsigned char")
	.dwattr $C$DW$T$6, DW_AT_byte_size(0x01)

	.dwendtag $C$DW$TU$6


$C$DW$TU$7	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$7
$C$DW$T$7	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$7, DW_AT_encoding(DW_ATE_signed_char)
	.dwattr $C$DW$T$7, DW_AT_name("wchar_t")
	.dwattr $C$DW$T$7, DW_AT_byte_size(0x02)

	.dwendtag $C$DW$TU$7


$C$DW$TU$8	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$8
$C$DW$T$8	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$8, DW_AT_encoding(DW_ATE_signed)
	.dwattr $C$DW$T$8, DW_AT_name("short")
	.dwattr $C$DW$T$8, DW_AT_byte_size(0x01)

	.dwendtag $C$DW$TU$8


$C$DW$TU$9	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$9
$C$DW$T$9	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$9, DW_AT_encoding(DW_ATE_unsigned)
	.dwattr $C$DW$T$9, DW_AT_name("unsigned short")
	.dwattr $C$DW$T$9, DW_AT_byte_size(0x01)

	.dwendtag $C$DW$TU$9


$C$DW$TU$10	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$10
