TMS320C2000 Assembler PC v22.6.0 Tue Dec 20 15:55:15 2022

Copyright (c) 1996-2018 Texas Instruments Incorporated
clllc_hal.asm                                                        PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 G3 C/C++ Codegen                               PC v22.6.0.LTS *
       3              ;* Date/Time created: Tue Dec 20 15:55:13 2022                 *
       4              ;***************************************************************
       5                      .compiler_opts --abi=eabi --cla_support=cla2 --diag_wrap=off --float_support=fpu64 --hll_source=on --
       6                      .asg    XAR2, FP
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("../clllc/clllc_hal.c")
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 G3 C/C++ Codegen PC v22.6.0.LTS Copyright (c) 1996-2
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("C:\Users\gerar\workspace_v12\7.4kW_OBC_F28003x\RELEASE")
      13              
      14              $C$DW$1 .dwtag  DW_TAG_subprogram
      15                      .dwattr $C$DW$1, DW_AT_name("Device_init")
      16                      .dwattr $C$DW$1, DW_AT_linkage_name("Device_init")

   13910                      .dwattr $C$DW$1230, DW_AT_const_value(0x0a)
   13911                      .dwattr $C$DW$1230, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/device/driverlib/
   13912                      .dwattr $C$DW$1230, DW_AT_decl_line(0x8c)
   13913                      .dwattr $C$DW$1230, DW_AT_decl_column(0x05)
   13914              
   13915              $C$DW$1231      .dwtag  DW_TAG_enumerator
   13916                      .dwattr $C$DW$1231, DW_AT_name("SCI_FIFO_TX11")
   13917                      .dwattr $C$DW$1231, DW_AT_const_value(0x0b)
   13918                      .dwattr $C$DW$1231, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/device/driverlib/
   13919                      .dwattr $C$DW$1231, DW_AT_decl_line(0x8d)
   13920                      .dwattr $C$DW$1231, DW_AT_decl_column(0x05)
   13921              
   13922              $C$DW$1232      .dwtag  DW_TAG_enumerator
   13923                      .dwattr $C$DW$1232, DW_AT_name("SCI_FIFO_TX12")
   13924                      .dwattr $C$DW$1232, DW_AT_const_value(0x0c)
   13925                      .dwattr $C$DW$1232, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/device/driverlib/
   13926                      .dwattr $C$DW$1232, DW_AT_decl_line(0x8e)
   13927                      .dwattr $C$DW$1232, DW_AT_decl_column(0x05)
   13928              
   13929              $C$DW$1233      .dwtag  DW_TAG_enumerator
   13930                      .dwattr $C$DW$1233, DW_AT_name("SCI_FIFO_TX13")
   13931                      .dwattr $C$DW$1233, DW_AT_const_value(0x0d)
   13932                      .dwattr $C$DW$1233, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/device/driverlib/
   13933                      .dwattr $C$DW$1233, DW_AT_decl_line(0x8f)
   13934                      .dwattr $C$DW$1233, DW_AT_decl_column(0x05)
   13935              
   13936              $C$DW$1234      .dwtag  DW_TAG_enumerator
   13937                      .dwattr $C$DW$1234, DW_AT_name("SCI_FIFO_TX14")
   13938                      .dwattr $C$DW$1234, DW_AT_const_value(0x0e)
   13939                      .dwattr $C$DW$1234, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/device/driverlib/
   13940                      .dwattr $C$DW$1234, DW_AT_decl_line(0x90)
   13941                      .dwattr $C$DW$1234, DW_AT_decl_column(0x05)
   13942              
   13943              $C$DW$1235      .dwtag  DW_TAG_enumerator
   13944                      .dwattr $C$DW$1235, DW_AT_name("SCI_FIFO_TX15")
   13945                      .dwattr $C$DW$1235, DW_AT_const_value(0x0f)
   13946                      .dwattr $C$DW$1235, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/device/driverlib/
   13947                      .dwattr $C$DW$1235, DW_AT_decl_line(0x91)
   13948                      .dwattr $C$DW$1235, DW_AT_decl_column(0x05)
   13949              
   13950              $C$DW$1236      .dwtag  DW_TAG_enumerator
   13951                      .dwattr $C$DW$1236, DW_AT_name("SCI_FIFO_TX16")
   13952                      .dwattr $C$DW$1236, DW_AT_const_value(0x10)
   13953                      .dwattr $C$DW$1236, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/device/driverlib/
   13954                      .dwattr $C$DW$1236, DW_AT_decl_line(0x92)
   13955                      .dwattr $C$DW$1236, DW_AT_decl_column(0x05)
   13956              
   13957                      .dwattr $C$DW$T$153, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/device/driverlib
   13958                      .dwattr $C$DW$T$153, DW_AT_decl_line(0x81)
   13959                      .dwattr $C$DW$T$153, DW_AT_decl_column(0x01)
   13960                      .dwendtag $C$DW$T$153
   13961              
TMS320C2000 Assembler PC v22.6.0 Tue Dec 20 15:55:15 2022

Copyright (c) 1996-2018 Texas Instruments Incorporated
clllc_hal.asm                                                        PAGE  279

   13962                      .dwendtag $C$DW$TU$153
   13963              
   13964              
   13965              $C$DW$TU$154    .dwtag  DW_TAG_type_unit
   13966                      .dwmtype  $C$DW$T$154
   13967              $C$DW$T$154     .dwtag  DW_TAG_typedef
   13968                      .dwattr $C$DW$T$154, DW_AT_name("SCI_TxFIFOLevel")
   13969                      .dwattr $C$DW$T$154, DW_AT_type(*$C$DW$T$153)
   13970                      .dwattr $C$DW$T$154, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/device/driverlib
   13971                      .dwattr $C$DW$T$154, DW_AT_decl_line(0x93)
   13972                      .dwattr $C$DW$T$154, DW_AT_decl_column(0x03)
   13973              
   13974                      .dwendtag $C$DW$TU$154
   13975              
   13976              
   13977              $C$DW$TU$20     .dwtag  DW_TAG_type_unit
   13978                      .dwmtype  $C$DW$T$20
   13979              
   13980              $C$DW$T$20      .dwtag  DW_TAG_structure_type
   13981                      .dwattr $C$DW$T$20, DW_AT_byte_size(0x18)
   13982              $C$DW$1237      .dwtag  DW_TAG_member
   13983                      .dwattr $C$DW$1237, DW_AT_type(*$C$DW$T$19)
   13984                      .dwattr $C$DW$1237, DW_AT_name("TTPLPFC_PH1_H_TEMP")
   13985                      .dwattr $C$DW$1237, DW_AT_accessibility(DW_ACCESS_public)
   13986                      .dwattr $C$DW$1237, DW_AT_decl_file("..\clllc\clllc_hal.h")
   13987                      .dwattr $C$DW$1237, DW_AT_decl_line(0x2e)
   13988                      .dwattr $C$DW$1237, DW_AT_decl_column(0x13)
   13989              
   13990              $C$DW$1238      .dwtag  DW_TAG_member
   13991                      .dwattr $C$DW$1238, DW_AT_type(*$C$DW$T$19)
   13992                      .dwattr $C$DW$1238, DW_AT_name("TTPLPFC_PH1_L_TEMP")
   13993                      .dwattr $C$DW$1238, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   13994                      .dwattr $C$DW$1238, DW_AT_accessibility(DW_ACCESS_public)
   13995                      .dwattr $C$DW$1238, DW_AT_decl_file("..\clllc\clllc_hal.h")
   13996                      .dwattr $C$DW$1238, DW_AT_decl_line(0x2f)
   13997                      .dwattr $C$DW$1238, DW_AT_decl_column(0x13)
   13998              
   13999              $C$DW$1239      .dwtag  DW_TAG_member
   14000                      .dwattr $C$DW$1239, DW_AT_type(*$C$DW$T$19)
   14001                      .dwattr $C$DW$1239, DW_AT_name("TTPLPFC_PH2_L_TEMP")
   14002                      .dwattr $C$DW$1239, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   14003                      .dwattr $C$DW$1239, DW_AT_accessibility(DW_ACCESS_public)
   14004                      .dwattr $C$DW$1239, DW_AT_decl_file("..\clllc\clllc_hal.h")
   14005                      .dwattr $C$DW$1239, DW_AT_decl_line(0x30)
   14006                      .dwattr $C$DW$1239, DW_AT_decl_column(0x13)
   14007              
   14008              $C$DW$1240      .dwtag  DW_TAG_member
   14009                      .dwattr $C$DW$1240, DW_AT_type(*$C$DW$T$19)
   14010                      .dwattr $C$DW$1240, DW_AT_name("TTPLPFC_PH2_H_TEMP")
   14011                      .dwattr $C$DW$1240, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
   14012                      .dwattr $C$DW$1240, DW_AT_accessibility(DW_ACCESS_public)
   14013                      .dwattr $C$DW$1240, DW_AT_decl_file("..\clllc\clllc_hal.h")
   14014                      .dwattr $C$DW$1240, DW_AT_decl_line(0x31)
   14015                      .dwattr $C$DW$1240, DW_AT_decl_column(0x13)
   14016              
TMS320C2000 Assembler PC v22.6.0 Tue Dec 20 15:55:15 2022

Copyright (c) 1996-2018 Texas Instruments Incorporated
clllc_hal.asm                                                        PAGE  280

   14017              $C$DW$1241      .dwtag  DW_TAG_member
   14018                      .dwattr $C$DW$1241, DW_AT_type(*$C$DW$T$19)
   14019                      .dwattr $C$DW$1241, DW_AT_name("CLLLC_PRIM_LEG1_H_TEMP")
   14020                      .dwattr $C$DW$1241, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
   14021                      .dwattr $C$DW$1241, DW_AT_accessibility(DW_ACCESS_public)
   14022                      .dwattr $C$DW$1241, DW_AT_decl_file("..\clllc\clllc_hal.h")
   14023                      .dwattr $C$DW$1241, DW_AT_decl_line(0x32)
   14024                      .dwattr $C$DW$1241, DW_AT_decl_column(0x13)
   14025              
   14026              $C$DW$1242      .dwtag  DW_TAG_member
   14027                      .dwattr $C$DW$1242, DW_AT_type(*$C$DW$T$19)
   14028                      .dwattr $C$DW$1242, DW_AT_name("CLLLC_PRIM_LEG1_L_TEMP")
   14029                      .dwattr $C$DW$1242, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
   14030                      .dwattr $C$DW$1242, DW_AT_accessibility(DW_ACCESS_public)
   14031                      .dwattr $C$DW$1242, DW_AT_decl_file("..\clllc\clllc_hal.h")
   14032                      .dwattr $C$DW$1242, DW_AT_decl_line(0x33)
   14033                      .dwattr $C$DW$1242, DW_AT_decl_column(0x13)
   14034              
   14035              $C$DW$1243      .dwtag  DW_TAG_member
   14036                      .dwattr $C$DW$1243, DW_AT_type(*$C$DW$T$19)
   14037                      .dwattr $C$DW$1243, DW_AT_name("CLLLC_PRIM_LEG2_L_TEMP")
   14038                      .dwattr $C$DW$1243, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
   14039                      .dwattr $C$DW$1243, DW_AT_accessibility(DW_ACCESS_public)
   14040                      .dwattr $C$DW$1243, DW_AT_decl_file("..\clllc\clllc_hal.h")
   14041                      .dwattr $C$DW$1243, DW_AT_decl_line(0x34)
   14042                      .dwattr $C$DW$1243, DW_AT_decl_column(0x13)
   14043              
   14044              $C$DW$1244      .dwtag  DW_TAG_member
   14045                      .dwattr $C$DW$1244, DW_AT_type(*$C$DW$T$19)
   14046                      .dwattr $C$DW$1244, DW_AT_name("CLLLC_PRIM_LEG2_H_TEMP")
   14047                      .dwattr $C$DW$1244, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
   14048                      .dwattr $C$DW$1244, DW_AT_accessibility(DW_ACCESS_public)
   14049                      .dwattr $C$DW$1244, DW_AT_decl_file("..\clllc\clllc_hal.h")
   14050                      .dwattr $C$DW$1244, DW_AT_decl_line(0x35)
   14051                      .dwattr $C$DW$1244, DW_AT_decl_column(0x13)
   14052              
   14053              $C$DW$1245      .dwtag  DW_TAG_member
   14054                      .dwattr $C$DW$1245, DW_AT_type(*$C$DW$T$19)
   14055                      .dwattr $C$DW$1245, DW_AT_name("CLLLC_SEC_LEG1_H_TEMP")
   14056                      .dwattr $C$DW$1245, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
   14057                      .dwattr $C$DW$1245, DW_AT_accessibility(DW_ACCESS_public)
   14058                      .dwattr $C$DW$1245, DW_AT_decl_file("..\clllc\clllc_hal.h")
   14059                      .dwattr $C$DW$1245, DW_AT_decl_line(0x36)
   14060                      .dwattr $C$DW$1245, DW_AT_decl_column(0x13)
   14061              
   14062              $C$DW$1246      .dwtag  DW_TAG_member
   14063                      .dwattr $C$DW$1246, DW_AT_type(*$C$DW$T$19)
   14064                      .dwattr $C$DW$1246, DW_AT_name("CLLLC_SEC_LEG1_L_TEMP")
   14065                      .dwattr $C$DW$1246, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
   14066                      .dwattr $C$DW$1246, DW_AT_accessibility(DW_ACCESS_public)
   14067                      .dwattr $C$DW$1246, DW_AT_decl_file("..\clllc\clllc_hal.h")
   14068                      .dwattr $C$DW$1246, DW_AT_decl_line(0x37)
   14069                      .dwattr $C$DW$1246, DW_AT_decl_column(0x13)
   14070              
   14071              $C$DW$1247      .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v22.6.0 Tue Dec 20 15:55:15 2022

Copyright (c) 1996-2018 Texas Instruments Incorporated
clllc_hal.asm                                                        PAGE  281

   14072                      .dwattr $C$DW$1247, DW_AT_type(*$C$DW$T$19)
   14073                      .dwattr $C$DW$1247, DW_AT_name("CLLLC_SEC_LEG2_L_TEMP")
   14074                      .dwattr $C$DW$1247, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
   14075                      .dwattr $C$DW$1247, DW_AT_accessibility(DW_ACCESS_public)
   14076                      .dwattr $C$DW$1247, DW_AT_decl_file("..\clllc\clllc_hal.h")
   14077                      .dwattr $C$DW$1247, DW_AT_decl_line(0x38)
   14078                      .dwattr $C$DW$1247, DW_AT_decl_column(0x13)
   14079              
   14080              $C$DW$1248      .dwtag  DW_TAG_member
   14081                      .dwattr $C$DW$1248, DW_AT_type(*$C$DW$T$19)
   14082                      .dwattr $C$DW$1248, DW_AT_name("CLLLC_SEC_LEG2_H_TEMP")
   14083                      .dwattr $C$DW$1248, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
   14084                      .dwattr $C$DW$1248, DW_AT_accessibility(DW_ACCESS_public)
   14085                      .dwattr $C$DW$1248, DW_AT_decl_file("..\clllc\clllc_hal.h")
   14086                      .dwattr $C$DW$1248, DW_AT_decl_line(0x39)
   14087                      .dwattr $C$DW$1248, DW_AT_decl_column(0x13)
   14088              
   14089                      .dwattr $C$DW$T$20, DW_AT_decl_file("..\clllc\clllc_hal.h")
   14090                      .dwattr $C$DW$T$20, DW_AT_decl_line(0x2d)
   14091                      .dwattr $C$DW$T$20, DW_AT_decl_column(0x0c)
   14092                      .dwendtag $C$DW$T$20
   14093              
   14094                      .dwendtag $C$DW$TU$20
   14095              
   14096              
   14097              $C$DW$TU$22     .dwtag  DW_TAG_type_unit
   14098                      .dwmtype  $C$DW$T$22
   14099              
   14100              $C$DW$T$22      .dwtag  DW_TAG_union_type
   14101                      .dwattr $C$DW$T$22, DW_AT_byte_size(0x18)
   14102              $C$DW$1249      .dwtag  DW_TAG_member
   14103                      .dwattr $C$DW$1249, DW_AT_type(*$C$DW$T$20)
   14104                      .dwattr $C$DW$1249, DW_AT_name("device")
   14105                      .dwattr $C$DW$1249, DW_AT_accessibility(DW_ACCESS_public)
   14106                      .dwattr $C$DW$1249, DW_AT_decl_file("..\clllc\clllc_hal.h")
   14107                      .dwattr $C$DW$1249, DW_AT_decl_line(0x3a)
   14108                      .dwattr $C$DW$1249, DW_AT_decl_column(0x07)
   14109              
   14110              $C$DW$1250      .dwtag  DW_TAG_member
   14111                      .dwattr $C$DW$1250, DW_AT_type(*$C$DW$T$21)
   14112                      .dwattr $C$DW$1250, DW_AT_name("array")
   14113                      .dwattr $C$DW$1250, DW_AT_accessibility(DW_ACCESS_public)
   14114                      .dwattr $C$DW$1250, DW_AT_decl_file("..\clllc\clllc_hal.h")
   14115                      .dwattr $C$DW$1250, DW_AT_decl_line(0x3b)
   14116                      .dwattr $C$DW$1250, DW_AT_decl_column(0x0f)
   14117              
   14118                      .dwattr $C$DW$T$22, DW_AT_decl_file("..\clllc\clllc_hal.h")
   14119                      .dwattr $C$DW$T$22, DW_AT_decl_line(0x2c)
   14120                      .dwattr $C$DW$T$22, DW_AT_decl_column(0x0f)
   14121                      .dwendtag $C$DW$T$22
   14122              
   14123                      .dwendtag $C$DW$TU$22
   14124              
   14125              
   14126              $C$DW$TU$158    .dwtag  DW_TAG_type_unit
TMS320C2000 Assembler PC v22.6.0 Tue Dec 20 15:55:15 2022

Copyright (c) 1996-2018 Texas Instruments Incorporated
clllc_hal.asm                                                        PAGE  282

   14127                      .dwmtype  $C$DW$T$158
   14128              $C$DW$T$158     .dwtag  DW_TAG_typedef
   14129                      .dwattr $C$DW$T$158, DW_AT_name("CLLLC_HAL_GaNTemp_Struct")
   14130                      .dwattr $C$DW$T$158, DW_AT_type(*$C$DW$T$22)
   14131                      .dwattr $C$DW$T$158, DW_AT_decl_file("..\clllc\clllc_hal.h")
   14132                      .dwattr $C$DW$T$158, DW_AT_decl_line(0x3c)
   14133                      .dwattr $C$DW$T$158, DW_AT_decl_column(0x03)
   14134              
   14135                      .dwendtag $C$DW$TU$158
   14136              
   14137              
   14138              $C$DW$TU$2      .dwtag  DW_TAG_type_unit
   14139                      .dwmtype  $C$DW$T$2
   14140              $C$DW$T$2       .dwtag  DW_TAG_unspecified_type
   14141                      .dwattr $C$DW$T$2, DW_AT_name("void")
   14142              
   14143                      .dwendtag $C$DW$TU$2
   14144              
   14145              
   14146              $C$DW$TU$4      .dwtag  DW_TAG_type_unit
