TMS320C2000 Assembler PC v22.6.0 Tue Dec 20 15:55:13 2022

Copyright (c) 1996-2018 Texas Instruments Incorporated
clllc_clatasks.asm                                                   PAGE    1

       1              ;***************************************************************
       2              ;* TMS320x280xx Control Law Accelerator G3 C/C++ Codegen                               PC v22.6.0.LTS *
       3              ;* Date/Time created: Tue Dec 20 15:55:13 2022                 *
       4              ;***************************************************************
       5                      .compiler_opts --abi=eabi --cla_support=cla2 --diag_wrap=off --float_support=fpu64 --hll_source=on --
       6              
       7              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       8                      .dwattr $C$DW$CU, DW_AT_name("../clllc/clllc_clatasks.cla")
       9                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320x280xx Control Law Accelerator G3 C/C++ Codegen PC v22.6.0
      10                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      11                      .dwattr $C$DW$CU, DW_AT_comp_dir("C:\Users\gerar\workspace_v12\7.4kW_OBC_F28003x\RELEASE")
      12              $C$DW$1 .dwtag  DW_TAG_variable
      13                      .dwattr $C$DW$1, DW_AT_name("CLLLC_ModulationMode")
      14                      .dwattr $C$DW$1, DW_AT_linkage_name("CLLLC_ModulationMode")

    2447              
    2448                      .dwendtag $C$DW$TU$29
    2449              
    2450              
    2451              $C$DW$TU$30     .dwtag  DW_TAG_type_unit
    2452                      .dwmtype  $C$DW$T$30
    2453              $C$DW$T$30      .dwtag  DW_TAG_typedef
    2454                      .dwattr $C$DW$T$30, DW_AT_name("EPWM_SyncCountMode")
    2455                      .dwattr $C$DW$T$30, DW_AT_type(*$C$DW$T$29)
    2456                      .dwattr $C$DW$T$30, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/device/driverlib/
    2457                      .dwattr $C$DW$T$30, DW_AT_decl_line(0x8e)
    2458                      .dwattr $C$DW$T$30, DW_AT_decl_column(0x03)
    2459              
    2460                      .dwendtag $C$DW$TU$30
    2461              
    2462              
    2463              $C$DW$TU$31     .dwtag  DW_TAG_type_unit
    2464                      .dwmtype  $C$DW$T$31
    2465              
    2466              $C$DW$T$31      .dwtag  DW_TAG_enumeration_type
    2467                      .dwattr $C$DW$T$31, DW_AT_byte_size(0x02)
    2468              $C$DW$100       .dwtag  DW_TAG_enumerator
    2469                      .dwattr $C$DW$100, DW_AT_name("EPWM_COUNTER_COMPARE_A")
    2470                      .dwattr $C$DW$100, DW_AT_const_value(0x00)
TMS320C2000 Assembler PC v22.6.0 Tue Dec 20 15:55:13 2022

Copyright (c) 1996-2018 Texas Instruments Incorporated
clllc_clatasks.asm                                                   PAGE   62

    2471                      .dwattr $C$DW$100, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/device/driverlib/e
    2472                      .dwattr $C$DW$100, DW_AT_decl_line(0x151)
    2473                      .dwattr $C$DW$100, DW_AT_decl_column(0x05)
    2474              
    2475              $C$DW$101       .dwtag  DW_TAG_enumerator
    2476                      .dwattr $C$DW$101, DW_AT_name("EPWM_COUNTER_COMPARE_B")
    2477                      .dwattr $C$DW$101, DW_AT_const_value(0x02)
    2478                      .dwattr $C$DW$101, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/device/driverlib/e
    2479                      .dwattr $C$DW$101, DW_AT_decl_line(0x152)
    2480                      .dwattr $C$DW$101, DW_AT_decl_column(0x05)
    2481              
    2482              $C$DW$102       .dwtag  DW_TAG_enumerator
    2483                      .dwattr $C$DW$102, DW_AT_name("EPWM_COUNTER_COMPARE_C")
    2484                      .dwattr $C$DW$102, DW_AT_const_value(0x05)
    2485                      .dwattr $C$DW$102, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/device/driverlib/e
    2486                      .dwattr $C$DW$102, DW_AT_decl_line(0x153)
    2487                      .dwattr $C$DW$102, DW_AT_decl_column(0x05)
    2488              
    2489              $C$DW$103       .dwtag  DW_TAG_enumerator
    2490                      .dwattr $C$DW$103, DW_AT_name("EPWM_COUNTER_COMPARE_D")
    2491                      .dwattr $C$DW$103, DW_AT_const_value(0x07)
    2492                      .dwattr $C$DW$103, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/device/driverlib/e
    2493                      .dwattr $C$DW$103, DW_AT_decl_line(0x154)
    2494                      .dwattr $C$DW$103, DW_AT_decl_column(0x05)
    2495              
    2496                      .dwattr $C$DW$T$31, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/device/driverlib/
    2497                      .dwattr $C$DW$T$31, DW_AT_decl_line(0x150)
    2498                      .dwattr $C$DW$T$31, DW_AT_decl_column(0x01)
    2499                      .dwendtag $C$DW$T$31
    2500              
    2501                      .dwendtag $C$DW$TU$31
    2502              
    2503              
    2504              $C$DW$TU$32     .dwtag  DW_TAG_type_unit
    2505                      .dwmtype  $C$DW$T$32
    2506              $C$DW$T$32      .dwtag  DW_TAG_typedef
    2507                      .dwattr $C$DW$T$32, DW_AT_name("EPWM_CounterCompareModule")
    2508                      .dwattr $C$DW$T$32, DW_AT_type(*$C$DW$T$31)
    2509                      .dwattr $C$DW$T$32, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/device/driverlib/
    2510                      .dwattr $C$DW$T$32, DW_AT_decl_line(0x155)
    2511                      .dwattr $C$DW$T$32, DW_AT_decl_column(0x03)
    2512              
    2513                      .dwendtag $C$DW$TU$32
    2514              
    2515              
    2516              $C$DW$TU$20     .dwtag  DW_TAG_type_unit
    2517                      .dwmtype  $C$DW$T$20
    2518              
    2519              $C$DW$T$20      .dwtag  DW_TAG_structure_type
    2520                      .dwattr $C$DW$T$20, DW_AT_byte_size(0x20)
    2521              $C$DW$104       .dwtag  DW_TAG_member
    2522                      .dwattr $C$DW$104, DW_AT_type(*$C$DW$T$19)
    2523                      .dwattr $C$DW$104, DW_AT_name("b0")
    2524                      .dwattr $C$DW$104, DW_AT_accessibility(DW_ACCESS_public)
    2525                      .dwattr $C$DW$104, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/DCL/DCLC
TMS320C2000 Assembler PC v22.6.0 Tue Dec 20 15:55:13 2022

Copyright (c) 1996-2018 Texas Instruments Incorporated
clllc_clatasks.asm                                                   PAGE   63

    2526                      .dwattr $C$DW$104, DW_AT_decl_line(0xc7)
    2527                      .dwattr $C$DW$104, DW_AT_decl_column(0x0f)
    2528              
    2529              $C$DW$105       .dwtag  DW_TAG_member
    2530                      .dwattr $C$DW$105, DW_AT_type(*$C$DW$T$19)
    2531                      .dwattr $C$DW$105, DW_AT_name("b1")
    2532                      .dwattr $C$DW$105, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2533                      .dwattr $C$DW$105, DW_AT_accessibility(DW_ACCESS_public)
    2534                      .dwattr $C$DW$105, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/DCL/DCLC
    2535                      .dwattr $C$DW$105, DW_AT_decl_line(0xc8)
    2536                      .dwattr $C$DW$105, DW_AT_decl_column(0x0f)
    2537              
    2538              $C$DW$106       .dwtag  DW_TAG_member
    2539                      .dwattr $C$DW$106, DW_AT_type(*$C$DW$T$19)
    2540                      .dwattr $C$DW$106, DW_AT_name("b2")
    2541                      .dwattr $C$DW$106, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2542                      .dwattr $C$DW$106, DW_AT_accessibility(DW_ACCESS_public)
    2543                      .dwattr $C$DW$106, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/DCL/DCLC
    2544                      .dwattr $C$DW$106, DW_AT_decl_line(0xc9)
    2545                      .dwattr $C$DW$106, DW_AT_decl_column(0x0f)
    2546              
    2547              $C$DW$107       .dwtag  DW_TAG_member
    2548                      .dwattr $C$DW$107, DW_AT_type(*$C$DW$T$19)
    2549                      .dwattr $C$DW$107, DW_AT_name("b3")
    2550                      .dwattr $C$DW$107, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2551                      .dwattr $C$DW$107, DW_AT_accessibility(DW_ACCESS_public)
    2552                      .dwattr $C$DW$107, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/DCL/DCLC
    2553                      .dwattr $C$DW$107, DW_AT_decl_line(0xca)
    2554                      .dwattr $C$DW$107, DW_AT_decl_column(0x0f)
    2555              
    2556              $C$DW$108       .dwtag  DW_TAG_member
    2557                      .dwattr $C$DW$108, DW_AT_type(*$C$DW$T$19)
    2558                      .dwattr $C$DW$108, DW_AT_name("a0")
    2559                      .dwattr $C$DW$108, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2560                      .dwattr $C$DW$108, DW_AT_accessibility(DW_ACCESS_public)
    2561                      .dwattr $C$DW$108, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/DCL/DCLC
    2562                      .dwattr $C$DW$108, DW_AT_decl_line(0xcb)
    2563                      .dwattr $C$DW$108, DW_AT_decl_column(0x0f)
    2564              
    2565              $C$DW$109       .dwtag  DW_TAG_member
    2566                      .dwattr $C$DW$109, DW_AT_type(*$C$DW$T$19)
    2567                      .dwattr $C$DW$109, DW_AT_name("a1")
    2568                      .dwattr $C$DW$109, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    2569                      .dwattr $C$DW$109, DW_AT_accessibility(DW_ACCESS_public)
    2570                      .dwattr $C$DW$109, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/DCL/DCLC
    2571                      .dwattr $C$DW$109, DW_AT_decl_line(0xcc)
    2572                      .dwattr $C$DW$109, DW_AT_decl_column(0x0f)
    2573              
    2574              $C$DW$110       .dwtag  DW_TAG_member
    2575                      .dwattr $C$DW$110, DW_AT_type(*$C$DW$T$19)
    2576                      .dwattr $C$DW$110, DW_AT_name("a2")
    2577                      .dwattr $C$DW$110, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2578                      .dwattr $C$DW$110, DW_AT_accessibility(DW_ACCESS_public)
    2579                      .dwattr $C$DW$110, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/DCL/DCLC
    2580                      .dwattr $C$DW$110, DW_AT_decl_line(0xcd)
TMS320C2000 Assembler PC v22.6.0 Tue Dec 20 15:55:13 2022

Copyright (c) 1996-2018 Texas Instruments Incorporated
clllc_clatasks.asm                                                   PAGE   64

    2581                      .dwattr $C$DW$110, DW_AT_decl_column(0x0f)
    2582              
    2583              $C$DW$111       .dwtag  DW_TAG_member
    2584                      .dwattr $C$DW$111, DW_AT_type(*$C$DW$T$19)
    2585                      .dwattr $C$DW$111, DW_AT_name("a3")
    2586                      .dwattr $C$DW$111, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    2587                      .dwattr $C$DW$111, DW_AT_accessibility(DW_ACCESS_public)
    2588                      .dwattr $C$DW$111, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/DCL/DCLC
    2589                      .dwattr $C$DW$111, DW_AT_decl_line(0xce)
    2590                      .dwattr $C$DW$111, DW_AT_decl_column(0x0f)
    2591              
    2592              $C$DW$112       .dwtag  DW_TAG_member
    2593                      .dwattr $C$DW$112, DW_AT_type(*$C$DW$T$19)
    2594                      .dwattr $C$DW$112, DW_AT_name("d0")
    2595                      .dwattr $C$DW$112, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    2596                      .dwattr $C$DW$112, DW_AT_accessibility(DW_ACCESS_public)
    2597                      .dwattr $C$DW$112, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/DCL/DCLC
    2598                      .dwattr $C$DW$112, DW_AT_decl_line(0xd1)
    2599                      .dwattr $C$DW$112, DW_AT_decl_column(0x0f)
    2600              
    2601              $C$DW$113       .dwtag  DW_TAG_member
    2602                      .dwattr $C$DW$113, DW_AT_type(*$C$DW$T$19)
    2603                      .dwattr $C$DW$113, DW_AT_name("d1")
    2604                      .dwattr $C$DW$113, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    2605                      .dwattr $C$DW$113, DW_AT_accessibility(DW_ACCESS_public)
    2606                      .dwattr $C$DW$113, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/DCL/DCLC
    2607                      .dwattr $C$DW$113, DW_AT_decl_line(0xd2)
    2608                      .dwattr $C$DW$113, DW_AT_decl_column(0x0f)
    2609              
    2610              $C$DW$114       .dwtag  DW_TAG_member
    2611                      .dwattr $C$DW$114, DW_AT_type(*$C$DW$T$19)
    2612                      .dwattr $C$DW$114, DW_AT_name("d2")
    2613                      .dwattr $C$DW$114, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    2614                      .dwattr $C$DW$114, DW_AT_accessibility(DW_ACCESS_public)
    2615                      .dwattr $C$DW$114, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/DCL/DCLC
    2616                      .dwattr $C$DW$114, DW_AT_decl_line(0xd3)
    2617                      .dwattr $C$DW$114, DW_AT_decl_column(0x0f)
    2618              
    2619              $C$DW$115       .dwtag  DW_TAG_member
    2620                      .dwattr $C$DW$115, DW_AT_type(*$C$DW$T$19)
    2621                      .dwattr $C$DW$115, DW_AT_name("d3")
    2622                      .dwattr $C$DW$115, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    2623                      .dwattr $C$DW$115, DW_AT_accessibility(DW_ACCESS_public)
    2624                      .dwattr $C$DW$115, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/DCL/DCLC
    2625                      .dwattr $C$DW$115, DW_AT_decl_line(0xd4)
    2626                      .dwattr $C$DW$115, DW_AT_decl_column(0x0f)
    2627              
    2628              $C$DW$116       .dwtag  DW_TAG_member
    2629                      .dwattr $C$DW$116, DW_AT_type(*$C$DW$T$19)
    2630                      .dwattr $C$DW$116, DW_AT_name("d4")
    2631                      .dwattr $C$DW$116, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    2632                      .dwattr $C$DW$116, DW_AT_accessibility(DW_ACCESS_public)
    2633                      .dwattr $C$DW$116, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/DCL/DCLC
    2634                      .dwattr $C$DW$116, DW_AT_decl_line(0xd5)
    2635                      .dwattr $C$DW$116, DW_AT_decl_column(0x0f)
TMS320C2000 Assembler PC v22.6.0 Tue Dec 20 15:55:13 2022

Copyright (c) 1996-2018 Texas Instruments Incorporated
clllc_clatasks.asm                                                   PAGE   65

    2636              
    2637              $C$DW$117       .dwtag  DW_TAG_member
    2638                      .dwattr $C$DW$117, DW_AT_type(*$C$DW$T$19)
    2639                      .dwattr $C$DW$117, DW_AT_name("d5")
    2640                      .dwattr $C$DW$117, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    2641                      .dwattr $C$DW$117, DW_AT_accessibility(DW_ACCESS_public)
    2642                      .dwattr $C$DW$117, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/DCL/DCLC
    2643                      .dwattr $C$DW$117, DW_AT_decl_line(0xd6)
    2644                      .dwattr $C$DW$117, DW_AT_decl_column(0x0f)
    2645              
    2646              $C$DW$118       .dwtag  DW_TAG_member
    2647                      .dwattr $C$DW$118, DW_AT_type(*$C$DW$T$19)
    2648                      .dwattr $C$DW$118, DW_AT_name("d6")
    2649                      .dwattr $C$DW$118, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    2650                      .dwattr $C$DW$118, DW_AT_accessibility(DW_ACCESS_public)
    2651                      .dwattr $C$DW$118, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/DCL/DCLC
    2652                      .dwattr $C$DW$118, DW_AT_decl_line(0xd7)
    2653                      .dwattr $C$DW$118, DW_AT_decl_column(0x0f)
    2654              
    2655              $C$DW$119       .dwtag  DW_TAG_member
    2656                      .dwattr $C$DW$119, DW_AT_type(*$C$DW$T$19)
    2657                      .dwattr $C$DW$119, DW_AT_name("d7")
    2658                      .dwattr $C$DW$119, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    2659                      .dwattr $C$DW$119, DW_AT_accessibility(DW_ACCESS_public)
    2660                      .dwattr $C$DW$119, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/DCL/DCLC
    2661                      .dwattr $C$DW$119, DW_AT_decl_line(0xd8)
    2662                      .dwattr $C$DW$119, DW_AT_decl_column(0x0f)
    2663              
    2664                      .dwattr $C$DW$T$20, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/DCL/DCL
    2665                      .dwattr $C$DW$T$20, DW_AT_decl_line(0xc5)
    2666                      .dwattr $C$DW$T$20, DW_AT_decl_column(0x10)
    2667                      .dwendtag $C$DW$T$20
    2668              
    2669                      .dwendtag $C$DW$TU$20
    2670              
    2671              
    2672              $C$DW$TU$33     .dwtag  DW_TAG_type_unit
    2673                      .dwmtype  $C$DW$T$33
    2674              $C$DW$T$33      .dwtag  DW_TAG_typedef
    2675                      .dwattr $C$DW$T$33, DW_AT_name("DCL_DF13_CLA")
    2676                      .dwattr $C$DW$T$33, DW_AT_type(*$C$DW$T$20)
    2677                      .dwattr $C$DW$T$33, DW_AT_decl_file("C:/Users/gerar/workspace_v12/7.4kW_OBC_F28003x/libraries/DCL/DCL
    2678                      .dwattr $C$DW$T$33, DW_AT_decl_line(0xd9)
    2679                      .dwattr $C$DW$T$33, DW_AT_decl_column(0x03)
    2680              
    2681                      .dwendtag $C$DW$TU$33
    2682              
    2683              
    2684              $C$DW$TU$24     .dwtag  DW_TAG_type_unit
    2685                      .dwmtype  $C$DW$T$24
    2686              
    2687              $C$DW$T$24      .dwtag  DW_TAG_union_type
    2688                      .dwattr $C$DW$T$24, DW_AT_byte_size(0x02)
    2689              $C$DW$120       .dwtag  DW_TAG_member
    2690                      .dwattr $C$DW$120, DW_AT_type(*$C$DW$T$21)
TMS320C2000 Assembler PC v22.6.0 Tue Dec 20 15:55:13 2022

Copyright (c) 1996-2018 Texas Instruments Incorporated
clllc_clatasks.asm                                                   PAGE   66

    2691                      .dwattr $C$DW$120, DW_AT_name("CLLLC_ModulationMode_Enum")
    2692                      .dwattr $C$DW$120, DW_AT_accessibility(DW_ACCESS_public)
    2693                      .dwattr $C$DW$120, DW_AT_decl_file("..\clllc\clllc.h")
    2694                      .dwattr $C$DW$120, DW_AT_decl_line(0x114)
    2695                      .dwattr $C$DW$120, DW_AT_decl_column(0x06)
    2696              
    2697              $C$DW$121       .dwtag  DW_TAG_member
    2698                      .dwattr $C$DW$121, DW_AT_type(*$C$DW$T$23)
    2699                      .dwattr $C$DW$121, DW_AT_name("pad")
    2700                      .dwattr $C$DW$121, DW_AT_accessibility(DW_ACCESS_public)
    2701                      .dwattr $C$DW$121, DW_AT_decl_file("..\clllc\clllc.h")
    2702                      .dwattr $C$DW$121, DW_AT_decl_line(0x115)
    2703                      .dwattr $C$DW$121, DW_AT_decl_column(0x0d)
    2704              
    2705                      .dwattr $C$DW$T$24, DW_AT_decl_file("..\clllc\clllc.h")
    2706                      .dwattr $C$DW$T$24, DW_AT_decl_line(0x10f)
    2707                      .dwattr $C$DW$T$24, DW_AT_decl_column(0x0e)
    2708                      .dwendtag $C$DW$T$24
    2709              
    2710                      .dwendtag $C$DW$TU$24
    2711              
    2712              
    2713              $C$DW$TU$35     .dwtag  DW_TAG_type_unit
    2714                      .dwmtype  $C$DW$T$35
    2715              $C$DW$T$35      .dwtag  DW_TAG_typedef
    2716                      .dwattr $C$DW$T$35, DW_AT_name("CLLLC_ModulationMode_EnumType")
    2717                      .dwattr $C$DW$T$35, DW_AT_type(*$C$DW$T$24)
